[{"id":"EJ1048414","title":"Twenty Years of MALL Project Implementation: A Meta-Analysis of Learning Outcomes","author":"Burston, Jack","description":"Despite the hundreds of Mobile-Assisted Language Learning (MALL) publications over the past twenty years, statistically reliable measures of learning outcomes are few and far between. In part, this is due to the fact that well over half of all MALL-related studies report no objectively quantifiable learning outcomes, either because they did not involve MALL implementation projects, or if they did, learning gains were only based on subjective teacher assessments and\/or student self-evaluations. Even more so, the paucity of statistically reliable learning outcome data stems from the short duration of projects and small numbers of students involved. Of the 291 distinct studies examined in this review only 35 meet minimal conditions of duration and sample size, i.e., ten experimental subjects over a period of at least a month. Sixteen of these suffer from serious design shortcomings, leaving only nineteen MALL studies that can reliably serve as a basis for determining the learning outcomes of mobile-based language applications. Of these studies, fifteen can be considered to report unequivocal positive results, with those focusing on reading, listening and speaking without exception evidencing a MALL application advantage. Four studies, all focusing on vocabulary, reported no significant differences.","subject":"Educational Technology, Technology Uses in Education, Second Language Instruction, Second Language Learning, Research Methodology, Instructional Effectiveness, Meta Analysis, Telecommunications, Grammar, Vocabulary Development, Reading Skills, Listening Skills, Speech Skills","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059672","title":"English Learning Websites and Digital Resources from the Perspective of Chinese University EFL Practitioners","author":"Shen, Huizhong, Yuan, Yifeng, Ewing, Robyn","description":"English language learning (ELL) websites and digital resources have been recognized as an important source of linguistic and cultural knowledge for English as a foreign language (EFL) learners to explore. The up-to-date information carried by authentic materials is invaluable for learners to develop an understanding of the target language\/culture. However, there appears to be a gap between what the designer intends and what the user wants. This paper investigates Chinese university EFL teachers' perceptions of online English language websites and resources. The study focuses on a number of components of major language areas and skills in ELL websites, website materials, language users' preferences, and website usability. A total of 1519 English academics from 139 universities across China completed the online survey, and 164 of them voluntarily participated in focus group interviews anonymously. The empirical evidence of this study has highlighted that a pedagogically-oriented ELL website, targeting audiences with a variety of language proficiencies, was much liked by the Chinese EFL teachers. A preference was observed to see more current authentic language, examination-oriented English learning materials and tasks, and Eastern\/non-Anglophone topics in the websites. In addition, it is found that website usability is another key factor that would impact ELL website popularity. A well-designed ELL website can effectively assist Chinese EFL learners to enhance their language competence and achieve optimal learning outcomes. This study provides a context-specific empirical base for innovative web-based EFL learning and teaching as well as website design and materials development in China. The proposed key features of a preferred ELL website may help better inform website designers, content writers and evaluators in their ELL website design\/evaluation.","subject":"Asians, Second Language Learning, English (Second Language), Web Sites, College Faculty, Teacher Attitudes, Usability, Online Surveys, Focus Groups, Interviews, Cultural Awareness, Educational Resources, Universities, Foreign Countries, Language Proficiency, Outcomes of Education, Second Language Instruction, Innovation, Material Development, Evaluators","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1048374","title":"Learning Motivation and Adaptive Video Caption Filtering for EFL Learners Using Handheld Devices","author":"Hsu, Ching-Kun","description":"The aim of this study was to provide adaptive assistance to improve the listening comprehension of eleventh grade students. This study developed a video-based language learning system for handheld devices, using three levels of caption filtering adapted to student needs. Elementary level captioning excluded 220 English sight words (see Section 1 for definition), but provided captions and Chinese translations for the remaining words. Intermediate level excluded 1000 high frequency English words, but provided captions for the remaining words, and 2200 high frequency English words were excluded at the high intermediate caption filtering level. The result was that the viewers were provided with captions for words that were likely to be unfamiliar to them. Participants in the experimental group were assigned bilingual caption modes according to their pre-test results, while those in the control group were assigned standard caption modes. Our results indicate that students in the experimental group preferred adaptive captions, enjoyed the exercises more, and gained greater intrinsic motivation compared to those in the control group. The results confirm that different students require different quantities of information to balance listening comprehension and indicate that the proposed adaptive caption filtering approach may be an effective way to improve the skills required for listening proficiency.","subject":"Learning Motivation, English (Second Language), Second Language Learning, Second Language Instruction, Video Technology, Experimental Groups, Bilingualism, Control Groups, Pretests Posttests, Handheld Devices, Listening Comprehension, High School Students, Teaching Methods, Word Frequency, Chinese, Translation","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]