[{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"},{"id":"EJ1051460","title":"Corpus-Based versus Traditional Learning of Collocations","author":"Daskalovska, Nina","description":"One of the aspects of knowing a word is the knowledge of which words it is usually used with. Since knowledge of collocations is essential for appropriate and fluent use of language, learning collocations should have a central place in the study of vocabulary. There are different opinions about the best ways of learning collocations. This study investigates the effectiveness of corpus-based activities for learning verb-adverb collocations compared to traditional activities usually found in course books. The test results show that the participants who learned the collocations with the help of the online concordancer gained more knowledge and had better results in all parts of the test.","subject":"Computational Linguistics, Phrase Structure, Verbs, Form Classes (Languages), Teaching Methods, Indexes, Language Tests, Language Fluency, Instructional Effectiveness, Foreign Countries, Undergraduate Students, Second Language Instruction, Second Language Learning, Experimental Groups, Pretests Posttests, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Macedonia"},{"id":"EJ1047667","title":"Flipping the Classroom for English Language Learners to Foster Active Learning","author":"Hung, Hsiu-Ting","description":"This paper describes a structured attempt to integrate flip teaching into language classrooms using a WebQuest active learning strategy. The purpose of this study is to examine the possible impacts of flipping the classroom on English language learners' academic performance, learning attitudes, and participation levels. Adopting a quasi-experimental design, three different formats for flip teaching were developed in this study. The results indicate that the structured and semi-structured flip lessons were more effective instructional designs than the non-flip lessons. With a varying extent, both the structured and semi-structured flip lessons helped the students attain better learning outcomes, develop better attitudes toward their learning experiences, and devote more effort in the learning process. Given the positive results, this paper concludes with a call for more research into this promising pedagogy to contribute to its knowledge base across disciplines.","subject":"Active Learning, Second Language Learning, Learning Experience, Teaching Methods, Learning Processes, Computer Assisted Instruction, Academic Achievement, Student Attitudes, Quasiexperimental Design, English (Second Language), Second Language Instruction, Foreign Countries, Communicative Competence (Languages), Instructional Effectiveness, Questionnaires, Semi Structured Interviews, Statistical Analysis, Student Participation, College Students, Blended Learning","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063571","title":"Computer-Based Grammar Instruction in an EFL Context: Improving the Effectiveness of Teaching Adverbial Clauses","author":"Kiliçkaya, Ferit","description":"This study aims to find out whether there are any statistically significant differences in participants' achievements on three different types of instruction: computer-based instruction, teacher-driven instruction, and teacher-driven grammar supported by computer-based instruction. Each type of instruction follows the deductive approach. The sample of the study consists of 50 learners of English enrolled in a preparatory course for a high-stake language exam conducted in Turkey. The effectiveness is compared based on the results obtained from the post-test and the delayed post-test, which is conducted five weeks later. The participants instructed by using both computer-based and teacher-driven grammar instruction supported by computer-based materials score higher than those who receive traditional instruction. Moreover, supporting teacher-driven instruction with computer-based materials in learning adverbial clauses can lead to higher achievement through taking practice beyond the classroom.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Grammar, English (Second Language), Teaching Methods, High Stakes Tests, Foreign Countries, Scores, Conventional Instruction, Form Classes (Languages), Phrase Structure, Academic Achievement, Instructional Effectiveness, Language Tests, Experimental Groups, Courseware, Instructional Materials, Pretests Posttests, Language Proficiency, Employment Qualifications","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"},{"id":"EJ1080885","title":"Spoken Grammar Practice and Feedback in an ASR-Based CALL System","author":"de Vries, Bart Penning, Cucchiarini, Catia, Bodnar, Stephen, Strik, Helmer, van Hout, Roeland","description":"Speaking practice is important for learners of a second language. Computer assisted language learning (CALL) systems can provide attractive opportunities for speaking practice when combined with automatic speech recognition (ASR) technology. In this paper, we present a CALL system that offers spoken practice of word order, an important aspect of Dutch grammar. The system uses ASR technology to process the learner's responses and to detect errors so that immediate corrective feedback (CF) can be provided on learner errors. We evaluate the system as a learning environment by analyzing proficiency gains in pre- and post-tests, the logs of the practice sessions, and the learners' appreciation of the system. In this paper, we present two learning conditions: (1) the learners received oral practice and immediate CF on spoken performance and (2) learners received oral practice and NO CF on spoken performance. We found that our system was successful in providing L2 speaking practice. Results show that both groups improve their proficiency on the target feature as a result of treatment. Between the groups there is no significant difference in learning, but the groups proceeded differently through the sessions, and the learners in the group that received automatic CF evaluated the system more positively than the NO CF group. We discuss the performance of the system as an environment for language learning and the obtained proficiency test results, and relate them to current views on second language acquisition.","subject":"Grammar, Computer Assisted Instruction, Feedback (Response), Error Correction, Language Proficiency, Pretests Posttests, Oral Language, Second Language Learning, Indo European Languages, Second Language Instruction, Language Tests, Task Analysis, Adult Students, Video Technology, Foreign Countries, Likert Scales, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Netherlands"}]