[{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015},{"id":"EJ1074888","title":"Mobile Technology in Second Language Classrooms: Insights into Its Uses, Pedagogical Implications, and Teacher Beliefs","author":"Van Praag, Benjamin, Sanchez, Hugo Santiago","description":"Adopting a multiple-case, multiple-method design, this study investigates mobile technology use in the practices of three experienced second language teachers. The findings, based on an analysis of the teachers' rationales, stated beliefs and classroom actions, show that the teachers tend to prohibit or reluctantly tolerate mobile device usage, while they recognise some of its potential benefits to support their teaching and student learning. They also highlight the incentives and barriers which respectively facilitate and hinder the integration of mobile technology, including factors which are internal (e.g. beliefs) and external (e.g. contextual constraints) to the teachers. Implications for classroom practice and teacher education are drawn.","subject":"Teaching Methods, Educational Technology, Technology Uses in Education, Case Studies, Mixed Methods Research, Telecommunications, Handheld Devices, Teacher Attitudes, Barriers, Incentives, Technology Integration, Second Language Instruction","source":"ReCALL","publicationdateyear":2015},{"id":"EJ1048372","title":"The Story in the Mind: The Effect of 3D Gameplay on the Structuring of Written L2 Narratives","author":"Neville, David O.","description":"The article reports on a mixed-methods study evaluating the use of a three-dimensional digital game-based language learning (3D-DGBLL) environment to teach German two-way prepositions and specialized vocabulary within a simulated real-world context of German recycling and waste management systems. The study assumed that goal-directed player activity in this environment would configure digital narratives, which in turn would help study participants in the experimental group to co-configure story maps for ordering and making sense of the problem spaces encountered in the environment. The study further assumed that these participants would subsequently rely on the story maps to help them structure written L2 narratives describing an imagined personal experience closely resembling the gameplay of the 3D-DGBLL environment. The study found that immersion in the 3D-DGBLL environment influenced the manner in which the second language was invoked in these written narratives: Participants in the experimental group produced narratives containing more textual indicators describing the activity associated with the recycling and waste management systems and the spaces in which these systems are located. Increased usage of these indicators suggest that participants in the experimental group did indeed rely on story maps generated during 3D gameplay to structure their narratives, although stylistic and grammatical features of the narratives suggest, however, that changes could be made to the curricular implementation of the 3D-DGBLL environment. The study also puts forward ideas for instructional best practices based on research findings and suggests future areas of development and investigation.","subject":"Mixed Methods Research, Educational Games, Video Games, Computer Games, German, Second Language Instruction, Grammar, Vocabulary, Simulation, Recycling, Sanitation, Experimental Groups, Maps, Teaching Methods, Educational Technology","source":"ReCALL","publicationdateyear":2015}]