[{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"},{"id":"EJ1077717","title":"Applying Role-Playing Strategy to Enhance Learners' Writing and Speaking Skills in EFL Courses Using Facebook and Skype as Learning Tools: A Case Study in Taiwan","author":"Yen, Yen-Chen, Hou, Huei-Tse, Chang, Kuo En","description":"English as a foreign language (EFL) instruction faces many challenges in Asia because of many cultural and environmental factors, such as the lack of interactive speaking environments, emphasis placed on test scores, and foreign language anxiety. The purpose of this research is to conduct an EFL instructional course by integrating Facebook (asynchronous online discussion) and Skype (synchronous online discussion) as platforms through which students perform role-playing based learning activities and to observe the effects of the course on the challenges mentioned above. The study consists of 42 participants who are enrolled in an English conversation course in a business college in Taiwan. This study conducted a learning performance analysis, correlation analysis, and qualitative content analysis of the learning process. The results indicate that the learners improved their speaking and writing skills through the learning tools and role-playing activities. The content analysis also demonstrated that learners could improve their speaking and writing skills via peer-to-peer and self-correction behaviors. We also provide several recommendations for EFL educators and researchers.","subject":"Role Playing, English (Second Language), Second Language Learning, Content Analysis, Conversational Language Courses, Correlation, Business Schools, Foreign Countries, Asians, Second Language Instruction, Cultural Influences, Environmental Influences, Computer Mediated Communication, Synchronous Communication, Qualitative Research, Learning Processes, Writing Skills, Oral Language, Peer Relationship, Error Correction, Case Studies, College Students, Social Media, Language Tests, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077787","title":"Design Considerations of Help Options in Computer-Based L2 Listening Materials Informed by Participatory Design","author":"Cárdenas-Claros, Mónica Stella","description":"This paper reports on the findings of two qualitative exploratory studies that sought to investigate design features of help options in computer-based L2 listening materials. Informed by principles of participatory design, language learners, software designers, language teachers, and a computer programmer worked collaboratively in a series of design sessions. The participants first evaluated researcher-generated prototypes, designed prototypes for two language proficiencies (beginner and upper intermediate) and iterated designs on both paper and screen. Analysis of the reworked prototypes resulted in five features of help option design: type, location, sequence, click-through, and display. Analyses of the interaction data showed that consensually the participants favored help options that are easy to use, promote learner control, support guidance, and stimulate learning.","subject":"Second Language Learning, Qualitative Research, Listening Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Materials, Language Teachers, Programming, Language Proficiency, Material Development, Usability, Interaction, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1080781","title":"Type of Instructional Delivery and Second Language Teacher Candidate Performance: Online versus Face-to-Face","author":"Kissau, Scott","description":"Research conducted over the past decade has consistently reported no significant differences in learning outcomes for students of fully online or face-to-face (F2F) instruction. Only a small number of these studies, however, have focused on courses in second language (L2) teacher preparation programs. Even fewer studies have compared the impact of online and F2F instruction on classroom practice. To fill this void in the research, an investigation was conducted of the impact of method of instructional delivery on the performance of teacher candidates in a Teaching English as a Second Language (TESL) program during their culminating student teaching internship. Focusing on a group of TESL interns who completed either online or F2F methodology training, a mixed methodology was used to compare student teacher outcomes on two key performance assessments and to compare university supervisor perceptions of student teacher performance. While the type of instructional setting was not found to significantly impact the teaching performance of the interns, interview data suggested that support from a cooperating teacher and prior experience working with students of diverse language and cultural backgrounds strongly influenced the teacher candidates' instructional practices.","subject":"English (Second Language), Second Language Learning, Second Language Instruction, Cooperating Teachers, Student Teachers, Mixed Methods Research, Internship Programs, Comparative Analysis, Supervisors, Online Courses, Prior Learning, Teacher Attitudes, Conventional Instruction, Cultural Differences, Cultural Background, Teaching Methods, College Faculty, Language Teachers, Meta Analysis, Teacher Education, Graduate Students, Semi Structured Interviews, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1063476","title":"Investigating an Innovative Computer Application to Improve L2 Word Recognition from Speech","author":"Matthews, Joshua, O'Toole, John Mitchell","description":"The ability to recognise words from the aural modality is a critical aspect of successful second language (L2) listening comprehension. However, little research has been reported on computer-mediated development of L2 word recognition from speech in L2 learning contexts. This report describes the development of an innovative computer application to improve L2 word recognition from speech, and goes on to describe an exploratory study of its use by 33 English as a second language (ESL) students. The study detected significant differences between word recognition scores measured before and after participants used the application. The manner with which students engaged with the computer application in terms of word recognition, self-determined exposure to speech input (repetitions) and modified output productivity (revisions) are also described and analysed. Differences in engagement by learners with different word recognition capabilities are noted. The paper concludes with a discussion of some recommendations for the use of computer-assisted development of L2 word recognition from speech and also provides concrete suggestions for much needed further empirical research in this area.","subject":"Second Language Learning, Second Language Instruction, Word Recognition, Linguistic Input, Computer Assisted Instruction, Teaching Methods, Speech, Listening Comprehension, English (Second Language), Learner Engagement, Psycholinguistics, Asians, College Students, Foreign Countries, Word Lists, Pretests Posttests, Language Tests, Student Attitudes, Attitude Measures, Scores, Accuracy, Verbal Communication","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1063503","title":"Task Design and Its Induced Learning Effects in a Cross-Institutional Blog-Mediated Telecollaboration","author":"Chen, Wen-Chun, Shih, Yu-Chih Doris, Liu, Gi-Zen","description":"This research investigated if and how the instructional design affected the learning outcome in a blog-mediated project, namely students' communicative writing in the social media. Thirty-four college-level English learners from two universities in Taiwan participated in the telecollaboration. The current research continues to highlight the social networking nature of Web 2.0 by locating idea units (IUs) in students' semi-formal weekly discussions, instead of focusing on syntactic complexity of conventional written modality. In this study, the language learners' output performance (the quantity of IUs was operationalized as the dependent variable) was hypothesized to be affected by task type and duration time. The findings indicate that both were significant in eliciting the amount of IUs. As a result, the contributions of this study include (a) shedding some light on the academic and educational capacity of blog-mediated telecollaboration, (b) revealing multiple factors that might affect the telecollaborative mechanism with the use of weblogs for language learning purposes, and finally (c) evaluating interactive blogging activities' educational value for complementing formal-writing training.","subject":"Second Language Learning, English (Second Language), Social Networks, Electronic Publishing, Foreign Countries, Instructional Design, Outcomes of Education, Writing (Composition), College Students, Task Analysis, Second Language Instruction, Writing Instruction, Web 2.0 Technologies, Videoconferencing, Majors (Students), Qualitative Research, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1080783","title":"Symmetrical and Asymmetrical Scaffolding of L2 Collocations in the Context of Concordancing","author":"Rezaee, Abbas Ali, Marefat, Hamideh, Saeedakhtar, Afsaneh","description":"Collocational competence is recognized to be integral to native-like L2 performance, and concordancing can be of assistance in gaining this competence. This study reports on an investigation into the effect of symmetrical and asymmetrical scaffolding on the collocational competence of Iranian intermediate learners of English in the context of concordancing. It also surveys the learners' attitudes towards the role of concordancing and scaffolding in learning L2 collocations. Immediate and delayed posttests were administered to examine the effects of the treatments given over 10 sessions on L2 collocations in the receptive and productive tasks. Results demonstrated that the three groups of participants who received the treatment tasks in the context of concordancing under symmetrical, asymmetrical, and no-scaffolding conditions, improved their knowledge of collocations significantly both in the receptive and productive tasks compared to the control group which had no access to concordancing and did not receive scaffolding. However, there was no significant difference among the performances of the concordancing groups either in the receptive or in the productive tasks. Moreover, learners expressed positive attitudes towards both concordancing and scaffolding.","subject":"Computational Linguistics, Phrase Structure, Scaffolding (Teaching Technique), Foreign Countries, Control Groups, English (Second Language), Second Language Learning, Task Analysis, Student Attitudes, Receptive Language, Pretests Posttests, Role, Expressive Language, Positive Attitudes, Second Language Instruction, Teaching Methods, Qualitative Research, Questionnaires, Likert Scales, College Students, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Iran"},{"id":"EJ1077721","title":"A Virtual Walk through London: Culture Learning through a Cultural Immersion Experience","author":"Shih, Ya-Chun","description":"Integrating Google Street View into a three-dimensional virtual environment in which users control personal avatars provides these said users with access to an innovative, interactive, and real-world context for communication and culture learning. We have selected London, a city famous for its rich historical, architectural, and artistic heritage, as the location of choice for culture learning. Using avatars, learners walk the virtual streets of London under the guidance of a native English-speaking instructor, and interact with each other using text and voice chat functions. The study examines the effects of this virtual environment on culture learning. Specifically, a qualitative case study combined with a time-series design is used to investigate the virtual context's impact on culture learning in terms of learner knowledge and attitudes, and to track associated change processes across the three research phases (baseline, treatment, and maintenance). The results show that all four English learners involved in the study benefitted from their cultural immersion, to varying extents, in the virtual environment. Four contributing learner factors, namely linguistic proficiency, motivation, character traits, and attitudes were found to correspond to the learners' levels of acquaintance with the target culture.","subject":"Geographic Information Systems, Case Studies, Qualitative Research, Language Proficiency, Computer Simulation, English (Second Language), Second Language Learning, Learning Motivation, Personality Traits, Student Attitudes, Second Language Instruction, Foreign Countries, Native Speakers, Computer Mediated Communication, Cultural Education, Teaching Methods, Graduate Students, Multiple Choice Tests, Identification, Pictorial Stimuli, Student Evaluation, Statistical Analysis, Test Validity, Observation","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom (London)"},{"id":"EJ1047675","title":"Developing a Corpus-Based Paraphrase Tool to Improve EFL Learners' Writing Skills","author":"Chen, M.-H., Huang, S.-T., Chang, J. S., Liou, H.-C.","description":"Paraphrasing, or restating information using different words, is critical to successful writing. However, EFL learners have difficulty in making paraphrases to meet their writing demands, and there has been little research on developing automatic reference tools to assist these learners' paraphrasing skills for better writing quality. In this study, we developed PREFER, an online corpus-based paraphrasing assistance system. Allowing multi-word input and returning promptly with a list of paraphrases in English and Chinese, along with usage patterns and example sentences, &quot;PREFER&quot; provides substantial support for EFL learners to vary their expressions during writing. An assessment study of the effectiveness of &quot;PREFER&quot; was conducted with 55 Chinese-speaking EFL college freshmen in an Asian country. The results indicated that &quot;PREFER&quot; offered the most benefits to students' writing performance (with an after-use improvement of 38.2%), compared with an online dictionary and an online thesaurus (-31.6% and -6.2%, respectively). Further investigation revealed that the less proficient, more motivated, and more conservative students showed more significant progress in the paraphrasing task with the help of &quot;PREFER.&quot; In the meantime, nearly 90% of the students expressed satisfaction with the paraphrases generated by &quot;PREFER,&quot; and its functions, and another 75% of them acknowledged that &quot;PREFER&quot; benefits their writing task.","subject":"English (Second Language), Second Language Learning, Computational Linguistics, Dictionaries, Internet, Writing (Composition), Language Usage, Chinese, Writing Improvement, Asians, College Freshmen, Student Attitudes, Writing Instruction, Second Language Instruction, Scoring Rubrics, Writing Evaluation, Pretests Posttests, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1047667","title":"Flipping the Classroom for English Language Learners to Foster Active Learning","author":"Hung, Hsiu-Ting","description":"This paper describes a structured attempt to integrate flip teaching into language classrooms using a WebQuest active learning strategy. The purpose of this study is to examine the possible impacts of flipping the classroom on English language learners' academic performance, learning attitudes, and participation levels. Adopting a quasi-experimental design, three different formats for flip teaching were developed in this study. The results indicate that the structured and semi-structured flip lessons were more effective instructional designs than the non-flip lessons. With a varying extent, both the structured and semi-structured flip lessons helped the students attain better learning outcomes, develop better attitudes toward their learning experiences, and devote more effort in the learning process. Given the positive results, this paper concludes with a call for more research into this promising pedagogy to contribute to its knowledge base across disciplines.","subject":"Active Learning, Second Language Learning, Learning Experience, Teaching Methods, Learning Processes, Computer Assisted Instruction, Academic Achievement, Student Attitudes, Quasiexperimental Design, English (Second Language), Second Language Instruction, Foreign Countries, Communicative Competence (Languages), Instructional Effectiveness, Questionnaires, Semi Structured Interviews, Statistical Analysis, Student Participation, College Students, Blended Learning","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059236","title":"Factors Affecting the Normalization of CALL in Chinese Senior High Schools","author":"He, Bi, Puakpong, Nattaya, Lian, Andrew","description":"With the development of Information Technology, increasing attention has been paid to Computer Assisted Language Learning (CALL). Meanwhile, increasing enthusiasm is seen for English learning and teaching in China. Yet, few research studies have focused on the normalization of CALL in ethnically diverse areas. In response to this research gap, this study aims to identify major factors affecting the normalization of CALL in Chinese senior high schools in the Qian Xi'nan Buyi and Miao Autonomous Prefecture (QBMP). A questionnaire was administered to 340 English teachers and a semi-structured oral interview was conducted as a follow-up. The study produced the following four findings: (a) most teachers were in favor of using computers in English teaching although they had to be cautious in guiding students; (b) institutional support was seen as instrumental; (c) teachers' computer competency and relevant training were considered to be important; and (d) teaching methodology and learner factors were identified as crucial.","subject":"Foreign Countries, Computer Assisted Instruction, Second Language Instruction, English (Second Language), High Schools, English Teachers, Secondary School Teachers, Questionnaires, Semi Structured Interviews, Teacher Attitudes, Computer Attitudes, Computer Literacy, Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1047664","title":"EFL Writing Revision with Blind Expert and Peer Review Using a CMC Open Forum","author":"Wu, Wen-Chi Vivian, Petit, Emily, Chen, Ching-Huei","description":"This exploratory computer assisted-language learning (CALL) study used a computer-mediated communication (CMC) interface to allow English as a foreign language (EFL) writing students in classes at two universities to give each other anonymous peer feedback about essay-writing assignments reacting to selected news stories. Experts also provided feedback review. Follow-up questions were facilitated by the interface. The students felt that they benefitted from the instructional design, but found that the peer review focused most on things like grammar whereas the experts focused on organization and structure, making the expert feedback more valuable. Researchers found that more complex issues discussed in the source news articles resulted in lower outcome scores, based on a rubric, than did source material simpler issues. The study also compared performance of students with higher and lower ability and evaluated the quality of the review comments. Conclusions and recommendations for practice are provided. This study is significant because it used CALL\/CMC technology to provide online interactivity between students and reviewers in an open forum that allowed students to seek follow-up clarification to the comments of reviewers. The review process, therefore, was not a one-way anonymous communication from reviewer to student but rather allowed interactive discussion of the points and suggestions made by the reviewers.","subject":"Computer Mediated Communication, Grammar, Scores, English (Second Language), Second Language Learning, Feedback (Response), Essays, Writing Assignments, Second Language Instruction, Instructional Design, Scoring Rubrics, College Students, Statistical Analysis, Qualitative Research, Focus Groups, Interviews, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059266","title":"I Help, Therefore, I Learn: Service Learning on Web 2.0 in an EFL Speaking Class","author":"Sun, Yu-Chih, Yang, Fang-Ying","description":"The present study integrates service learning into English as a Foreign Language (EFL) speaking class using Web 2.0 tools--YouTube and Facebook--as platforms. Fourteen undergraduate students participated in the study. The purpose of the service-learning project was to link service learning with oral communication training in an EFL speaking class by having each student create two YouTube videos in which they made informative presentations about the university (e.g., transportation system) and the city (e.g., sightseeing spots) in English to international students on campus. A Facebook community was established as a forum for students to share their videos with the international students and peers. The results suggest that the project enhanced EFL students' public speaking-related skills (e.g., idea and content development, and pronunciation), built their confidence in speaking English, and allowed them to develop their own learning process and strategies. Moreover, Web 2.0 tools endow service learning with new possibilities of reaching a greater number of the target audience and provide the members of the community with alternative means of communication.","subject":"Service Learning, Web 2.0 Technologies, English (Second Language), Second Language Learning, Oral Language, Learning Processes, Learning Strategies, Video Technology, Pronunciation, Foreign Students, Peer Relationship, Teaching Methods, Self Efficacy, Computer Assisted Instruction, Case Studies, Undergraduate Students, Foreign Countries, Surveys, Likert Scales, Student Attitudes, Reflection, Essays, Interviews, Outcomes of Education, Learning Theories, Qualitative Research, Dialogs (Language), Privacy, Computer Mediated Communication, Learning Experience","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063481","title":"Dictionaries vs Concordancers: Actual Practice of the Two Different Tools in EFL Writing","author":"Lai, Shu-Li, Chen, Hao-Jan Howard","description":"A number of studies have suggested the possible benefits of using concordancers in English as a Foreign Language (EFL) writing. To date, however, there is still limited understanding of how EFL writers may make use of such tools along with dictionaries when engaging in a writing task. To better understand the question, this study investigated a class of non-English-major college students (N = 14) over a semester. Four online corpus tools, including monolingual and bilingual concordancers and collocation retrieval systems, were provided, along with two online dictionaries. After two tool-training sessions, students performed three timed-writing tasks online during three consecutive months and received individual stimulus recall interviews after each writing task. The recall interviews served as the main source of data; other data included the video clips of the writing process, student writing samples, and the researchers' notes. The result showed that students used corpus tools and the bilingual dictionary for different purposes. They tended to use a bilingual dictionary when information on word form and word meaning was needed. When searching for information related to word usage, collocation information, and grammar patterns, they chose corpus tools more often than a bilingual dictionary. However, they also turned to corpus tools for meaning and form when the bilingual dictionary failed to provide clear word meanings, when they needed to search for word strings, and when they needed to just confirm an intuition regarding either word form or word meaning. This study provides empirical data that help to better understand how corpus tools contribute to EFL writing.","subject":"Dictionaries, Indexes, English (Second Language), Second Language Learning, Second Language Instruction, Computational Linguistics, Nonmajors, Writing (Composition), Phrase Structure, Recall (Psychology), Bilingualism, Monolingualism, Video Technology, Grammar, Definitions, Intuition, Writing Processes, College Students, Writing Instruction, Teaching Methods, Qualitative Research, Statistical Analysis, Semi Structured Interviews, Observation, Foreign Countries, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1080778","title":"Facilitating Metacognitive Processes of Academic Genre-Based Writing Using an Online Writing System","author":"Yeh, Hui-Chin","description":"Few studies have investigated how metacognitive processes foster the application of genre knowledge to students' academic writing. This is largely due to its internal and unobservable characteristics. To bridge this gap, an online writing system based on metacognition, involving the stages of planning, monitoring, evaluating, and revising, was developed to investigate how such a system contributed to the understanding and application of genre knowledge to students' academic writing. The data included three different versions of each student's written research proposal, action logs, discussion transcripts in discussion forums, and an open-ended questionnaire. Descriptive statistics, a typical case sampling, and the constant comparison method were used to analyze the data. The results suggested that the students made greater improvements in academic writing performance after experiencing metacognitive processes. Particularly, collaborative efforts throughout the metacognitive processes were important in supporting students to understand the academic genre, recognize the problems of unstructured academic papers, and apply genre knowledge to academic writing. The online writing system features, designed to nurture students' metacognitive processes, served as useful cognitive stimuli to raise students' metacognitive awareness. The system's functions overcame the limitations of observing students' metacognitive processes described in previous studies, and enabled teachers to provide follow-up instruction. Implications and recommendations are also addressed.","subject":"Metacognition, Statistical Analysis, Academic Discourse, Sampling, Questionnaires, Writing Instruction, Computer Assisted Instruction, Writing Processes, Writing Improvement, Teaching Methods, Cooperative Learning, Graduate Students, Foreign Countries, Computer Software, Second Language Learning, Second Language Instruction, English for Academic Purposes","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"}]