[{"id":"EJ1074878","title":"Using Key Part-of-Speech Analysis to Examine Spoken Discourse by Taiwanese EFL Learners","author":"Lin, Yen-Liang","description":"This study reports on a corpus analysis of samples of spoken discourse between a group of British and Taiwanese adolescents, with the aim of exploring the statistically significant differences in the use of grammatical categories between the two groups of participants. The key word method extended to a part-of-speech level using the web-based corpus analytical tool, &quot;Wmatrix,&quot; highlights those linguistic domains which deserve particular attention. Specifically, it reveals the lexical and grammatical categories that occur unusually frequently or unusually infrequently in the English learners' discourse when compared with the language used by the native speakers of English in the sample. The research findings delineate the pedagogical merit of key domain analysis and thus help to inform English as a foreign language teachers and materials developers in the design of courses emphasising spoken interaction.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Discourse Analysis, Computational Linguistics, Grammar, Second Language Instruction, Teaching Methods, Material Development, Language Teachers, English, Native Speakers, Cross Cultural Studies","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom"},{"id":"EJ1059671","title":"Language Learner Perspectives on the Functionality and Use of Electronic Language Dictionaries","author":"Levy, Mike, Steel, Caroline","description":"This paper investigates the extent of electronic dictionary use by language learners in an Australian university. All students in the study are formally enrolled in language courses across ten languages at first, second or third year level. The study places a particular emphasis on gauging student perceptions of the beneficial aspects of electronic dictionaries as judged by learners themselves in circumstances where they are able to act independently. As these benefits are often described in terms of &quot;usability&quot; and &quot;functionality,&quot; these particular terms are defined and introduced in the literature review, and then later they are employed to help structure and describe the results. The arguments for the discussion are supported by the use of empirical data taken from a large-scale survey conducted in 2011 (n = 587) where comments from students were obtained on why and how dictionary-type resources were accessed and used (see also Steel &amp; Levy, 2013). The paper restricts itself to the quantitative and qualitative data gathered on mobile phones, translators, dictionaries and web conjugators and related items (e.g. discussion forums). The particular functions that students use and the ways in which they use them are described and categorised, with the discussion supported by student comments. The data exhibits a remarkable range of resources available to students to look up unknown words or to see translations and, consequently, our understanding of what exactly an electronic dictionary might comprise is challenged. Many students' comments demonstrate a sophistication and knowledge about the effective use of these dictionary tools together with a keen awareness of their limitations.","subject":"Second Language Learning, Second Language Instruction, Foreign Countries, Dictionaries, Electronic Publishing, Surveys, Student Attitudes, Language Enrollment, Usability, College Students, Statistical Analysis, Qualitative Research, Telecommunications, Classification","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1059672","title":"English Learning Websites and Digital Resources from the Perspective of Chinese University EFL Practitioners","author":"Shen, Huizhong, Yuan, Yifeng, Ewing, Robyn","description":"English language learning (ELL) websites and digital resources have been recognized as an important source of linguistic and cultural knowledge for English as a foreign language (EFL) learners to explore. The up-to-date information carried by authentic materials is invaluable for learners to develop an understanding of the target language\/culture. However, there appears to be a gap between what the designer intends and what the user wants. This paper investigates Chinese university EFL teachers' perceptions of online English language websites and resources. The study focuses on a number of components of major language areas and skills in ELL websites, website materials, language users' preferences, and website usability. A total of 1519 English academics from 139 universities across China completed the online survey, and 164 of them voluntarily participated in focus group interviews anonymously. The empirical evidence of this study has highlighted that a pedagogically-oriented ELL website, targeting audiences with a variety of language proficiencies, was much liked by the Chinese EFL teachers. A preference was observed to see more current authentic language, examination-oriented English learning materials and tasks, and Eastern\/non-Anglophone topics in the websites. In addition, it is found that website usability is another key factor that would impact ELL website popularity. A well-designed ELL website can effectively assist Chinese EFL learners to enhance their language competence and achieve optimal learning outcomes. This study provides a context-specific empirical base for innovative web-based EFL learning and teaching as well as website design and materials development in China. The proposed key features of a preferred ELL website may help better inform website designers, content writers and evaluators in their ELL website design\/evaluation.","subject":"Asians, Second Language Learning, English (Second Language), Web Sites, College Faculty, Teacher Attitudes, Usability, Online Surveys, Focus Groups, Interviews, Cultural Awareness, Educational Resources, Universities, Foreign Countries, Language Proficiency, Outcomes of Education, Second Language Instruction, Innovation, Material Development, Evaluators","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1059679","title":"Website Analysis in an EFL Context: Content Comprehension, Perceptions on Web Usability and Awareness of Reading Strategies","author":"Roy, Debopriyo, Crabbe, Stephen","description":"Website analysis is an interdisciplinary field of inquiry that focuses on both digital literacy and language competence (Brugger, 2009). Website analysis in an EFL learning context has the potential to facilitate logical thinking and in the process develop functional language proficiency. This study reported on an English language website (http:\/\/www.travelbelize.org\/) analysis experiment carried out for three weeks as an in-class and homework activity in a third year (junior) level English as a Foreign Language (EFL) course at a Japanese technical university. The purpose was to explore EFL learners' ability to analyze an English language website and produce concrete design responses in English. During the first week of the analysis (involving sixteen students selected due to performing the best during earlier in-class website analysis activities on the course), participants produced their own responses to eight open-ended design questions about the website. The second week of the analysis (involving all 59 students on the course) tested the students' ability to search for information from the website, and recorded their impressions about the website design based on standard usability questionnaires (&quot;CSUQ,&quot; &quot;QUIS,&quot; and &quot;MPRC&quot;). The third week of the analysis had the 59 students self-report on their use of meta-cognitive reading strategies (&quot;MARSI 1.0 Questionnaire&quot;) during the website analysis. The results of the questionnaires showed that, overall, the EFL students had a basic understanding of major design questions related to information organization, screen interface design, audience, technology used, etc. However, there was statistically significant variability between responses in different groups (comprehensive evaluation, webpage design, terminology and website information and website capabilities) and the respondents were not unanimous in their impressions about the website. The result of the student self-reports on metacognitive reading strategies showed wide acceptability and use of problem-solving strategies.","subject":"Web Sites, Second Language Learning, English (Second Language), Reading Strategies, Logical Thinking, Language Proficiency, Student Attitudes, Questionnaires, Usability, Metacognition, Problem Solving, Technological Literacy, Audiences, Computer Assisted Instruction, Foreign Countries","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Japan"},{"id":"EJ1059663","title":"The Impact of Mode of Instructional Delivery on Second Language Teacher Self-Efficacy","author":"Kissau, Scott, Algozzine, Bob","description":"Research has called into question the suitability of fully-online instruction for certain teacher preparation courses. Methodology coursework, in particular, has been singled out in research as ill-suited to online instruction. Recent research, for example, involving second language (L2) teacher candidates has demonstrated that aspiring teachers who completed online methodology instruction were less confident in their abilities to teach L2 learners than their counterparts who completed the same instruction in a face-to-face (F2F) setting. To address the limitations of online instruction, while still incorporating its associated strengths, the development and implementation of hybridized methodology coursework have been proposed. Following this recommendation, the researchers developed and implemented hybridized L2 methodology courses that mirrored their pre-existing online and F2F equivalents. Using a mixed methodology, the researchers then conducted a three-way comparison of instructional delivery modes (online, F2F, hybrid) to investigate their impact on L2 teacher candidate self-efficacy. Although the results demonstrated that all three modes of instruction can be equally effective at increasing candidate confidence, they also highlighted the potential of hybridized instruction to address the limitations of online and F2F instruction, while still including their strengths. The findings also emphasized that simply viewing or participating in live demonstrations of teaching strategies in post-secondary methodology courses is not sufficient. To feel confident in their teaching abilities, teacher candidates need opportunities in their coursework to apply what they have learned in K-12 classrooms. Offering numerous research-based suggestions to improve the design of hybridized methodology courses, the study also serves to inform the development of future hybridized methodology coursework.","subject":"Self Efficacy, Teacher Effectiveness, Online Courses, Teaching Methods, Second Language Learning, Second Language Instruction, Teacher Education Programs, Mixed Methods Research, Methods Courses, Comparative Analysis, Preservice Teachers, Instructional Design, Language Teachers, Student Attitudes, Intermode Differences","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"North Carolina"},{"id":"EJ1074888","title":"Mobile Technology in Second Language Classrooms: Insights into Its Uses, Pedagogical Implications, and Teacher Beliefs","author":"Van Praag, Benjamin, Sanchez, Hugo Santiago","description":"Adopting a multiple-case, multiple-method design, this study investigates mobile technology use in the practices of three experienced second language teachers. The findings, based on an analysis of the teachers' rationales, stated beliefs and classroom actions, show that the teachers tend to prohibit or reluctantly tolerate mobile device usage, while they recognise some of its potential benefits to support their teaching and student learning. They also highlight the incentives and barriers which respectively facilitate and hinder the integration of mobile technology, including factors which are internal (e.g. beliefs) and external (e.g. contextual constraints) to the teachers. Implications for classroom practice and teacher education are drawn.","subject":"Teaching Methods, Educational Technology, Technology Uses in Education, Case Studies, Mixed Methods Research, Telecommunications, Handheld Devices, Teacher Attitudes, Barriers, Incentives, Technology Integration, Second Language Instruction","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048414","title":"Twenty Years of MALL Project Implementation: A Meta-Analysis of Learning Outcomes","author":"Burston, Jack","description":"Despite the hundreds of Mobile-Assisted Language Learning (MALL) publications over the past twenty years, statistically reliable measures of learning outcomes are few and far between. In part, this is due to the fact that well over half of all MALL-related studies report no objectively quantifiable learning outcomes, either because they did not involve MALL implementation projects, or if they did, learning gains were only based on subjective teacher assessments and\/or student self-evaluations. Even more so, the paucity of statistically reliable learning outcome data stems from the short duration of projects and small numbers of students involved. Of the 291 distinct studies examined in this review only 35 meet minimal conditions of duration and sample size, i.e., ten experimental subjects over a period of at least a month. Sixteen of these suffer from serious design shortcomings, leaving only nineteen MALL studies that can reliably serve as a basis for determining the learning outcomes of mobile-based language applications. Of these studies, fifteen can be considered to report unequivocal positive results, with those focusing on reading, listening and speaking without exception evidencing a MALL application advantage. Four studies, all focusing on vocabulary, reported no significant differences.","subject":"Educational Technology, Technology Uses in Education, Second Language Instruction, Second Language Learning, Research Methodology, Instructional Effectiveness, Meta Analysis, Telecommunications, Grammar, Vocabulary Development, Reading Skills, Listening Skills, Speech Skills","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048374","title":"Learning Motivation and Adaptive Video Caption Filtering for EFL Learners Using Handheld Devices","author":"Hsu, Ching-Kun","description":"The aim of this study was to provide adaptive assistance to improve the listening comprehension of eleventh grade students. This study developed a video-based language learning system for handheld devices, using three levels of caption filtering adapted to student needs. Elementary level captioning excluded 220 English sight words (see Section 1 for definition), but provided captions and Chinese translations for the remaining words. Intermediate level excluded 1000 high frequency English words, but provided captions for the remaining words, and 2200 high frequency English words were excluded at the high intermediate caption filtering level. The result was that the viewers were provided with captions for words that were likely to be unfamiliar to them. Participants in the experimental group were assigned bilingual caption modes according to their pre-test results, while those in the control group were assigned standard caption modes. Our results indicate that students in the experimental group preferred adaptive captions, enjoyed the exercises more, and gained greater intrinsic motivation compared to those in the control group. The results confirm that different students require different quantities of information to balance listening comprehension and indicate that the proposed adaptive caption filtering approach may be an effective way to improve the skills required for listening proficiency.","subject":"Learning Motivation, English (Second Language), Second Language Learning, Second Language Instruction, Video Technology, Experimental Groups, Bilingualism, Control Groups, Pretests Posttests, Handheld Devices, Listening Comprehension, High School Students, Teaching Methods, Word Frequency, Chinese, Translation","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074893","title":"Computer-Mediated Input, Output and Feedback in the Development of L2 Word Recognition from Speech","author":"Matthews, Joshua, Cheng, Junyu, O'Toole, John Mitchell","description":"This paper reports on the impact of computer-mediated input, output and feedback on the development of second language (L2) word recognition from speech (WRS). A quasi-experimental pre-test\/treatment\/post-test research design was used involving three intact tertiary level English as a Second Language (ESL) classes. Classes were either assigned to a control group (n = 31) or to one of two alternative treatment levels which used a web-based computer application enabling self-determined opportunities to repeatedly listen to and reconstruct spoken target text into its written form. Treatment group one (n = 30) received text feedback after each of their efforts at target text reconstruction, whereas treatment group two (n = 35) did not. Results indicated that word recognition gain scores of those who used the application, regardless of treatment level, were significantly higher than those of the control group. The relationship between the quantity of self-determined exposure to input and word recognition improvements was moderate but not linear, with those choosing moderate levels of speech input deriving the greatest measurable improvement. Neither increased levels of modified output nor the provision of text feedback were associated with significant improvements in word recognition gain scores. Implications for computer-mediated approaches for the development of L2 WRS are described and areas for future empirical research are suggested.","subject":"Second Language Learning, English (Second Language), Quasiexperimental Design, Control Groups, Pretests Posttests, Linguistic Input, Feedback (Response), Scores, Correlation, Computer Assisted Instruction, Higher Education, Speech","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048372","title":"The Story in the Mind: The Effect of 3D Gameplay on the Structuring of Written L2 Narratives","author":"Neville, David O.","description":"The article reports on a mixed-methods study evaluating the use of a three-dimensional digital game-based language learning (3D-DGBLL) environment to teach German two-way prepositions and specialized vocabulary within a simulated real-world context of German recycling and waste management systems. The study assumed that goal-directed player activity in this environment would configure digital narratives, which in turn would help study participants in the experimental group to co-configure story maps for ordering and making sense of the problem spaces encountered in the environment. The study further assumed that these participants would subsequently rely on the story maps to help them structure written L2 narratives describing an imagined personal experience closely resembling the gameplay of the 3D-DGBLL environment. The study found that immersion in the 3D-DGBLL environment influenced the manner in which the second language was invoked in these written narratives: Participants in the experimental group produced narratives containing more textual indicators describing the activity associated with the recycling and waste management systems and the spaces in which these systems are located. Increased usage of these indicators suggest that participants in the experimental group did indeed rely on story maps generated during 3D gameplay to structure their narratives, although stylistic and grammatical features of the narratives suggest, however, that changes could be made to the curricular implementation of the 3D-DGBLL environment. The study also puts forward ideas for instructional best practices based on research findings and suggests future areas of development and investigation.","subject":"Mixed Methods Research, Educational Games, Video Games, Computer Games, German, Second Language Instruction, Grammar, Vocabulary, Simulation, Recycling, Sanitation, Experimental Groups, Maps, Teaching Methods, Educational Technology","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074883","title":"Attitudes towards Online Feedback on Writing: Why Students Mistrust the Learning Potential of Models","author":"Strobl, Carola","description":"This exploratory study sheds new light on students' perceptions of online feedback types for a complex writing task, summary writing from spoken input in a foreign language (L2), and investigates how these correlate with their actual learning to write. Students tend to favour clear-cut, instructivist rather than constructivist feedback, and guided self-evaluation through model solutions in online learning environments. However, the former type is too limited to tackle all dimensions of advanced writing. Constructivist feedback, in the form of guided modelling, allows addressing the higher-order concerns involved in summary writing. In addition, it is widely acknowledged that activating the zone of proximal development (ZPD) through cognitive involvement is beneficial to learning. To investigate students' learning from both types of feedback, a one-group pre-post-test intervention study was set up. Students attending a course on summary writing in L2 within a bachelor programme in Applied Languages (n = 38) followed an individual online learning module containing both instructivist fill-the-gap exercises and model solutions with constructivist guiding questions for self-assessment. The students' actual learning gain was measured through pre- and post-tests, and compared with their perceived learning gain, as expressed in self-evaluation. The comparison reveals a dichotomy between the students' observed learning curve and an underestimation of their own progress. This dichotomy was found to originate in a mismatch between their expectations towards the online learning module and the characteristics of the constructivist feedback conveyed. This mismatch can be attributed to three key factors: (1) evaluation, (2) linguistic focus, and (3) learner motivation.","subject":"Feedback (Response), Writing (Composition), Constructivism (Learning), Computer Mediated Communication, Student Attitudes, Writing Attitudes, Second Language Learning, Correlation, Writing Instruction, Trust (Psychology), Models, Undergraduate Students, Bachelors Degrees, Applied Linguistics, Problem Solving, Ability, Cognitive Development, Educational Benefits, Pretests Posttests, Intervention, Electronic Learning, Learning Modules, Writing Exercises, Self Evaluation (Individuals), Comparative Analysis, Learning Motivation, Blended Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]