[{"id":"EJ1137096","title":"Learning Styles, Online Content Usage and Exam Performance in a Mixed-Format Introductory Computer Information Systems Course","author":"Lang, Guido, O'Connell, Stephen D.","description":"We investigate the relationship between learning styles, online content usage and exam performance in an undergraduate introductory Computer Information Systems class comprised of both online video tutorials and in-person classes. Our findings suggest that, across students, (1) traditional learning style classification methodologies do not predict behavioral measures of online learning, and (2) working on the online content specifically during allotted class time is positively related to exam performance. Controlling for differences across students, we find (3) accessing content on non-class days (consistency) is positively related to exam performance, while (4) working substantially ahead of the scheduled content pace is negatively related to exam performance.","subject":"Introductory Courses, Correlation, Cognitive Style, Undergraduate Students, Information Systems, Computer Science Education, Video Technology, Prediction, Tests, Classification, Online Courses, Course Content, Scores, Teaching Methods, Blended Learning, Measures (Individuals), Private Colleges, Course Descriptions, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084380","title":"The Writer's Individualized Transfer Tool: A Freeware Innovation for Fostering and Researching Transfer of Writing Skills and Knowledge","author":"Khost, Peter H.","description":"Most higher education institutions lack a program that promotes students' transfer--that is, reapplication or repurposing--of writing skills and knowledge across the curriculum, a phenomenon that research shows does not tend to happen without deliberate sustained support. This article introduces an online instrument, the Writer's Individualized Transfer Tool, which the author invented to intervene in this area as a supplemental or provisional effort, using freeware to foster and research students' writing transfer from first-year composition to other courses and potentially beyond. The article reviews relevant scholarship on transfer in writing, describes and illustrates Writer's Individualized Transfer Tool's design, provides instructions for the tool's implementation and usage, reviews some results from a pilot study of an application of the tool in an first-year composition curriculum, and discusses related issues requiring further consideration.","subject":"Freshman Composition, Writing Skills, Computer Software, Writing Across the Curriculum, Transfer of Training, Metacognition, Program Implementation, Pilot Projects, Outcomes of Education, Writing Instruction, Student Surveys","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1098514","title":"How Does ERPsim Influence Students' Perceived Learning Outcomes in an Information Systems Course? An Empirical Study","author":"Chen, Liqiang, Keys, Anthony, Gaber, Donald","description":"It is a challenge for business students or even employees to understand business processes and enterprise software usage without involvement in real-world practices. Many business schools are using ERP software in their curriculum, aiming to expose students to real-world business practices. ERPsim is an Enterprise Resource Planning (ERP) teaching-learning tool for business students to learn actual SAP and business processes. This study empirically examines how ERPsim enhances student learning outcomes in an IS course. The findings reveal the antecedent effects of two important IS constructs (enjoyment and cognitive appraisal) on learning behavior and learning outcomes during students' involvement with ERPsim. The study provides empirical evidence that some major IS constructs (i.e., enjoyment and cognitive appraisal of using information systems) play important roles in shaping the effectiveness of using simulation game software to learn business processes and ERP software.","subject":"Business Administration Education, Strategic Planning, Computer Software, Information Systems, Outcomes of Education, Learning Processes, Computer Simulation, Hypothesis Testing, College Students, Student Surveys, Introductory Courses, Educational Experiments, Statistical Analysis, Path Analysis, Measurement, Reliability, Validity, Program Effectiveness","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121012","title":"Comparison the Psychological Wellbeing of University Students from Hungary and Romania","author":"Barth, Anita, Nagy, Ildikó, Kiss, János","description":"The results obtained in our research of mental distress indicators and results of conflict management strategies are consistent with the results of international studies. Students participating in the study (N = 237) reached the highest average results in the field of personal growth, while we measured the lowest value in the fields of autonomy and the dominance of the environment. Among the mental distress indicators the students gave the highest scores for the stress. The frequency examination showed the results of the participants to fall to 40.9% of moderate-severe and severe extreme range. While among the genders, women indicate much higher stress levels. In addition, the students preferred the avoiding conflict management strategy in preference to the other four strategies. While we compared the students from the two countries we found a significant difference between the survey field of autonomy and purpose in life. We also found a notable difference among the mental distress indicators. While the students of the University of Debrecen were moderate, the students of the universities of Oradea fell in the &quot;slight&quot; area (in the range of stress). For the usage of conflict management strategies we found no significant differences between the two countries' students. The students from both countries preferred the avoiding strategy. This study similar to many national and international studies indicates the high level of stress among the students. One of the most important task of a higher education institution should be the protection of the students' mental health which would lead to an improvement on well-being and that would cause the lowering of the stress level.","subject":"Comparative Analysis, Well Being, College Students, Foreign Countries, Psychological Characteristics, Student Surveys, Questionnaires, Mental Health, Mental Disorders, Depression (Psychology), Anxiety, Anxiety Disorders, Research Methodology, Higher Education, Conflict Resolution, Stress Variables, Stress Management, Likert Scales, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary, Romania"}]