[{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137149","title":"Including a Programming Course in General Education: Are We Doing Enough?","author":"Ferguson, Roger C., Leidig, Paul M., Reynolds, John H.","description":"General education is more than a list of required courses a student must take to complete their degree. For most universities, general education is the groundwork for the student's university experience. These courses span multiple disciplines and allow students to experience a wide range of topics on their path to graduation. Programming classes, e.g., Introduction to Programming, have not typically been an option as part of a general education course sequence at most universities. This study found that, only half of universities offer any kind of programming course in the General Education (GenEd) Program. The data also show that only two-thirds of institutions offer a computing class of any kind as a general education option. Institutions with ABET accredited Information Systems (IS) programs are significantly lower in both of these categories. This paper demonstrates the reasoning and process for including a programming class as an option in a GenEd Program, thereby showing how a programming class can be used to satisfy the requirements of a general education course. This results in two significant advantages to the computing department and university since the departments expand their reach to many more students, with a potential of increasing the number of majors or minors within the department; and non-computing majors have the opportunity to take courses that have not traditionally been offered in the GenEd Program. The latter results in students receiving a more comprehensive education and exposure to skills in high demand.","subject":"Programming, Programming Languages, General Education, Required Courses, College Students, Introductory Courses, Computer Science Education, Majors (Students), Nonmajors, Hypothesis Testing, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1137144","title":"First Database Course--Keeping It All Organized","author":"Baugh, Jeanne M.","description":"All Computer Information Systems programs require a database course for their majors. This paper describes an approach to such a course in which real world examples, both design projects and actual database application projects are incorporated throughout the semester. Students are expected to apply the traditional database concepts to actual database storage problems. The design of the database is emphasized and students evaluate each other's design as well as their final database project. The details of a database written by the Author to organize all information surrounding the student's project are also presented. In this database course, the students are able to follow the progress of their fellow students during the course. Student's evaluations of each other's work during the semester is shown to be beneficial in the learning process.","subject":"Undergraduate Students, Computer Science Education, Information Systems, Databases, Introductory Courses, Required Courses, Majors (Students), Information Storage, Database Design, Student Projects, Peer Evaluation, Outcomes of Education, Programming Languages, Programming, Student Attitudes, Student Surveys, Rating Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1109645","title":"Teaching Tip: Active Learning via a Sample Database: The Case of Microsoft's Adventure Works","author":"Mitri, Michel","description":"This paper describes the use and benefits of Microsoft's Adventure Works (AW) database to teach advanced database skills in a hands-on, realistic environment. Database management and querying skills are a key element of a robust information systems curriculum, and active learning is an important way to develop these skills. To facilitate active learning and produce a compelling narrative, the data structure and content of a useful pedagogically-oriented database should be realistic and lifelike. It should contain data that accurately depicts the business processes, functions, and entities of a realistic organization, structured in a way that demonstrates best practices in database design. Most database textbooks include sample databases, but these are often small and sparse of data. By contrast, Microsoft's AW database presents a robust, realistic, and comprehensive framework for many important educational objectives in an IS curriculum. This paper introduces the AW business case and database, and illustrates several pedagogical uses in an undergraduate CIS program.","subject":"Active Learning, Databases, Computer Software, Educational Benefits, Case Method (Teaching Technique), Case Studies, Skill Development, Information Systems, Curriculum Development, Educational Technology, Business Education, Best Practices, Database Design, Problem Based Learning, Problem Solving, Database Management Systems, Educational Objectives, Undergraduate Study, Computer Science Education, Programming Languages, Information Retrieval, Student Attitudes","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null}]