[{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"},{"id":"EJ1051460","title":"Corpus-Based versus Traditional Learning of Collocations","author":"Daskalovska, Nina","description":"One of the aspects of knowing a word is the knowledge of which words it is usually used with. Since knowledge of collocations is essential for appropriate and fluent use of language, learning collocations should have a central place in the study of vocabulary. There are different opinions about the best ways of learning collocations. This study investigates the effectiveness of corpus-based activities for learning verb-adverb collocations compared to traditional activities usually found in course books. The test results show that the participants who learned the collocations with the help of the online concordancer gained more knowledge and had better results in all parts of the test.","subject":"Computational Linguistics, Phrase Structure, Verbs, Form Classes (Languages), Teaching Methods, Indexes, Language Tests, Language Fluency, Instructional Effectiveness, Foreign Countries, Undergraduate Students, Second Language Instruction, Second Language Learning, Experimental Groups, Pretests Posttests, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Macedonia"},{"id":"EJ1047675","title":"Developing a Corpus-Based Paraphrase Tool to Improve EFL Learners' Writing Skills","author":"Chen, M.-H., Huang, S.-T., Chang, J. S., Liou, H.-C.","description":"Paraphrasing, or restating information using different words, is critical to successful writing. However, EFL learners have difficulty in making paraphrases to meet their writing demands, and there has been little research on developing automatic reference tools to assist these learners' paraphrasing skills for better writing quality. In this study, we developed PREFER, an online corpus-based paraphrasing assistance system. Allowing multi-word input and returning promptly with a list of paraphrases in English and Chinese, along with usage patterns and example sentences, &quot;PREFER&quot; provides substantial support for EFL learners to vary their expressions during writing. An assessment study of the effectiveness of &quot;PREFER&quot; was conducted with 55 Chinese-speaking EFL college freshmen in an Asian country. The results indicated that &quot;PREFER&quot; offered the most benefits to students' writing performance (with an after-use improvement of 38.2%), compared with an online dictionary and an online thesaurus (-31.6% and -6.2%, respectively). Further investigation revealed that the less proficient, more motivated, and more conservative students showed more significant progress in the paraphrasing task with the help of &quot;PREFER.&quot; In the meantime, nearly 90% of the students expressed satisfaction with the paraphrases generated by &quot;PREFER,&quot; and its functions, and another 75% of them acknowledged that &quot;PREFER&quot; benefits their writing task.","subject":"English (Second Language), Second Language Learning, Computational Linguistics, Dictionaries, Internet, Writing (Composition), Language Usage, Chinese, Writing Improvement, Asians, College Freshmen, Student Attitudes, Writing Instruction, Second Language Instruction, Scoring Rubrics, Writing Evaluation, Pretests Posttests, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1063476","title":"Investigating an Innovative Computer Application to Improve L2 Word Recognition from Speech","author":"Matthews, Joshua, O'Toole, John Mitchell","description":"The ability to recognise words from the aural modality is a critical aspect of successful second language (L2) listening comprehension. However, little research has been reported on computer-mediated development of L2 word recognition from speech in L2 learning contexts. This report describes the development of an innovative computer application to improve L2 word recognition from speech, and goes on to describe an exploratory study of its use by 33 English as a second language (ESL) students. The study detected significant differences between word recognition scores measured before and after participants used the application. The manner with which students engaged with the computer application in terms of word recognition, self-determined exposure to speech input (repetitions) and modified output productivity (revisions) are also described and analysed. Differences in engagement by learners with different word recognition capabilities are noted. The paper concludes with a discussion of some recommendations for the use of computer-assisted development of L2 word recognition from speech and also provides concrete suggestions for much needed further empirical research in this area.","subject":"Second Language Learning, Second Language Instruction, Word Recognition, Linguistic Input, Computer Assisted Instruction, Teaching Methods, Speech, Listening Comprehension, English (Second Language), Learner Engagement, Psycholinguistics, Asians, College Students, Foreign Countries, Word Lists, Pretests Posttests, Language Tests, Student Attitudes, Attitude Measures, Scores, Accuracy, Verbal Communication","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1080783","title":"Symmetrical and Asymmetrical Scaffolding of L2 Collocations in the Context of Concordancing","author":"Rezaee, Abbas Ali, Marefat, Hamideh, Saeedakhtar, Afsaneh","description":"Collocational competence is recognized to be integral to native-like L2 performance, and concordancing can be of assistance in gaining this competence. This study reports on an investigation into the effect of symmetrical and asymmetrical scaffolding on the collocational competence of Iranian intermediate learners of English in the context of concordancing. It also surveys the learners' attitudes towards the role of concordancing and scaffolding in learning L2 collocations. Immediate and delayed posttests were administered to examine the effects of the treatments given over 10 sessions on L2 collocations in the receptive and productive tasks. Results demonstrated that the three groups of participants who received the treatment tasks in the context of concordancing under symmetrical, asymmetrical, and no-scaffolding conditions, improved their knowledge of collocations significantly both in the receptive and productive tasks compared to the control group which had no access to concordancing and did not receive scaffolding. However, there was no significant difference among the performances of the concordancing groups either in the receptive or in the productive tasks. Moreover, learners expressed positive attitudes towards both concordancing and scaffolding.","subject":"Computational Linguistics, Phrase Structure, Scaffolding (Teaching Technique), Foreign Countries, Control Groups, English (Second Language), Second Language Learning, Task Analysis, Student Attitudes, Receptive Language, Pretests Posttests, Role, Expressive Language, Positive Attitudes, Second Language Instruction, Teaching Methods, Qualitative Research, Questionnaires, Likert Scales, College Students, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Iran"},{"id":"EJ1063481","title":"Dictionaries vs Concordancers: Actual Practice of the Two Different Tools in EFL Writing","author":"Lai, Shu-Li, Chen, Hao-Jan Howard","description":"A number of studies have suggested the possible benefits of using concordancers in English as a Foreign Language (EFL) writing. To date, however, there is still limited understanding of how EFL writers may make use of such tools along with dictionaries when engaging in a writing task. To better understand the question, this study investigated a class of non-English-major college students (N = 14) over a semester. Four online corpus tools, including monolingual and bilingual concordancers and collocation retrieval systems, were provided, along with two online dictionaries. After two tool-training sessions, students performed three timed-writing tasks online during three consecutive months and received individual stimulus recall interviews after each writing task. The recall interviews served as the main source of data; other data included the video clips of the writing process, student writing samples, and the researchers' notes. The result showed that students used corpus tools and the bilingual dictionary for different purposes. They tended to use a bilingual dictionary when information on word form and word meaning was needed. When searching for information related to word usage, collocation information, and grammar patterns, they chose corpus tools more often than a bilingual dictionary. However, they also turned to corpus tools for meaning and form when the bilingual dictionary failed to provide clear word meanings, when they needed to search for word strings, and when they needed to just confirm an intuition regarding either word form or word meaning. This study provides empirical data that help to better understand how corpus tools contribute to EFL writing.","subject":"Dictionaries, Indexes, English (Second Language), Second Language Learning, Second Language Instruction, Computational Linguistics, Nonmajors, Writing (Composition), Phrase Structure, Recall (Psychology), Bilingualism, Monolingualism, Video Technology, Grammar, Definitions, Intuition, Writing Processes, College Students, Writing Instruction, Teaching Methods, Qualitative Research, Statistical Analysis, Semi Structured Interviews, Observation, Foreign Countries, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]