[{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1109690","title":"Examining Learning Styles and Perceived Benefits of Analogical Problem Construction on SQL Knowledge Acquisition","author":"Mills, Robert J., Dupin-Bryant, Pamela A., Johnson, John D., Beaulieu, Tanya Y.","description":"The demand for Information Systems (IS) graduates with expertise in Structured Query Language (SQL) and database management is vast and projected to increase as &quot;big data&quot; becomes ubiquitous. To prepare students to solve complex problems in a data-driven world, educators must explore instructional strategies to help link prior knowledge to new knowledge. This study examined learning styles and the perceived benefits of analogical problem construction on SQL knowledge acquisition. The data collected from 80 participants suggests there is a perceived positive benefit to using analogical problem construction for learning introductory database concepts. The learning style of the majority of students in the sample is &quot;Active-Sensing-Visual-Sequential.&quot; However, learning styles were not related to student perceived impact of analogical problem construction to understand database concepts. Student analogies were collected for a variety of SQL concepts; noteworthy examples are highlighted. While results related to learning styles are intriguing, the most promising path for further exploration (for both research and practice) is the use of analogy problem construction in Information Systems educational environments.","subject":"Cognitive Style, Databases, Information Systems, Information Science, Problem Solving, Teaching Methods, Prior Learning, Student Attitudes, Concept Formation, Transfer of Training, Logical Thinking, College Students, Questionnaires, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137402","title":"A Systems Analysis and Design Case Study for a Business Modeling Learning Experience for a Capstone CIS\/IS Systems Development Class","author":"Russell, Jack, Russell, Barbara","description":"The goal is to provide a robust and challenging problem statement for a capstone, advanced systems analysis and design course for CIS\/MIS\/CS majors. In addition to the problem narrative, a representative solution for much of the business modeling deliverables is presented using the UML paradigm. A structured analysis deliverable will be the topic of a second paper on this subject. The authors teach the systems analysis and design course(s) or the systems development course(s) at their university. The CIS senior capstone course that the primary author teaches requires that the student complete one or more business modeling case studies. The authors have used some cases\/problem statements from various systems analysis and design texts; however, the authors wanted a problem statement that would challenge a systems team at the senior undergraduate level to produce a complete static, functional and behavioral business model that could be designed and implemented. The authors believe that the narrative should include enough detail to enable the team to use either Unified Modeling Language (UML) or Structured Analysis.","subject":"Systems Analysis, Case Studies, College Curriculum, Systems Development, Information Systems, Computer Science Education, Advanced Courses, College Seniors, Group Activities, Student Projects, Business, Models, Learning Experience","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109691","title":"Enhancing Learning Outcomes through Experiential Learning: Using Open-Source Systems to Teach Enterprise Systems and Business Process Management","author":"Jewer, Jennifer, Evermann, Joerg","description":"Enterprise systems and business process management are the two key information technologies to integrate the functions of a modern business into a coherent and efficient system. While the benefits of these systems are easy to describe, students, especially those without business experience, have difficulty appreciating how these systems are used to improve the efficiency of business operations. This paper reports on a project to provide experiential learning to beginning business students. We focus on open-source enterprise and process management systems to investigate whether the benefits can be provided even by small institutions and without a large investment into commercial systems. The results of experimental studies are provided and suggest that hands-on learning on open-source systems can lead to improved learning outcomes. The main contribution is the demonstration that educators need not shy away from experiential learning when faced with the obstacles that large-scale commercial enterprise systems may present, but can instead choose a &quot;bottom-up&quot; approach of easily integrating enterprise systems into the curriculum to benefit student learning.","subject":"Outcomes of Education, Experiential Learning, Management Systems, Business Administration Education, Open Source Technology, Efficiency, Small Businesses, Teaching Methods, Curriculum Design, Undergraduate Students, Foreign Countries, Statistical Analysis, Scores, Pretests Posttests, Factor Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Canada"},{"id":"EJ1137365","title":"A Project Management Approach to Applying Best Practices to Online CS\/MIS Experiential Learning Projects","author":"Schwieger, Dana, Surendran, Ken","description":"The value of experiential learning projects (which are usually major assessments in courses) in education has been touted since the early 1900s (Dewey, 1938). These projects have the potential to deepen students' understanding of course topics by allowing them to put concepts into practice and watch the results develop. However, experiential learning projects require significant guidance, communication between students and faculty, and direction. Coupled with the communication intricacies of an online learning environment, experiential learning projects become a little more difficult to manage. In this article, the authors examine some of the best practices for teaching online courses as they relate to experiential learning projects, the value of experiential learning projects and then apply a project management approach to addressing the challenges of assigning experiential learning projects in online courses looking at two courses taught at the authors' institution. The authors then describe some best practices that they have incorporated to better manage the application of experiential learning projects in their online classrooms.","subject":"Program Administration, Best Practices, Online Courses, Computer Science Education, Management Information Systems, Experiential Learning, Web Based Instruction, Educational Benefits, Graduate Study, Course Descriptions, Blended Learning, Student Projects, Cooperative Learning, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137356","title":"Adding Value: Online Student Engagement","author":"Everett, Donna R.","description":"This paper seeks to add to the emerging literature related to online student engagement with additional suggestions for instructional strategies. Student engagement is one of the tenets of effective online instruction; as such, particular attention to how it adds value to student learning is crucial and worth the time and effort to enhance learning outcomes. What strategies and technology enhance student engagement and add value to student learning? Continuing research into online student engagement strategies is needed to add value to student learning.","subject":"Learner Engagement, Educational Strategies, Web Based Instruction, Online Courses, Electronic Learning, Value Added Models, Outcomes of Education, Educational Technology, Computer Mediated Communication, Synchronous Communication, Asynchronous Communication","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137096","title":"Learning Styles, Online Content Usage and Exam Performance in a Mixed-Format Introductory Computer Information Systems Course","author":"Lang, Guido, O'Connell, Stephen D.","description":"We investigate the relationship between learning styles, online content usage and exam performance in an undergraduate introductory Computer Information Systems class comprised of both online video tutorials and in-person classes. Our findings suggest that, across students, (1) traditional learning style classification methodologies do not predict behavioral measures of online learning, and (2) working on the online content specifically during allotted class time is positively related to exam performance. Controlling for differences across students, we find (3) accessing content on non-class days (consistency) is positively related to exam performance, while (4) working substantially ahead of the scheduled content pace is negatively related to exam performance.","subject":"Introductory Courses, Correlation, Cognitive Style, Undergraduate Students, Information Systems, Computer Science Education, Video Technology, Prediction, Tests, Classification, Online Courses, Course Content, Scores, Teaching Methods, Blended Learning, Measures (Individuals), Private Colleges, Course Descriptions, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137338","title":"Using a Balance Scorecard Approach to Evaluate the Value of Service Learning Projects in Online Courses","author":"Schwieger, Dana","description":"Service learning projects serve as a valuable tool for applying course concepts in a way to benefit both the students and community. However, they often require a significant amount of additional effort beyond that required of assigning conventional homework problems. When the projects take place in an online course setting, the level of complexity subsequently increases. Valuing the overall contribution of such projects, in light of their additional instructor and course costs, can be difficult. Such valuations are further complicated with the measures being subjective. In 1992, Drs. Robert Kaplan and David Norton published an article in Harvard Business Review detailing a model for measuring the effect of multiple perspectives, both financial and subjective, on business performance (Kaplan &amp; Norton, 1992). The Balanced Scorecard approach provides both an internal (process based) and external (outcomes based) standpoint to evaluating an organization utilizing four perspectives: (1) Learning and Growth, (2) Business Process, (3) Customer and (4) Financial (Kaplan &amp; Norton, 1996). With its thorough approach to evaluating objective and subjective measures of business performance, the model serves as a potential framework for use in the educational setting. In this article, the author developed and applied a modified version of Kaplan and Norton's Balanced Scorecard model to evaluate the value generated by a service learning project in an online course.","subject":"Service Learning, Instructional Effectiveness, Online Courses, Student Projects, Models, Outcomes of Education, Management Information Systems, Experiential Learning, College Students, Student Evaluation","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Missouri"},{"id":"EJ1137335","title":"Evaluating the Effectiveness of Self-Created Student Screencasts as a Tool to Increase Student Learning Outcomes in a Hands-On Computer Programming Course","author":"Powell, Loreen M., Wimmer, Hayden","description":"Computer programming is challenging to teach and difficult for students to learn. Instructors have searched for ways to improve student learning in programming courses. In an attempt to foster hands-on learning and to increase student learning outcomes in a programming course, the authors conducted an exploratory study to examine student created screencasts and their impact on students' performance regarding specific learning outcomes in a hands-on programming course. This study was conducted over four semesters when an instructor taught two sections of the course per semester; one section generated self created student screencasts in-class and the other section did not. The subjects were undergraduate business students enrolled in an upper level applications\/programming course at a university in Pennsylvania State System of Higher Education system. The experimental method was used to compare the differences in graded classroom activities, theory assessments, lab assessments, and final exam scores between the classes. Results showed that students who created screencasts while following along with the instructors step by step programming instructions as well as created screencast while independently working significantly (p&lt;0.05) performed more successful on theory assessments, lab assessments, and the final exam scores verses those students that did not.","subject":"Computer Science Education, Programming, Experiential Learning, Visual Aids, Instructional Materials, Instructional Effectiveness, Outcomes of Education, Undergraduate Students, Business Administration Education, Comparative Analysis, Student Developed Materials, Class Activities, Student Evaluation, Scores, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1137140","title":"Student Engagement: The Core Model and Inter-Cohort Analysis","author":"Davis, Christopher J., Kmetz, Karla","description":"Prior research in higher education shows that engagement has been inconsistently conceptualized: semantic inconsistency has been compounded by variations in the constructs used to operationalize engagement. Acknowledging these limitations, we conceptualize student engagement as a multi-faceted meta-construct, overcoming some of the limitations evident in prior studies. This supports a research design that enables us to tap the capacity of the LMS at our institution to operationalize the constructs that undergird the Bundrick et al (2014) model. Our inter-cohort analysis reveals significant variations in individuals' engagement with the on-line course. Our findings suggest that interactions among the primary elements of the learning environment--the student, the teacher, and the content--significantly affect engagement and student outcomes. Our findings also suggest an urgent need to deepen investigation of student engagement to more fully investigate the dynamics of interaction as on-line learning environments account for an increasing proportion of higher education.","subject":"Learner Engagement, Models, Cohort Analysis, Electronic Learning, Integrated Learning Systems, Research Design, Online Courses, Educational Environment, Outcomes of Education, Undergraduate Students, Assignments, Data Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Florida (Saint Petersburg)"},{"id":"EJ1137191","title":"The Flipped Classroom in Systems Analysis &amp; Design: Leveraging Technology to Increase Student Engagement","author":"Saulnier, Bruce M.","description":"Problems associated with the ubiquitous presence of technology on college campuses are discussed and the concept of the flipped classroom is explained. Benefits of using the flipped classroom to offset issues associated with the presence of technology in the classroom are explored. Fink's Integrated Course Design is used to develop a flipped class approach to the author's Systems Analysis &amp; Design course, and a resulting classroom module is provided as an example. Results of the initial use of this approach are discussed. It is concluded that the use of the flipped classroom in systems analysis and design definitely increases in-class student focus and engagement and as a result helped to increased student learning of both program specific and course specific student outcomes. Further longitudinal studies are suggested to determine effects of employing the flipped classroom approach on the continuing attainment of student learning outcomes.","subject":"Systems Analysis, Classroom Techniques, Design, Technology Uses in Education, Student Participation, Learner Engagement, Learning Modules, Instructional Effectiveness, Integrated Curriculum, Curriculum Design, Achievement Gains, Student Satisfaction, Teaching Methods, College Students, Blended Learning, Homework","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Connecticut"},{"id":"EJ1137093","title":"A Design Quality Learning Unit in OO Modeling Bridging the Engineer and the Artist","author":"Waguespack, Leslie J.","description":"Recent IS curriculum guidelines compress software development pedagogy into smaller and smaller pockets of course syllabi. Where undergraduate IS students once may have practiced modeling in analysis, design, and implementation across six or more courses in a curriculum using a variety of languages and tools they commonly now experience modeling in four or fewer courses in at most a couple of paradigms. And in most of these courses their modeling decisions focus on acceptable syntax rather than principles representing and communicating concepts of quality in information systems. Where learning design quality may once have been an osmotic side effect of development practice it must now be a conscious goal in pedagogy if it is to be taught at all. This paper presents a learning unit that teaches design quality in object-oriented models. The focus on object-oriented models allows the learning to permeate analysis, design, and implementation enriching pedagogy across the systems development life cycle. The quality perspective presented is more expansive than that usually found in software engineering, the traditional &quot;objective&quot; notion of metrics, and integrates aspects of aesthetics, the more subjective phenomena of satisfaction. This learning unit is intended as an adaptable framework to be tailored to the coursework and the overall objectives of specific IS programs.","subject":"Units of Study, Design, Computer Software, Models, Systems Development, Satisfaction, Aesthetics, College Curriculum, Information Systems, Computer Science Education","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137147","title":"Empowering Freshmen with Technology Skills: Wireless Routers","author":"VanderClock, William","description":"Most freshmen taking required, introductory information systems courses do not understand why they are required to take such courses and can't imagine that they will learn anything they don't already know. This paper presents an exercise that will excite and enthuse students about their computers and Information Systems in general. Every freshman is familiar with wireless network connections having used them with both their computers and their phones. The setup of those wireless networks however is somewhat of a mystery and considered far too complex to deal with by most students. This paper outlines a strategy for demystifying the technology and involving students in hands-on learning. By actually setting up a wireless router students gain confidence in their computer skills and become interested in learning more about information systems. This paper describes the process used to gain their interest and includes a handbook that can be used with students everywhere.","subject":"College Freshmen, Computer Literacy, Information Systems, Technological Literacy, Skill Development, Introductory Courses, Computer Networks, Telecommunications, Experiential Learning, Computer Science Education, Hands on Science, Learner Engagement","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098511","title":"A Complementary Measure of MIS Program Outcomes: Useful Insights from a Student Perspective","author":"Karsten, Rex, Roth, Roberta M.","description":"Assessing student learning is a critical element in today's higher education environment. Learning assurance programs seek to assess and improve the quality of student learning, and may employ both direct and indirect measures. In this paper, we describe a practical learning assurance assessment measure developed and used as a part of a broader program to evaluate and monitor the learning of students in our Management Information Systems major. This measure enables us to evaluate our students' learning as reflected by their confidence, persistence, and willingness to undertake MIS-related tasks. We believe this is an important indicator of learning. This paper describes our development of this measure, use of the measure as an element of our learning assurance program for our MIS major, and insights gained from this assessment approach.","subject":"Outcome Measures, Masters Programs, Management Information Systems, Psychometrics, Achievement Gains, Achievement Rating, Test Construction, Program Effectiveness, Program Evaluation, Outcomes of Education, Student Surveys","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Iowa"},{"id":"EJ1137155","title":"An IT Strategy Course: Why and How","author":"Woods, David M., Howard, Elizabeth V.","description":"With continuing changes in all aspects of the technology field, especially the emergence of cloud and &quot;as a service&quot; offerings, developing skills for strategic thinking about technology is of increasing importance to our students. However, the presence of formal IS\/IT strategy courses in programs of study trails that of more traditional courses. In addition, there is limited discussion on the teaching of strategy in the academic literature. This work offers reasons for the continued importance of teaching strategy and provides examples of how strategy is covered in a course on Global and Strategic Issues in IT.","subject":"Information Systems, Information Technology, Active Learning, Experiential Learning, Technology Uses in Education, College Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Ohio"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1137323","title":"Evaluating Business Intelligence\/Business Analytics Software for Use in the Information Systems Curriculum","author":"Davis, Gary Alan, Woratschek, Charles R.","description":"Business Intelligence (BI) and Business Analytics (BA) Software has been included in many Information Systems (IS) curricula. This study surveyed current and past undergraduate and graduate students to evaluate various BI\/BA tools. Specifically, this study compared several software tools from two of the major software providers in the BI\/BA field. The participants in the study evaluated each software tool according to three key criteria: 1) functionality, 2) ease of use, and 3) learning effectiveness. The &quot;learning effectiveness&quot; criterion was used to determine which BI\/BA tools provided the most effective learning of BI\/BA concepts in the IS classroom. The three criteria were used to develop recommendations for including specific BI\/BA software tools in the IS curriculum. Based on the findings of the study, the authors recommend that colleges and universities consider the use of the IBM-Cognos suite of tools as a viable means for teaching BI\/BA concepts in their Information Systems curricula. The results of the study are relevant to any college or university that currently includes (or is considering the inclusion of) Business Intelligence \/ Business Analytics concepts in its Information Systems curriculum.","subject":"Computer Software, Information Systems, Technology Uses in Education, Educational Technology, College Students, Business, Data Collection, Data Analysis, Curriculum, Student Surveys, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1077611","title":"Designing for Game-Based Learning: The Effective Integration of Technology to Support Learning","author":"Alaswad, Zina, Nadolny, Larysa","description":"The use of games and game structures in educational contexts is growing in popularity. An increasing number of technologies have been developed to meet the needs of designing a course as a game. This article discussed the design process in game-based learning and reviewed the research on structuring a course with a focus on feedback, goals, and interaction. In addition, we presented the best practices and technologies to support the integration of badges and leaderboards into game-based learning. With the intentional and systematic design of game-based learning, instructors and designers will increase the impact of game attributes and elements on student achievement and motivation. Further investigation of game-based learning attributes and elements is needed to provide detailed knowledge on the compatibility with current technological tools.","subject":"Instructional Design, Educational Games, Technology Integration, Best Practices, Feedback (Response), Objectives, Interaction, Motivation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113940","title":"From Tech Skills to Life Skills: Google Online Marketing Challenge and Experiential Learning","author":"Croes, Jo-Anne V., Visser, Melina M.","description":"The Google Online Marketing Challenge (GOMC) is a global, online student competition sponsored by Google. It is a prime example of an experiential learning activity that includes using real money ($250 sponsored by Google) with a real client. The GOMC has yielded compelling results in student engagement and learning objectives related to the direct digital marketing skills addressed. However, few studies have systematically scrutinized the broader personal and life skills inherent in experience-based learning. The current study explores learning outcomes of the GOMC from a student perspective including both the direct technical skills as well as broader, multidisciplinary life skills that are developed or enhanced. The study takes an inductive approach to examine the life skills endorsed by a pilot group of GOMC participants and subsequently examines these learning outcomes in a preliminary quantitative survey of 15 GOMC participants from an undergraduate Information Systems course. Study findings yielded perceived learning outcomes in the following areas: interpersonal life skills, digital technical skills directly related to course and challenge content, intrapersonal life skills (self-awareness, reflection, and strategic planning), and adaptive applied skills. The students' overall perceptions, challenges experienced, and reported implementation preferences are also discussed.","subject":"Internet, Search Engines, Experiential Learning, Marketing, Competition, Learning Activities, Learner Engagement, Outcomes of Education, Skill Development, Daily Living Skills, Interdisciplinary Approach, Pilot Projects, Student Surveys, Undergraduate Students, Information Systems, Technological Literacy, Interpersonal Competence, Self Concept, Reflection, Strategic Planning, Student Attitudes, Preferences, Teamwork, Leadership, Problem Solving","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137385","title":"Experiential Learning Using QlikView Business Intelligence Software","author":"Podeschi, R. J.","description":"This paper reports on the use of QlikView business intelligence software for use in a Business Intelligence (BI) course within an undergraduate information systems program. The course provides students with concepts related to data warehousing, data mining, visualizations, and software tools to provide business intelligence solutions for decision making. The goal of the course is to balance both the technical and business skills students require when using business intelligence systems. Specific use of the software QlikView is outlined through an experiential project whereby students obtain, model, analyze, and interpret publicly accessible airline data. QlikView is a leading business intelligence software package that allows users to import data from a variety of sources to create visualization-based dashboards for reporting and analysis. The use of QlikView in this course addresses common challenges with using commercially available software in the classroom.","subject":"Experiential Learning, Business, Intelligence, Computer Software, Undergraduate Study, Business Administration Education, Information Systems, Course Objectives, Data Analysis, Data Interpretation, Models, Air Transportation, Visualization","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098514","title":"How Does ERPsim Influence Students' Perceived Learning Outcomes in an Information Systems Course? An Empirical Study","author":"Chen, Liqiang, Keys, Anthony, Gaber, Donald","description":"It is a challenge for business students or even employees to understand business processes and enterprise software usage without involvement in real-world practices. Many business schools are using ERP software in their curriculum, aiming to expose students to real-world business practices. ERPsim is an Enterprise Resource Planning (ERP) teaching-learning tool for business students to learn actual SAP and business processes. This study empirically examines how ERPsim enhances student learning outcomes in an IS course. The findings reveal the antecedent effects of two important IS constructs (enjoyment and cognitive appraisal) on learning behavior and learning outcomes during students' involvement with ERPsim. The study provides empirical evidence that some major IS constructs (i.e., enjoyment and cognitive appraisal of using information systems) play important roles in shaping the effectiveness of using simulation game software to learn business processes and ERP software.","subject":"Business Administration Education, Strategic Planning, Computer Software, Information Systems, Outcomes of Education, Learning Processes, Computer Simulation, Hypothesis Testing, College Students, Student Surveys, Introductory Courses, Educational Experiments, Statistical Analysis, Path Analysis, Measurement, Reliability, Validity, Program Effectiveness","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137392","title":"Steganography and Cryptography Inspired Enhancement of Introductory Programming Courses","author":"Kortsarts, Yana, Kempner, Yulia","description":"Steganography is the art and science of concealing communication. The goal of steganography is to hide the very existence of information exchange by embedding messages into unsuspicious digital media covers. Cryptography, or secret writing, is the study of the methods of encryption, decryption and their use in communications protocols. Steganography manipulates data to ensure the security of information, but the concept of steganography differs from cryptography. Cryptography obscures the meaning of a message, but it does not conceal the fact that there &quot;is&quot; a message. The goal of cryptography is to make data unreadable by a third party, whereas the goal of steganography is to hide the data from a third party. We present a way to integrate steganography and cryptology examples into introductory programming courses. This enrichment promotes active involvement in the course and provides opportunity to engage students in experimental problem solving and collaborative learning to enhance critical thinking.","subject":"Introductory Courses, Programming, Computer Science Education, Technology, Learner Engagement, Problem Solving, Cooperative Learning, Critical Thinking, College Freshmen, Enrichment, Computer Security","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077771","title":"Assessing the Efficacy of Incorporating Game Dynamics in a Learning Management System","author":"Frost, Raymond D., Matta, Vic, MacIvor, Erin","description":"The goal of the study was to see if gamification of a Learning Management System (LMS) would increase a number of desirable outcomes: student interest, motivation, satisfaction, student learning and perception of pedagogical affect. These constructs were measured in a survey, except for learning, which was measured by grades. Gamification of the LMS included the addition of all of the following: (1) An illustrated hero's adventure storyline with monsters to overcome by completing quests (assignments and assessments), (2) Olympic colored badges to represent individual grades as well as overall progress, (3) Points earned on a game-like scale--e.g., 100,000 points for the course, (4) A leaderboard with anonymous names and avatars, (5) Lives which allowed students to turn in a fixed number of late assignments without penalty. While open-ended responses suggested that students appreciated some gamification aspects, the quantitative data suggested that gamification has virtually no effect on the constructs measured. Only relatedness (a sub-construct of motivation) and student interest were found to be significant, although with small effect sizes. This study contributes to existing literature by exploring the impact of gamification of an LMS for a required introductory course in information systems.","subject":"Integrated Learning Systems, Games, Student Interests, Student Motivation, Student Satisfaction, Learning, Student Attitudes, Student Surveys, Grades (Scholastic), Self Determination, College Students, Business Administration Education, Personal Autonomy, Competence, Interpersonal Relationship, Pretests Posttests","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084406","title":"Open Source Meets Virtual Reality--An Instructor's Journey Unearths New Opportunities for Learning, Community, and Academia","author":"O'Connor, Eileen A.","description":"Opening with the history, recent advances, and emerging ways to use avatar-based virtual reality, an instructor who has used virtual environments since 2007 shares how these environments bring more options to community building, teaching, and education. With the open-source movement, where the source code for virtual environments was made available to the public, greatly reduced prices and increased options are shifting dramatically the utility of virtual environments for developing student competencies as virtual creators; supporting faculty and organizational needs; enabling comprehensive curriculum, assessment, and design; and allowing for multipurpose virtual environments. Reporting changes to how she taught the development of virtual environments, the author explains the enhanced learning observed within a newly designed course and the improvements she will make in the future. Additional recommendations address how education, communication, and learning organizations can use improvements to implement multipurpose virtual environments and can support technology-facilitated design in general.","subject":"Electronic Learning, Virtual Classrooms, Simulated Environment, Open Source Technology, Teaching Methods, Educational Change, Computer Simulation, Internet, Educational Technology, Curriculum Design, Lifelong Learning, Communities of Practice, Scaffolding (Teaching Technique), Masters Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137387","title":"Live, Model, Learn: Experiencing Information Systems Requirements through Simulation","author":"Hartzel, Kathleen S., Pike, Jacqueline C.","description":"Information system professionals strive to determine requirements by interviewing clients, observing activities at the client's site, and studying existing system documentation. Still this often leads to vague and inaccurate requirements documentation. When teaching the skills needed to determine requirements, it is important to recreate a realistic environment to develop analytical thinking skills. To address this, we developed a simulation for students to learn requirements gathering and analysis where they experience the requirements by operating a fictitious manufacturing firm. The students manage and operate the company, taking on a variety of employee roles from the physical &quot;manufacturing&quot; to the order-taking to the purchasing of component parts. With this pedagogical approach, students deal with the messiness of the problem by drawing on their own experience working in the manufacturing firm, making assumptions, and having the opportunity to verify their assumptions and analyses by working with their classmates. The simulation was implemented across two courses in an undergraduate information systems program.","subject":"Information Systems, Simulation, Teaching Methods, Employees, Role, Manufacturing Industry, Administration, Experiential Learning, Undergraduate Study, Active Learning, Inquiry, Systems Analysis, Design, Information Management, Student Attitudes, Student Surveys, Likert Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1109645","title":"Teaching Tip: Active Learning via a Sample Database: The Case of Microsoft's Adventure Works","author":"Mitri, Michel","description":"This paper describes the use and benefits of Microsoft's Adventure Works (AW) database to teach advanced database skills in a hands-on, realistic environment. Database management and querying skills are a key element of a robust information systems curriculum, and active learning is an important way to develop these skills. To facilitate active learning and produce a compelling narrative, the data structure and content of a useful pedagogically-oriented database should be realistic and lifelike. It should contain data that accurately depicts the business processes, functions, and entities of a realistic organization, structured in a way that demonstrates best practices in database design. Most database textbooks include sample databases, but these are often small and sparse of data. By contrast, Microsoft's AW database presents a robust, realistic, and comprehensive framework for many important educational objectives in an IS curriculum. This paper introduces the AW business case and database, and illustrates several pedagogical uses in an undergraduate CIS program.","subject":"Active Learning, Databases, Computer Software, Educational Benefits, Case Method (Teaching Technique), Case Studies, Skill Development, Information Systems, Curriculum Development, Educational Technology, Business Education, Best Practices, Database Design, Problem Based Learning, Problem Solving, Database Management Systems, Educational Objectives, Undergraduate Study, Computer Science Education, Programming Languages, Information Retrieval, Student Attitudes","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084416","title":"Building Confidence as Digital Learners with Digital Support across the Curriculum","author":"Smith, Samara, Chipley, Laura","description":"This article describes the implementation and outcomes of incorporating creative digital assignments that utilize emergent social technologies in six college courses across the curriculum during the Spring 2015 term. These projects were supported by a digital learning center providing a website of short video and text tutorials, assignment consultations, class visits, and workshops for both students and instructors. Assessment data and student feedback indicate that, while an initial exposure to digital tools may decrease confidence, repeated exposure and experience can bolster student confidence and enjoyment as digital learners and producers. In addition, assessments reflected positive associations between the number and variety of digital tools utilized by students in their assignments, and the growth in the students' confidence and enjoyment as digital learners and producers.","subject":"Electronic Learning, College Students, Technology Uses in Education, Resource Units, Computer Uses in Education, Shared Resources and Services, Multimedia Materials, Learning Resources Centers, Web Sites, Video Technology, Tutorial Programs, Assignments, Blended Learning, Observation, Workshops, Feedback (Response), Self Efficacy, Learner Engagement, Hypothesis Testing, Outcomes of Education, Computer Literacy","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1098519","title":"The Determinants of Student Effort at Learning ERP: A Cultural Perspective","author":"Alshare, Khaled A., El-Masri, Mazen, Lane, Peggy L.","description":"This paper develops a research model based on the Unified Theory of Acceptance and Use of Technology model (UTAUT) and Hofstede's cultural dimensions to explore factors that influence student effort at learning Enterprise Resource Planning (ERP) systems. A Structural Equation Model (SEM) using LISREL was utilized to validate the proposed research model using a convenience sample of students at two universities in the USA. The results showed that while subjective norm and career relevance were positively associated with performance expectancy (PE), course structure and self-efficacy were positively associated with effort expectancy (EE). Performance expectancy and effort expectancy were positively associated with student attitude toward ERP. Student attitude toward ERP was positively associated with student effort at learning ERP. The results also revealed that power distance, uncertainty avoidance, and masculinity moderate the relationships between EE and PE on one side and attitude on the other side, between EE and PE, and between attitude and effort at learning ERP, respectively. Implications for educators and researchers are reported.","subject":"Management Information Systems, Adoption (Ideas), Models, College Students, Structural Equation Models, Student Behavior, Self Efficacy, Student Attitudes, Relevance (Education), Course Organization, Power Structure, Anxiety, Masculinity, Behavior Standards, Social Behavior, Student Surveys, Questionnaires, Factor Analysis, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137143","title":"The Impact of Programming Experience on Successfully Learning Systems Analysis and Design","author":"Wong, Wang-chan","description":"In this paper, the author reports the results of an empirical study on the relationship between a student's programming experience and their success in a traditional Systems Analysis and Design (SA&amp;D) class where technical skills such as dataflow analysis and entity relationship data modeling are covered. While it is possible to teach these technical skills to students without programming experience, the results of the study strongly suggest that students with programming experience complete the course more successfully than those without.","subject":"Programming, Information Systems, Systems Analysis, Design, Problem Solving, Systems Development, Information Technology, Regression (Statistics), Hypothesis Testing, College Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077628","title":"Individual Differences in Digital Badging: Do Learner Characteristics Matter?","author":"Fanfarelli, Joseph R., McDaniel, Rudy","description":"Badge use has rapidly expanded in recent years and has benefited a variety of applications. However, a large portion of the research has applied a binary &quot;useful&quot; or &quot;not useful&quot; approach to badging. Few studies examine the characteristics of the user and the impact of those characteristics on the effectiveness of the badging system. This study takes preliminary steps toward that cause, examining the effectiveness of a badging system across two web-based university courses in relation to the individual differences of the learners. Individual differences are examined through the lens of Long-Dziuban reactive behavior types and traits. Results revealed differences in badge effectiveness that were dependent upon students' Long-Dziuban categorization. Student engagement, intrinsic motivation, reflective and integrative learning, and higher order learning were the constructs most dependent upon categorization. Additional results and their implications are discussed within.","subject":"College Students, Recognition (Achievement), Individual Differences, Student Characteristics, Online Courses, Electronic Learning, Program Effectiveness, Personality Traits, Student Motivation, Classification, Emotional Response, Personality Measures, Distance Education, Aggression, Statistical Analysis, Correlation, Behavior Patterns","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Florida"},{"id":"EJ1113941","title":"Teaching Tip: Using a Group Role-Play Exercise to Engage Students in Learning Business Processes and ERP","author":"Shen, Yide, Nicholson, Jennifer, Nicholson, Darren","description":"With the increasing process-centric focus and proliferation of Enterprise Resource Planning (ERP) systems in organizations, it is imperative for business graduates to understand cross-functional business processes and ERP system's role in supporting business processes. However, this topic can be rather abstract and dry to undergraduate students, most of whom have little work experience. In this paper, we present a group role-play exercise that has been used in an introductory management information systems course to actively engage students in learning business processes and ERP systems. Student learning outcomes and their perceptions of the group role-play exercise were measured using a questionnaire. Results indicate that student knowledge of three key business processes and ERP system's role in supporting business processes increased significantly after participating in the role-play exercise. Students also had positive perceptions of the group role-play exercise. Teaching suggestions for implementing the group role-play exercise, as well as contributions of this study, are discussed.","subject":"Management Information Systems, Strategic Planning, Role Playing, Business Administration Education, Undergraduate Students, Group Activities, Introductory Courses, Student Attitudes, Outcomes of Education, Questionnaires, Teaching Methods, Scores, Educational Benefits","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084414","title":"Teaching Adult Learner Characteristics and Facilitation Strategies through Simulation-Based Practice","author":"Speed, Sally A., Bradley, Elizabeth, Garland, Krista Vince","description":"This article relates a project in which a curriculum module was developed to help graduate students more effectively manage behaviors of adults in facilitation sessions. The module was piloted in the project and later included in a graduate level course in the Creative Studies Department of SUNY Buffalo State. The curriculum identified characteristics of adult learners and behaviors that manifest from those characteristics and helped Creative Studies graduate students develop strategies to manage such behaviors in facilitation sessions. The module included practice sessions for facilitation using TeachLivE™, a mixed reality simulation that offers education students practice in classroom management with avatars to enhance their teaching skills. Results indicated that students felt they were more capable of managing adult learner behaviors and more confident and effective in facilitations as a result of the module and TeachLivE™ simulation.","subject":"Adult Learning, Graduate Students, Learning Modules, Computer Simulation, Classroom Techniques, Experiential Learning, Quasiexperimental Design, Pilot Projects, Curriculum Development, Student Educational Objectives, Feedback (Response), Longitudinal Studies, Pretests Posttests, Likert Scales, Student Surveys, Program Effectiveness, Data Analysis, Qualitative Research, Statistical Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137322","title":"A Proposed Concentration Curriculum Design for Big Data Analytics for Information Systems Students","author":"Molluzzo, John C., Lawler, James P.","description":"Big Data is becoming a critical component of the Information Systems curriculum. Educators are enhancing gradually the concentration curriculum for Big Data in schools of computer science and information systems. This paper proposes a creative curriculum design for Big Data Analytics for a program at a major metropolitan university. The design emphasizes expanded learning of business, mathematical and statistical, and presentation skills, in projects of teams, in addition to skills in technology. This paper will be beneficial to educators considering improvement of the curriculum for Big Data Analytics and to students desiring a more contemporary program.","subject":"Curriculum Design, Data Analysis, Data Collection, Information Systems, Computer Science Education, College Students, Information Security, Privacy, Student Educational Objectives, Core Curriculum, Prerequisites, Textbooks","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"New York (New York)"},{"id":"EJ1137384","title":"Information Security in a World of Global Connectivity: A Case Study","author":"Lawrence, Cameron, Olson, Garrett, Douma, Bambi","description":"The widespread use of digital technologies such as smartphones, tablets, and notebook computers expose firms engaged in international business to risks that far exceed what most corporate technology users understand. This case study examines some of the technology-specific vulnerabilities managers face when engaged in international travel and introduces tools and technologies including HTTPS, two-factor authentication, VPNs and the use and management of complex passwords. The case concludes with a set of discussion questions and hands-on exercises that can be completed in or out of class. This case is intended for the Intro to MIS class and complements the model curriculum objectives in IS 2010.1 and IS 2010.7.","subject":"Information Security, Computer Security, Global Approach, Travel, Introductory Courses, Management Information Systems, Student Educational Objectives, Privacy, Computer Science Education, Learning Activities, Case Method (Teaching Technique), Case Studies","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137333","title":"Teaching Non-Beginner Programmers with App Inventor: Survey Results and Implications","author":"Soares, Andrey, Martin, Nancy L.","description":"This paper reports the results of a survey with 40 students enrolled in an Android Application Development course offered during the spring semester of 2013 and 2014. The course used App Inventor to build the apps and required students to have an introduction to programming course as a prerequisite. The survey asked for demographic information and students' opinions about prerequisites, App Inventor, previous programming skills, new concepts learned, teamwork, and more. The positive responses support the practice of using App Inventor to teach not only beginner programmers, but also more experienced programmers. The paper also shows that App Inventor can be used to support the teaching of more advanced computing concepts. [Note: The issue month (October) shown on this PDF is incorrect. The correct publication month is September 2015.]","subject":"Computer Science Education, Computer Oriented Programs, Programming, Advanced Courses, Advanced Students, Student Attitudes, Student Surveys, Likert Scales, Prior Learning, Prerequisites, Novices, Secondary Education, Higher Education","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137342","title":"Introducing Big Data Concepts in an Introductory Technology Course","author":"Frydenberg, Mark","description":"From their presence on social media sites to in-house application data files, the amount of data that companies, governments, individuals, and sensors generate is overwhelming. The growth of Big Data in both consumer and enterprise activities has caused educators to consider options for including Big Data in the Information Systems curriculum. Introducing Big Data concepts and technologies in the classroom often is reserved for advanced students in database or programming courses. This paper explores approaches for integrating Big Data into the Information Systems curriculum, and presents a sample lesson for presenting basic Big Data concepts to first year students in a general education Information Technology course. As the need for IT professionals with Big Data skills will continue to increase, including these topics in a general education technology curriculum is especially pertinent.","subject":"Data Analysis, Introductory Courses, Information Systems, Information Technology, College Freshmen, General Education, Business Schools, Student Evaluation, Knowledge Level, Pretests Posttests, Experiential Learning, Visualization, Social Media, Databases, Student Surveys","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Massachusetts"},{"id":"EJ1137144","title":"First Database Course--Keeping It All Organized","author":"Baugh, Jeanne M.","description":"All Computer Information Systems programs require a database course for their majors. This paper describes an approach to such a course in which real world examples, both design projects and actual database application projects are incorporated throughout the semester. Students are expected to apply the traditional database concepts to actual database storage problems. The design of the database is emphasized and students evaluate each other's design as well as their final database project. The details of a database written by the Author to organize all information surrounding the student's project are also presented. In this database course, the students are able to follow the progress of their fellow students during the course. Student's evaluations of each other's work during the semester is shown to be beneficial in the learning process.","subject":"Undergraduate Students, Computer Science Education, Information Systems, Databases, Introductory Courses, Required Courses, Majors (Students), Information Storage, Database Design, Student Projects, Peer Evaluation, Outcomes of Education, Programming Languages, Programming, Student Attitudes, Student Surveys, Rating Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137334","title":"Enhancing the Classroom Experience: Instructor Use of Tablets","author":"Cummings, Jeff, Hill, Stephen","description":"Instructors continually search for innovative approaches to interact with and engage students in the classroom. The tablet offers a potential innovation for this purpose. Tablet devices from Apple, Microsoft, and other hardware vendors have overcome many of the challenges of the past (e.g. cost and limited applications) to become useful tools for instructors. Our paper examines instructor use of tablet devices by evaluating current tablet hardware and software solutions. A number of teaching tasks are evaluated to understand how they can be enhanced with tablets. These teaching tasks are utilized in a numbers of classes followed by an examination of student perceptions of tablet technologies in the classroom. Our results suggest that tablets are an effective tool with students rating instructor effectiveness as high compared to traditional classroom approaches. Based on results from student feedback, we recommend continued tablet use in the classroom.","subject":"Handheld Devices, Technology Uses in Education, Instructional Effectiveness, Outcomes of Education, Computer Software Evaluation, Computer Peripherals, Computer Oriented Programs, Teaching Methods, Lecture Method, Spreadsheets, Grading, Notetaking, Benchmarking, Blended Learning, Visual Aids, Student Attitudes, Student Surveys, Likert Scales, Instructional Innovation","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137146","title":"Incorporating a Human-Computer Interaction Course into Software Development Curriculums","author":"Janicki, Thomas N., Cummings, Jeffrey, Healy, R. Joseph","description":"Individuals have increasing options on retrieving information related to hardware and software. Specific hardware devices include desktops, tablets and smart devices. Also, the number of software applications has significantly increased the user's capability to access data. Software applications include the traditional web site, smart device applications and web pages that emulate apps on mobile devices. The importance of high user satisfaction is critical as users will switch quickly to other devices or sources for their information needs. To assist in developing high impact and positive user satisfaction are the theories from the field of study known as Human Computer Interaction (HCI). This research summarizes several of the key theories from HCI and recommends the placement of learning modules related to HCI in current software development courses as well as proposing an updated standalone HCI course into MIS and CIS curriculums.","subject":"Computer Science Education, Man Machine Systems, Computer Software, Curriculum Development, Information Systems, Management Systems, Computer System Design, Course Content, Models, Core Curriculum","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109647","title":"Using Bloom's and Webb's Taxonomies to Integrate Emerging Cybersecurity Topics into a Computing Curriculum","author":"Harris, Mark A., Patten, Karen P.","description":"Recent high profile hackings have cost companies millions of dollars resulting in an increasing priority to protect government and business data. Universities are under increased pressure to produce graduates with better security knowledge and skills, particularly emerging cybersecurity skills. Although accredited undergraduate computing programs recognize the need to solve this problem, these computing programs are constrained by accreditation standards and have limited ability to modify their curricula. This paper discusses a case study on how one Accreditation Board for Engineering and Technology (ABET) accredited undergraduate IT program created a strategy to continue to teach existing security-related topics as well as emerging cybersecurity topics within its IT curriculum without increasing credit requirements. The faculty developed an &quot;IT Security-related and Cybersecurity Curriculum Taxonomy&quot; to identify strategies to move security-related topics taught in the higher level courses to lower and intermediate courses. Thus emerging cybersecurity topics could be added to high-level courses. The faculty also created the &quot;IT Student Learning (Security-related) Taxonomy&quot; by combining &quot;Bloom's Taxonomy's&quot; six levels of thinking with Webb's &quot;Depth of Knowledge Model.&quot; This student learning taxonomy enabled the faculty to review the student learning outcomes for each of the existing security-related core topics and develop new ones for the emerging cybersecurity topics. Challenges, benefits, and application of this strategy to other disciplines are discussed.","subject":"Taxonomy, Computer Security, Curriculum Development, Undergraduate Study, Computer Science Education, Case Studies, Accreditation (Institutions), Engineering Education, Technology Education, Information Technology, Educational Strategies, Educational Benefits, Curriculum Implementation","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120922","title":"Pedagogical Aspects of Voluntary School Work","author":"Mária Jármai, Erzsébet, Palányi, Ildikó Zsupanekné","description":"The economic importance of voluntary work has been exceedingly appreciated in the last few decades. This is not surprising at all, because it is highly profitable according to the related estimated data. There are 115,9 million people doing voluntary work only in Europe, which means that they would create the world's 7th biggest economy with EUR 282 billion value creation if they formed an individual state. The organizations know that voluntary work has several advantages apart from the economic benefits. It is profitable both for the society and for the individuals as well. Several researches have proven that voluntary work positively influences the development of the personality, because the key-competencies--such as: co-operation, empathy, solidarity, conflict handling, problem solving, etc.--expected in the labor market can be improved.","subject":"Foreign Countries, Volunteers, Labor Market, Labor Force Development, Informal Education, Service Learning, Student Attitudes, High School Students, College Students, Competence, Social Capital, Student Motivation, Age Differences, Required Courses, Literature Reviews, Questionnaires, Student Participation, Incidence, Likert Scales, Scores, Work Experience","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1113944","title":"Social Representations of Cybersecurity by University Students and Implications for Instructional Design","author":"Pawlowski, Suzanne D., Jung, Yoonhyuk","description":"Cybersecurity has become an essential topic in introductory information systems (IS) core courses. As an aid to course design, the exploratory research in this paper uses a social representations lens to elucidate the perceptions of cybersecurity and cybersecurity threats held by students. Analysis of qualitative survey data from 152 students at a university in the Western U.S. identified 23 concepts forming the students' collective understanding of cybersecurity. Presented in the form of a social representations map, the findings reveal student perspectives that can be used to motivate and enhance learning about cybersecurity threats and mitigation strategies. Interpretation of the map indicates that students' sensemaking about cybersecurity places the strongest emphasis on technological concepts and socio-political concerns. In contrast, potential cybersecurity threats to national critical infrastructure are only minimally represented. The survey also examined students': (a) level of concern about different cybersecurity threats; (b) perceived likelihood they will experience given computer security incidents; and (c) incidents they have already experienced. Instructors of introductory IS courses can utilize the study findings to motivate student interest by building upon topics currently evident in the representation\/frame of reference and increase student awareness and attention to cybersecurity threats that are missing. Suggested instructional design approaches, tailored to the level of awareness\/prior knowledge and concern indicated include: (1) a problem-centered approach for topics related to personal cybersecurity; (2) demonstrating relevance and utilizing case studies for topics on organizational cybersecurity; and (3) collaborative, guided discovery to raise awareness about national security\/critical infrastructure cybersecurity threats and protections.","subject":"Information Security, Information Science Education, Information Systems, Qualitative Research, Student Surveys, Student Attitudes, Learning Motivation, Introductory Courses, Undergraduate Students, Instructional Design, Teaching Methods, Consciousness Raising, National Security, Case Studies, Cooperation, Content Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121024","title":"Tutoring and Mentoring: An A.R.C. Model for Future Teachers: Affective, Reflexive and Cognitive Orientation to Self-Regulated Learning","author":"Remy, Philippe","description":"With a specific focus on tutoring among future teachers this article proposes a model of self-regulated learning. The focus on different mechanisms inherent to the tutoring relationship will consider Affective impacts or motivation, Reflexive or metacognitive and Cognitive resolutions. The ARC combination proposes that personal skills will be gained and beneficial transfers into the class will be possible. This approach with a model considers explicit learning as a part of tutoring relationship successes. A prospective study on a short scale provides a few indicators in this direction and will be followed by a mentoring study. As private companies also present services in the shadow of the official educational system some recommendations will illustrate the tutoring original pedagogical relation with specific limits and the potential for new understanding.","subject":"Tutoring, Mentors, Motivation, Preservice Teachers, Learning Processes, Qualitative Research, Interviews, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098512","title":"Should You Allow Your Students to Grade Their Own Homework?","author":"Simkin, Mark G.","description":"Allowing students to grade their own homework promises several advantages to both students and instructors. But does such a policy make sense? This paper reports the results of an experiment in which eight separate assignments completed by approximately 80 students were first graded by the students using a grading rubric, and then re-graded by a teaching assistant, using this same rubric. The study found that the differences observed in the two sets of data were statistically significant, but (in the author's opinion) acceptably small. The study also confirmed observations by earlier researchers that students who generously grade their work tend to fall among the lower-performing individuals in a class.","subject":"College Students, Grading, Self Evaluation (Individuals), Homework, Educational Experiments, Scoring Rubrics, Teaching Assistants, Comparative Analysis, Statistical Significance, Low Achievement, Cooperative Learning, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077745","title":"Making Data Flow Diagrams Accessible for Visually Impaired Students Using Excel Tables","author":"Sauter, Vicki L.","description":"This paper addresses the use of Excel tables to convey information to blind students that would otherwise be presented using graphical tools, such as Data Flow Diagrams. These tables can supplement diagrams in the classroom when introducing their use to understand the scope of a system and its main sub-processes, on exams when answering questions about such relationships, or in group projects in discussing problems with and recommendations for systems. The main contributions are a) a suggestion on how to translate the different aspects of Data Flow Diagrams into a table format and b) the in-class experiences from using the approach. The approach can be broadened to other graphical representations such as Entity-Relationship Diagrams or Use-Case Diagrams. Further, this approach could be broadened to support alternative learning styles of sighted students in the class.","subject":"Tables (Data), Visual Impairments, Blindness, Flow Charts, Teaching Methods, Assistive Technology, Courseware, Computer System Design, Appropriate Technology, Systems Analysis, Knowledge Representation, Educational Practices","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077761","title":"Design and Delivery of a New Course of Information Technology for Small Business","author":"Wang, Shouhong, Wang, Hai","description":"Many university or college business programs offer majors or concentrations of small business management, but few of them offer a course of information technology (IT) for small business, despite the fact that IT plays an important role in the management of innovative small businesses. While introductory information systems (IS) courses emphasize the general issues of IT\/IS, IT solution services specifically applicable to small business are virtually missing in the curriculum of small business management. This paper applies the pedagogical design methodology, discusses advanced IT topics specifically for small business, provides a pedagogical outline of a new course of IT for small business, and presents an approach to delivering the course. The authors' preliminary experience indicates the usefulness of the new course for business majors.","subject":"Delivery Systems, Information Technology, Small Businesses, Curriculum Design, Curriculum Development, Business Administration, Business Administration Education, Course Descriptions, Course Organization, Learning Modules, College Programs","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113948","title":"Teaching Tip: Managing Software Engineering Student Teams Using Pellerin's 4-D System","author":"Doman, Marguerite, Besmer, Andrew, Olsen, Anne","description":"In this article, we discuss the use of Pellerin's Four Dimension Leadership System (4-D) as a way to manage teams in a classroom setting. Over a 5-year period, we used a modified version of the 4-D model to manage teams within a senior level Software Engineering capstone course. We found that this approach for team management in a classroom setting led to qualitatively fewer incidents of teams unable to effectively work together, better projects, and greater group cohesion. In this article, we discuss our experience using the 4-D System, which was not originally designed for use in the classroom. We find our modified version of the 4-D System to be viable in a classroom setting and provide the reader with everything needed to implement 4-D in his or her own course.","subject":"Engineering Education, Computer Science Education, Computer Software, Programming, Leadership Styles, Teamwork, Cooperative Learning, Classroom Environment, College Curriculum, Group Dynamics, Educational Practices, Educational Strategies, Program Administration","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077752","title":"American Association of University Women: Branch Operations Data Modeling Case","author":"Harris, Ranida B., Wedel, Thomas L.","description":"A nationally prominent woman's advocacy organization is featured in this case study. The scenario may be used as a teaching case, an assignment, or a project in systems analysis and design as well as database design classes. Students are required to document the system operations and requirements, apply logical data modeling concepts, and design an appropriate data structure for a relational database. The case focuses on a membership administration system with several extended components to keep track of entities such as the Board of Directors and branch committees. The case has been used successfully in the classroom at both individual and group levels. Feedback from students and instructors who have utilized the case indicate that it is an effective instrument that provides a realistic illustration of real-world data modeling without being unreasonably complex. Teaching notes and a suggested solution including data flow diagrams, an entity-relationship diagram (ERD), and a data dictionary are available through the JISE web site.","subject":"Advocacy, Case Method (Teaching Technique), Womens Studies, Community Organizations, Systems Analysis, Database Design, Operations Research, Assignments, Learning Activities, Units of Study, Instructional Design, Business Administration, Business Administration Education, Professional Associations","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098517","title":"Teaching Case: Adapting the Access Northwind Database to Support a Database Course","author":"Dyer, John N., Rogers, Camille","description":"A common problem encountered when teaching database courses is that few large illustrative databases exist to support teaching and learning. Most database textbooks have small &quot;toy&quot; databases that are chapter objective specific, and thus do not support application over the complete domain of design, implementation and management concepts across a single database. The Northwind Traders sample database is available by Microsoft for download and use in Microsoft Access, and illustrates transactional processing for a fictitious company that imports (purchases) and exports (sells) specialty foods from around the world. The database contains sample tables, queries, forms, reports, Macros, VBA Class Objects, functions and modules, and other database features. Although the primary purpose for the database is to serve as an illustrative design template for students and practitioners, unfortunately the database and business processes are largely undocumented. This paper attempts to more completely document the business processes, including establishing business rules, describing relationships and participations, and discusses some problems with the existing design. Following understanding of the database and associated business processes, this paper can be used as both a teaching tool and a guide for practitioners using the Northwind Traders sample database as a design template. Additionally, it has been used successfully to introduce the concept of business processes and mapping them in an underlying database in introductory ERP courses.","subject":"Databases, Media Adaptation, Database Design, Database Management Systems, Computer Science Education, Instructional Materials","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121026","title":"The Impact of Pedagogical Agent on Learners' Motivation and Academic Success","author":"Dincer, Serkan, Doganay, Ahmet","description":"Pedagogical agent is generally described as educational programs that guide, motivate learners while encouraging them during learning by providing feedback. The tasks (informative, guiding, or friend, etc.) and types (human-like, cartoon character, audio, text, etc.) of these modules can be classified based on various variables. Although computer-assisted instruction software is commonly used as a teaching material, research on modules integrated on such programs is scarce. Studies in the field have revealed that such computer-assisted instruction programs increase motivation of learners. In order to keep motivation levels high, these programs need to be adopted depending on the individual needs. Therefore, it can be beneficial to integrate software designed that can be personalized. In this respect, the present study was conducted with secondary school students to identify the impact of pedagogical agent on learners' academic success and motivation. For the purpose of the study, four groups were formed. The first group received education via fixed pedagogical agent, the second group had the option to choose among several pedagogical agents, the third group received the education without pedagogical agent and finally the last group received the same education through traditional (non-computer) way. This four-week program was introduced to students via MS Excel program and the data was gathered as pre- and post-test method. The findings have revealed that interfaces impacted motivation and accordingly academic success in a positive way. As a result of the study, it is suggested that learners should be provided programs that can be personalized depending on learners' needs and preferences.","subject":"Student Motivation, Academic Achievement, Computer Assisted Instruction, Pretests Posttests, Pilot Projects, Experimental Groups, Control Groups, Statistical Analysis, Secondary School Students, Grade 5, Grade 8","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null}]