[{"id":"EJ1143785","title":"Conversation Analysis in Computer-Assisted Language Learning","author":"González-Lloret, Marta","description":"The use of Conversation Analysis (CA) in the study of technology-mediated interactions is a recent methodological addition to qualitative research in the field of Computer-assisted Language Learning (CALL). The expansion of CA in Second Language Acquisition research, coupled with the need for qualitative techniques to explore how people interact in technology-mediated environments, has stimulated a small but growing body of research. This article reviews CALL research that employed a CA approach to the collection, microanalysis, and understanding of the data in a variety of technology-mediated fields (text, audio and video SCMC, email, forums and bulletin boards, social networks, and games), with participants from different contexts and languages, interacting in an L2 either among themselves or with native\/more expert speakers of the language. Most research up to now has been descriptive in nature, illustrating the sequential organization of interaction, interactional and linguistic resources employed by the participants, and affordances and challenges of the media to promote language learning. In addition, a few studies have directly explored &quot;learning&quot; through the microanalysis of longitudinal data for any changes in the learners' linguistic and interactional patterns of engagement. The review of studies is followed by those challenges that affect the implementation of CA in CALL research and a vision of the future of CA for CALL in the larger field of Applied Linguistics.","subject":"Discourse Analysis, Computer Mediated Communication, Computer Assisted Instruction, Second Language Instruction, Second Language Learning, Qualitative Research, Data Analysis, Program Implementation, Educational Research, Applied Linguistics, Sequential Approach, Affordances, Longitudinal Studies, Concept Formation","source":"CALICO Journal","publicationdateyear":2015},{"id":"EJ1176697","title":"Quantitative Considerations for Improving Replicability in CALL and Applied Linguistics","author":"Plonsky, Luke","description":"There are a number of methodological practices commonly employed by CALL researchers that limit progress in the field. Some of these practices are particular to replication research, but most are more general and are found throughout the field. I describe in this paper two studies that are fabricated but that resemble much of what is found in published second language research. Each study corresponds to and contains a set of methodological issues. Following each study, I address the issues they illustrate, providing comments and suggestions for how the analyses could be modified to produce greater replicability and\/or replicational value. I conclude with a summary of suggestions for quantitative reforms related to improving replication research and quantitative practices more generally in CALL and applied linguistics.","subject":"Computer Assisted Instruction, Educational Technology, Second Language Instruction, Teaching Methods, Statistical Analysis, Spanish, Educational Games, English (Second Language), College Students, Questionnaires, Reading Comprehension","source":"CALICO Journal","publicationdateyear":2015}]