[{"id":"EJ1285087","title":"Data-Driven Learning of Academic Lexical Bundles below the C1 Level","author":"Lay, Keith J., Yavuz, Mehmet A.","description":"This study investigates the possibility and efficacy of paper-based, in-class, data-driven learning (DDL) of academic lexical bundles below the C1 level of proficiency described by the Common European Framework of Reference (CEFR; advanced high ACTFL). A two-stage experimental design involving three groups (n = 41) and 24 two-to-four word academic items was implemented. First, the question of whether this type of learning works with these items below the C1 level is addressed through a nonequivalent-groups quasi-experimental design covering a five-week period. The results indicate that this technique is effective at the B2 level, but not at the A2-B1 level. Next, an equivalent-groups experimental design compares this style of learning to conventional techniques at the B2 level. The results of this stage suggest that paper-based, in-class DDL is more effective than conventional learning with academic lexical bundles at the B2 level.","subject":"Language Proficiency, Rating Scales, Guidelines, Second Language Learning, Second Language Instruction, Phrase Structure, Comparative Analysis, Academic Language, Teaching Methods, Printed Materials, Cognitive Style, Computational Linguistics, English for Academic Purposes, Instructional Effectiveness, Vocabulary Development, Language of Instruction, Foreign Countries, Native Language, Turkish, Semitic Languages, French, Indo European Languages, Pretests Posttests, Undergraduate Students","source":"Language Learning & Technology","publicationdateyear":2020,"identifiersgeo":"Cyprus"},{"id":"EJ1263066","title":"Beyond the Curriculum: Extended Discourse Practice through Self-Access Pragmatics Simulations","author":"Sydorenko, Tetyana, Jones, Zachary W., Daurio, Phoebe, Thorne, Steven L.","description":"Usage-based linguistics posits that communicative functions, including pragmatics, are at the core of language (Tomasello, 1992). It is surprising, then, that pragmatics is rarely systematically included in second language curricula (e.g., Bardovi-Harlig, 2017), especially since pragmatics instruction has been shown to significantly contribute to pragmatic development (e.g., Taguchi &amp; Roever, 2017). Addressing this issue, the present study investigates learning outcomes and processes in self-access technology-enhanced instructional simulations for pragmatics that do not require classroom or teacher time. Importantly, these simulations include 1.) oral practice of extended discourse and 2.) feedback--two under-explored aspects of pragmatics instruction (e.g., Holden &amp; Sykes, 2013; Sydorenko, Daurio, &amp; Thorne, 2018). Two versions of the self-access simulations were examined: implicit-only instruction (15 participants) and implicit combined with explicit instruction (11 participants). The quantitative analysis of learners' production data and self-reported noticing revealed that both groups were similarly able to extract relevant (but varying) pragmatics features from instruction. The qualitative analysis, however, revealed that individual learner differences may be a critical factor in the effectiveness of implicit versus explicit instruction. The present study also illustrates how time spans and competition between cognitive resources affect pragmatics learning. In sum, this research informs further development of self-access pragmatics materials.","subject":"Teaching Methods, Pragmatics, Independent Study, Language Usage, Second Language Learning, Second Language Instruction, Computer Software, Computer Simulation, Feedback (Response), Oral Language, Comparative Analysis, Individual Differences, Instructional Effectiveness, Best Practices, Advanced Students, College Students, English (Second Language), Language Tests, Metacognition, Language Processing","source":"Language Learning & Technology","publicationdateyear":2020,"identifiersgeo":null}]