[{"id":"EJ1109684","title":"Introducing an M-Commerce Course into the Business Management Curriculum: Experiences and Recommendations","author":"Nandi, Santosh, Nandi, Madhavi L.","description":"Mobility has become an important extension to the business strategies of present-day organizations. Thus, organizations are increasingly seeking managers with knowledge of value chain related to mobile-oriented business activities, usually referred to as mobile commerce (m-commerce). Accordingly, business management schools are interesting in designing their curricula to respond to the need for m-commerce knowledge and, in particular, the scope of the content for an m-commerce course. The general conception of m-commerce is that it is a component of e-business or e-commerce. This paper presents the unique dimensions of m-commerce that makes it stand out as a separate course for postgraduate business management students. This paper also provides input in regard to the design and delivery of the course by drawing upon the recent teaching experience of the authors at a highly respected business school in India. The course design covers mobility-related technology elements as related to business in diverse industry segments and is expected to enable students to develop a suitable mobile strategy for a real-time business scenario. The course content was drawn primarily from research papers, industry reports, and examples of trending mobile applications. The pedagogy was a blend of lectures and classroom exercises on innovative case studies. The response of the students to the course indicated a high degree of satisfaction in regard to its relevance. The inputs provided in this paper are believed to serve as guidance to business management schools that are interested developing such a course.","subject":"Management Development, Business Administration Education, Business Schools, Teaching Experience, Foreign Countries, Telecommunications, Curriculum Design, Graduate Students, Course Descriptions, Industry, Course Content, Teaching Methods, Lecture Method, Case Studies, Student Attitudes, Handheld Devices, Information Technology","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"India"}]