[{"id":"EJ1080783","title":"Symmetrical and Asymmetrical Scaffolding of L2 Collocations in the Context of Concordancing","author":"Rezaee, Abbas Ali, Marefat, Hamideh, Saeedakhtar, Afsaneh","description":"Collocational competence is recognized to be integral to native-like L2 performance, and concordancing can be of assistance in gaining this competence. This study reports on an investigation into the effect of symmetrical and asymmetrical scaffolding on the collocational competence of Iranian intermediate learners of English in the context of concordancing. It also surveys the learners' attitudes towards the role of concordancing and scaffolding in learning L2 collocations. Immediate and delayed posttests were administered to examine the effects of the treatments given over 10 sessions on L2 collocations in the receptive and productive tasks. Results demonstrated that the three groups of participants who received the treatment tasks in the context of concordancing under symmetrical, asymmetrical, and no-scaffolding conditions, improved their knowledge of collocations significantly both in the receptive and productive tasks compared to the control group which had no access to concordancing and did not receive scaffolding. However, there was no significant difference among the performances of the concordancing groups either in the receptive or in the productive tasks. Moreover, learners expressed positive attitudes towards both concordancing and scaffolding.","subject":"Computational Linguistics, Phrase Structure, Scaffolding (Teaching Technique), Foreign Countries, Control Groups, English (Second Language), Second Language Learning, Task Analysis, Student Attitudes, Receptive Language, Pretests Posttests, Role, Expressive Language, Positive Attitudes, Second Language Instruction, Teaching Methods, Qualitative Research, Questionnaires, Likert Scales, College Students, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Iran"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"},{"id":"EJ1047667","title":"Flipping the Classroom for English Language Learners to Foster Active Learning","author":"Hung, Hsiu-Ting","description":"This paper describes a structured attempt to integrate flip teaching into language classrooms using a WebQuest active learning strategy. The purpose of this study is to examine the possible impacts of flipping the classroom on English language learners' academic performance, learning attitudes, and participation levels. Adopting a quasi-experimental design, three different formats for flip teaching were developed in this study. The results indicate that the structured and semi-structured flip lessons were more effective instructional designs than the non-flip lessons. With a varying extent, both the structured and semi-structured flip lessons helped the students attain better learning outcomes, develop better attitudes toward their learning experiences, and devote more effort in the learning process. Given the positive results, this paper concludes with a call for more research into this promising pedagogy to contribute to its knowledge base across disciplines.","subject":"Active Learning, Second Language Learning, Learning Experience, Teaching Methods, Learning Processes, Computer Assisted Instruction, Academic Achievement, Student Attitudes, Quasiexperimental Design, English (Second Language), Second Language Instruction, Foreign Countries, Communicative Competence (Languages), Instructional Effectiveness, Questionnaires, Semi Structured Interviews, Statistical Analysis, Student Participation, College Students, Blended Learning","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]