[{"id":"EJ1063743","title":"Negotiation of Meaning to Comprehend Hypertexts through Peer Questioning","author":"Yang, Yu-Fen, Hsieh, Pei-Yin","description":"Many college students who study English as a Foreign Language (EFL) are less-proficient readers as they have few opportunities to negotiate their perspectives for creating meaning through peer questioning in onsite instruction. This study reports on using online peer questioning to enhance less-proficient college students' negotiation of meaning in comprehending texts. A sample of 50 college students was divided into two groups based on the pre-test, into a more-proficient group and a less-proficient group, with 25 students in each group. The results of this study reveal that the less-proficient students made greater progress in reading comprehension than the more-proficient students after using the strategy of online peer questioning. The less-proficient students were able to explicitly observe how the more-proficient peers used integration questions, agreed or disagreed with peer responses, and finally constructed new understandings of the hypertexts. Particularly, the less-proficient students learned from the more-proficient peers on how to engage in critical thinking to express and share multiple perspectives. Using online peer questioning, both the more-and the less-proficient students frequently engaged in negotiation of meaning, interaction, and teaching one another. Their reading progress was reflected in the post-test, the types of questions and responses, and their perceptions toward using online peer questioning.","subject":"English (Second Language), College Students, Reading Comprehension, Language Proficiency, Blended Learning, Cooperative Learning, Questioning Techniques, Group Discussion, Pretests Posttests, Hypermedia, Statistical Analysis, Computer Mediated Communication, Foreign Countries, Qualitative Research, Semi Structured Interviews","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]