[{"id":"EJ1074890","title":"Computer-Mediated Communication (CMC) in L2 Oral Proficiency Development: A Meta-Analysis","author":"Lin, Huifen","description":"The ever growing interest in the development of foreign or second (L2) oral proficiency in a computer-mediated communication (CMC) classroom has resulted in a large body of studies looking at both the direct and indirect effects of CMC interventions on the acquisition of oral competences. The present study employed a quantitative meta-analytic approach to investigate such effects by synthesizing (quasi)experimental studies that provide empirical quantitative data for effect size calculation. A literature search located 25 relevant studies for the final analysis. Each study was independently coded for learner, design and publication characteristics. The averaged effect size was estimated from the included studies. The results of the meta-analysis reveal that communication mediated by computer\/technologies produced a moderate positive effect on L2 learners' oral proficiency compared to face-to-face (F2F) communication or no interaction. Furthermore, CMC has roughly similar effect on pronunciation, lexical and syntactic level of oral production; however, it might have a negative impact on fluency and accuracy. This meta-analysis also found that the effect of CMC on oral proficiency depends on several methodological factors such as task type, outcome measurement, treatment length, and assessment task. Major findings of the current meta-analysis include: (1) studies relying on elicited data are superior to those utilizing naturalistic data; (2) reading aloud seems to be the task that could elicit the best oral performance from students; (3) surprisingly, CMC appeared to be harmful for accuracy and fluency; (4) studies that employed decision-making generated the largest effect size, followed by studies that used more than one task type; (5) among the four tasks, jigsaw actually generated a negative effect on oral performance; and (6) as the most popular task employed by primary researchers, opinion-exchange studies produced the smallest effect size. These findings need to be interpreted as exploratory rather than confirmatory since each of them became less trustworthy after taking into consideration numerous other factors such as CMC task and the particular CMC tool used, etc. Future research suggestions are provided and the limitations of this meta-analysis are addressed.","subject":"Computer Mediated Communication, Second Language Learning, Oral Language, Language Proficiency, Intervention, Meta Analysis, Quasiexperimental Design, Effect Size, Literature Reviews, Achievement Gains, Data, Reading Aloud to Others, Accuracy, Reading Fluency, Decision Making, Task Analysis, Competence, Statistical Analysis","source":"ReCALL","publicationdateyear":2015},{"id":"EJ1059678","title":"The Influence of Group Formation on Learner Participation, Language Complexity, and Corrective Behaviour in Synchronous Written Chat as Part of Academic German Studies","author":"Fredriksson, Christine","description":"Synchronous written chat and instant messaging are tools which have been used and explored in online language learning settings for at least two decades. Research literature has shown that such tools give second language (L2) learners opportunities for language learning, e.g. , the interaction in real time with peers and native speakers, the written mode of language, and the time available for planning and monitoring utterances. However, since the majority of the empirical work on chat and instant messaging has been conducted under experimental conditions, relatively little research has investigated how interaction in chat influences language learning opportunities under the conditions of an online academic language course where students have unequal status because of their different language background and level of L2 proficiency. This article presents an explorative study of the interaction in chat in a web-based academic language course between students with different L1s and different levels of L2. The aim is to shed light on how student interaction in an institutional context benefits the language learning environment in a manner that promotes L2 learners' attention to linguistic items in their input and output, and that allow opportunities for functional practising. Based on a mainly quantitative analysis, this article illustrates how L2 learners' participation, the complexity of their utterances, and their opportunities for self-correction and corrective feedback are influenced by group formation.","subject":"German, Computer Mediated Communication, Group Dynamics, Second Language Learning, Synchronous Communication, Language Proficiency, Online Courses, Academic Discourse, Native Language, Educational Benefits, Interaction Process Analysis, Linguistic Input, Statistical Analysis, Error Correction, Feedback (Response), Native Speakers, Student Participation","source":"ReCALL","publicationdateyear":2015},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015},{"id":"EJ1074883","title":"Attitudes towards Online Feedback on Writing: Why Students Mistrust the Learning Potential of Models","author":"Strobl, Carola","description":"This exploratory study sheds new light on students' perceptions of online feedback types for a complex writing task, summary writing from spoken input in a foreign language (L2), and investigates how these correlate with their actual learning to write. Students tend to favour clear-cut, instructivist rather than constructivist feedback, and guided self-evaluation through model solutions in online learning environments. However, the former type is too limited to tackle all dimensions of advanced writing. Constructivist feedback, in the form of guided modelling, allows addressing the higher-order concerns involved in summary writing. In addition, it is widely acknowledged that activating the zone of proximal development (ZPD) through cognitive involvement is beneficial to learning. To investigate students' learning from both types of feedback, a one-group pre-post-test intervention study was set up. Students attending a course on summary writing in L2 within a bachelor programme in Applied Languages (n = 38) followed an individual online learning module containing both instructivist fill-the-gap exercises and model solutions with constructivist guiding questions for self-assessment. The students' actual learning gain was measured through pre- and post-tests, and compared with their perceived learning gain, as expressed in self-evaluation. The comparison reveals a dichotomy between the students' observed learning curve and an underestimation of their own progress. This dichotomy was found to originate in a mismatch between their expectations towards the online learning module and the characteristics of the constructivist feedback conveyed. This mismatch can be attributed to three key factors: (1) evaluation, (2) linguistic focus, and (3) learner motivation.","subject":"Feedback (Response), Writing (Composition), Constructivism (Learning), Computer Mediated Communication, Student Attitudes, Writing Attitudes, Second Language Learning, Correlation, Writing Instruction, Trust (Psychology), Models, Undergraduate Students, Bachelors Degrees, Applied Linguistics, Problem Solving, Ability, Cognitive Development, Educational Benefits, Pretests Posttests, Intervention, Electronic Learning, Learning Modules, Writing Exercises, Self Evaluation (Individuals), Comparative Analysis, Learning Motivation, Blended Learning","source":"ReCALL","publicationdateyear":2015}]