[{"id":"EJ1080885","title":"Spoken Grammar Practice and Feedback in an ASR-Based CALL System","author":"de Vries, Bart Penning, Cucchiarini, Catia, Bodnar, Stephen, Strik, Helmer, van Hout, Roeland","description":"Speaking practice is important for learners of a second language. Computer assisted language learning (CALL) systems can provide attractive opportunities for speaking practice when combined with automatic speech recognition (ASR) technology. In this paper, we present a CALL system that offers spoken practice of word order, an important aspect of Dutch grammar. The system uses ASR technology to process the learner's responses and to detect errors so that immediate corrective feedback (CF) can be provided on learner errors. We evaluate the system as a learning environment by analyzing proficiency gains in pre- and post-tests, the logs of the practice sessions, and the learners' appreciation of the system. In this paper, we present two learning conditions: (1) the learners received oral practice and immediate CF on spoken performance and (2) learners received oral practice and NO CF on spoken performance. We found that our system was successful in providing L2 speaking practice. Results show that both groups improve their proficiency on the target feature as a result of treatment. Between the groups there is no significant difference in learning, but the groups proceeded differently through the sessions, and the learners in the group that received automatic CF evaluated the system more positively than the NO CF group. We discuss the performance of the system as an environment for language learning and the obtained proficiency test results, and relate them to current views on second language acquisition.","subject":"Grammar, Computer Assisted Instruction, Feedback (Response), Error Correction, Language Proficiency, Pretests Posttests, Oral Language, Second Language Learning, Indo European Languages, Second Language Instruction, Language Tests, Task Analysis, Adult Students, Video Technology, Foreign Countries, Likert Scales, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1051461","title":"Developing a Multimedia Instrument for Technical Vocabulary Learning: A Case of EFL Undergraduate Physics Education","author":"Rusanganwa, Joseph Appolinary","description":"The aim of the present study is to investigate the process of constructing a Multimedia Assisted Vocabulary Learning (MAVL) instrument at a university in Rwanda in 2009. The instrument is used in a one-computer classroom where students were taught in a foreign language and had little access to books. It consists of video clips featuring images, sound and text intended to facilitate learning and retention of technical vocabulary in a first-year electricity course. The construction takes theories of social constructivism and learning with multimedia as its point of departure. In response to the need for knowledge of scientific vocabulary, the researcher collaborated with a group of 82 students and their two teachers to select and encode 81 video clips of technical terminology. The gains from the process of constructing the instrument enabled collaborative and interdisciplinary learning and showed the potential to facilitate technical vocabulary acquisition.","subject":"Vocabulary Development, Second Language Learning, Multimedia Materials, Video Technology, Interdisciplinary Approach, Foreign Countries, Physics, English (Second Language), Energy, Introductory Courses, Cooperative Learning, Constructivism (Learning), Learning Theories, Undergraduate Students, Computer Assisted Instruction","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Rwanda"}]