[{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1077753","title":"Teaching Social Media Analytics: An Assessment Based on Natural Disaster Postings","author":"Goh, Tiong T., Sun, Pei-Chen","description":"Unstructured data in social media is as part of the &quot;big data&quot; spectrum. Unstructured data in Social media can provide useful insights into social phenomena and citizen opinions, both of which are critical to government policy and businesses decisions. Teachers of business intelligence and analytics commonly use quantitative data from sales, marketing, finance and manufacturing to demonstrate various analytics concepts in a business context. However, researchers have seldom used social media data to analyze social behavior and communication. In this study we aim to demonstrate an assessment structure for teaching social media analytics concepts with the goal of analyzing and interpreting social media content. We base this assessment on forum postings regarding two recent events: the Christchurch earthquake in New Zealand, and the Japanese earthquake and tsunami. The aim of the assessment is to discover social insights. We base the assessment structure on Cooper's Analytics Framework to cover such concepts as term frequency (TF), term frequency-inverse document frequency (TFIDF), data visualization, sentiments and opinions analysis, the Nearest Neighbor K-NN classification algorithm, and Information Diffusion theory. We review how the students performed on the assignment that used this assessment, and we make recommendations for future studies.","subject":"Foreign Countries, Social Media, Data Analysis, Natural Disasters, Visualization, Word Frequency, Content Analysis, Opinions, Information Theory, Social Behavior, Undergraduate Students, Educational Benefits, Business, Intelligence, Web Sites, Discourse Analysis, Altruism, Emotional Response, Computer Mediated Communication, Affective Behavior, Classification, Information Dissemination, Scores","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Japan, New Zealand"},{"id":"EJ1121042","title":"Professional Attitudes of the Teachers in Implementation of a School-Based Programme about Prevention of the Use Psychoactive Substances in 5-7 Grade","author":"Kozhuharova, Penka Petkova","description":"The subject of the research is the planning, implementation and evaluation of the program about prevention of the use of psychoactive substances among students 5-7 grade. The study was conducted by survey method with 314 teachers who teach in twenty-six schools. The qualification of the teachers to work with the program about prevention was studied in the lesson of the class. We studied the forms, through which the preventive activity, topicality, the methods used and course curricula for hours in individual classes were implemented. It was found that there was an interaction between the various recipients of the preventive activity. The preparation and qualification of the teachers to work on a program for the prevention of the use of alcohol and tobacco products was studied in the lesson of the class. We pointed out some problematic aspects and guidelines for development of the preventive activity.","subject":"Foreign Countries, Secondary School Students, Grade 5, Grade 6, Grade 7, Secondary School Teachers, Teacher Attitudes, Program Implementation, Program Evaluation, Prevention, Drug Abuse, Health Education, Teacher Surveys, Drinking, Smoking, Educational Planning, Likert Scales, Risk, Teaching Methods, Partnerships in Education","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bulgaria"},{"id":"EJ1120923","title":"Study of Emotional Intelligence Patterns with Teachers Working in Public Education","author":"Balázs, László","description":"The data necessary for the empirical research presented it this study were provided by 572 people, from altogether 26 schools. The schools included 18 primary schools, 7 secondary training institutions and 1 primary and secondary school. The major question of the study related to the pedagogues' emotional intelligence, more precisely if the teachers of different institutions showed any individual differences in their emotional intelligence patterns according to the given type of their school's organisational culture. We also examined if the nature of the organizational culture had any influence on the development of the individual's emotional intelligence pattern. On the basis of the results we can declare that the teachers of different institutions having their own particular organizational cultures evolve different emotional intelligence patterns. Accordingly, we can come to the conclusion that in the long term the organizational culture affects the evolution of the individual's emotional intelligence pattern and vice versa.","subject":"Foreign Countries, Emotional Intelligence, Elementary School Teachers, Secondary School Teachers, Individual Differences, Organizational Culture, Hypothesis Testing, Questionnaires, Measures (Individuals), Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121048","title":"Towards a Methodology to Identify a Talent by Using Psychological Cognitive Prototyping","author":"Hammer, Matthijs H. M.","description":"Since education became an important aspect of society, teachers have a prelove for highly talented students. Especially young talented people relish profound attention of universities, firms, music ensembles, sports societies and artist groups. In higher education, students are encouraged to develop their unique strong point, named as talents. Around the globe, universities, institutes of higher and professional education provide students with programs for talent development and exploitation. Practitioners and educators complain on a regular basis that students rarely aware of what their talents are. It is experienced as difficult to identify them. This paper explores the possibility for mechanisms to identify, or recognize, a talent. Scholars and consultants developed many instrument on the development and exploitation of talents. But how can talents be identified? In this paper the fuzzy front end of talent recognition will be fostered. It is advocated that the psychological cognitive prototyping principles can be applied to identify the prototype of a talent.","subject":"Talent Identification, Psychomotor Skills, Psychological Patterns, Individual Characteristics, Academically Gifted, Foreign Countries, Models, Cognitive Ability, Group Discussion, Undergraduate Students, Maturity (Individuals)","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1121024","title":"Tutoring and Mentoring: An A.R.C. Model for Future Teachers: Affective, Reflexive and Cognitive Orientation to Self-Regulated Learning","author":"Remy, Philippe","description":"With a specific focus on tutoring among future teachers this article proposes a model of self-regulated learning. The focus on different mechanisms inherent to the tutoring relationship will consider Affective impacts or motivation, Reflexive or metacognitive and Cognitive resolutions. The ARC combination proposes that personal skills will be gained and beneficial transfers into the class will be possible. This approach with a model considers explicit learning as a part of tutoring relationship successes. A prospective study on a short scale provides a few indicators in this direction and will be followed by a mentoring study. As private companies also present services in the shadow of the official educational system some recommendations will illustrate the tutoring original pedagogical relation with specific limits and the potential for new understanding.","subject":"Tutoring, Mentors, Motivation, Preservice Teachers, Learning Processes, Qualitative Research, Interviews, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120994","title":"Mental Hygienic Aspects of Animal Assisted Education","author":"Takács, István, Szalai, Katalin","description":"The Institution for Special Education at the Faculty of Pedagogic of the University of Kaposvár has been engaged in animal assisted activities for about three years. Our most recent research program was conducted for over two month in the Spring of 2014 with the involvement of 66 children--all kindergarten and elementary school age--11 special educators, physicians, psychologists, special educators, teachers, and ethologists. The primary focus of our research was the development (and examination) of memory; however, observations with ethological and mental hygiene angles were a natural segment of our work. A significant part of the observations pointed to factors that both the children and their educators have experienced: the acceptance of each other, an increased level of tolerance, and an increased attention level towards the partner (human and animal). The teachers gave account of their respective observations in a small conference at the end of the last school year. Researches were offered a glimpse into the unique world of the relationship between a part of &quot;living nature&quot;--the pygmy rabbit in our case--and humans. During the 12 sessions of the training our colleagues have made observations that could serve as basis for a new system of paradigms of animal assisted pedagogics in the future. Our experience can also be re-considered with aspects of remedial pedagogics: we are convinced that animal assistance can become an accentuated part of the care of children and students with impairments. This is also implied by the fact that preparatory works for the continuation of this research at a kindergarten and at a school are already in progress.","subject":"Foreign Countries, Educational Research, Mental Health, Pilot Projects, Control Groups, Experimental Groups, Ethology, Animal Behavior, Ecology, Early Childhood Education, Educational Practices, Observation, Interaction Process Analysis, Qualitative Research, Children, Intelligence Tests","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121051","title":"Talent Support at Kaposvár University, Faculty of Pedagogy","author":"Bencéné-Fekete, Andrea","description":"The shared aim of the professors working at the Faculty of Pedagogy is to help their students find the field, in which they are able to show extraordinary achievements. They help the students recognize what they are talented in and provide them the necessary support to act on this field. The talented students are most often helped by pedagogues; however, no one deals with the issue of pedagogues, who are talented and fulfill their jobs on the highest level. At Kaposvár University, Faculty of Pedagogy a three-step talent support program--based on the Czeizel-talent model--and mentorship for talented pedagogues have been introduced. During the sessions of Csokonai Student Talent Support Program each student is granted with the possibility to participate in research method lectures, rhetoric and personal development trainings and sessions how to create presentations. This new, three-step method has initiated cooperation in professional questions among not only students, but also pedagogues on our faculty.","subject":"Foreign Countries, Talent Development, Mentors, Preservice Teachers, Preservice Teacher Education, Talent Identification","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"}]