[{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1137339","title":"Why Phishing Works: Project for an Information Security Capstone Course","author":"Pollacia, Lissa, Ding, Yan Zong, Yang, Seung","description":"This paper presents a project which was conducted in a capstone course in Information Security. The project focused on conducting research concerning the various aspects of phishing, such as why phishing works and who is more likely to be deceived by phishing. Students were guided through the process of conducting research: finding background and related work on the topic, determining the hypothesis, development of the survey system, data collection, analysis of the results, and writing of the academic paper. This project was very successful in that students gained in-depth knowledge about phishing, developed an understanding of research and academic writing, and learned to statistically analyze data to support or refute their hypothesis. Educators who are teaching a capstone course in Information Security may be interested in this project because it is an appropriate level for undergraduate seniors, it can be accomplished in one semester, and the participants can be other students at the institution.","subject":"Information Security, College Seniors, Research Projects, Student Research, Research Methodology, Research Papers (Students), Research Skills, Writing Skills, Skill Development, Statistical Analysis, Hypothesis Testing, Library Research, Web Sites, Electronic Mail, Surveys, Test Construction, Student Developed Materials","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137140","title":"Student Engagement: The Core Model and Inter-Cohort Analysis","author":"Davis, Christopher J., Kmetz, Karla","description":"Prior research in higher education shows that engagement has been inconsistently conceptualized: semantic inconsistency has been compounded by variations in the constructs used to operationalize engagement. Acknowledging these limitations, we conceptualize student engagement as a multi-faceted meta-construct, overcoming some of the limitations evident in prior studies. This supports a research design that enables us to tap the capacity of the LMS at our institution to operationalize the constructs that undergird the Bundrick et al (2014) model. Our inter-cohort analysis reveals significant variations in individuals' engagement with the on-line course. Our findings suggest that interactions among the primary elements of the learning environment--the student, the teacher, and the content--significantly affect engagement and student outcomes. Our findings also suggest an urgent need to deepen investigation of student engagement to more fully investigate the dynamics of interaction as on-line learning environments account for an increasing proportion of higher education.","subject":"Learner Engagement, Models, Cohort Analysis, Electronic Learning, Integrated Learning Systems, Research Design, Online Courses, Educational Environment, Outcomes of Education, Undergraduate Students, Assignments, Data Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Florida (Saint Petersburg)"},{"id":"EJ1137391","title":"Addressing the 21st Century Paradox: Integrating Entrepreneurship in the Computer Information Systems Curriculum","author":"Lang, Guido, Babb, Jeffry","description":"The Computer Information Systems (CIS) discipline faces an identity crisis: although demand for CIS graduates is growing, student enrollment is either in decline, or is at least soft or flat in many cases. This has been referred to as the 21st century paradox. As one solution to this problem, we propose to integrate entrepreneurship in the CIS curriculum. An analysis of N = 253 universities in the United States finds that only 39.5% offer both CIS and entrepreneurship degrees. Large, private, research-oriented universities were found to be most likely to offer both degrees. A follow-up qualitative analysis of eight ABET accredited IS programs in business schools that also offer a full-time entrepreneurship degree finds that only one university gives students the option to take one entrepreneurship class as part of their IS major. We propose to infuse entrepreneurship in CIS classes based on the lean startup methodology and offer a learn-build-measure feedback loop, along with open source software and agile development practices, as a pedagogical framework for instructors. The paper concludes with a discussion of how entrepreneurship in the CIS curriculum creates graduates that are better prepared to enter the job market.","subject":"Entrepreneurship, Computer Science Education, Information Systems, College Curriculum, Integrated Curriculum, Business Administration Education, Universities, Qualitative Research, Accreditation (Institutions), Business Schools","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137358","title":"Assessing Cyberbullying in Higher Education","author":"Kamali, Ali","description":"This project aims to expose information educators to various aspects of cyberbullying for the purpose of policy development in an environment of higher education. The preponderance of nation-wide research on cyberbullying is concentrated on adolescents; such efforts in college campuses are limited to individual endeavors. Cyberbullying research on college campuses lacks a unified definition of the concept. Although the states mandated most school districts to develop and enact some sort of policy, the law is silent on the college level cyberbullying. According to the literature, &quot;cyberbullying&quot; is reserved for adolescents; however, &quot;cyber-harassment&quot; or &quot;cyberstalking&quot; are related to adults. While cyberbullying shares with conventional bullying intimidation, aggression, and harm, it is unique because (1) the encounter is not face-to-face; (2) the perpetrator can employ varied means (e.g., cellphones, texts, blogs, Internet, social media, etc.); and (3) the act can be undisclosed. The data was collected from a random sample of 511 students (out of a student population of approximately 6,000) in a Midwestern town by employing self-administered questionnaire. It was found that engagement with different social network groups and online communications with those with questionable identity are good predictor of increased vulnerability to the risks of being victimized. The data suggests being victimized leads to victimization. Although males differ from females in terms of the type and the extent of cyberbullying, no significant difference was found among the categories of student status or their class ranks.","subject":"Higher Education, College Students, Bullying, Computer Mediated Communication, Adolescents, Social Media, Telecommunications, Questionnaires, Predictor Variables, Victims, At Risk Persons, Gender Differences, Hypothesis Testing, Statistical Analysis, Student Characteristics","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137356","title":"Adding Value: Online Student Engagement","author":"Everett, Donna R.","description":"This paper seeks to add to the emerging literature related to online student engagement with additional suggestions for instructional strategies. Student engagement is one of the tenets of effective online instruction; as such, particular attention to how it adds value to student learning is crucial and worth the time and effort to enhance learning outcomes. What strategies and technology enhance student engagement and add value to student learning? Continuing research into online student engagement strategies is needed to add value to student learning.","subject":"Learner Engagement, Educational Strategies, Web Based Instruction, Online Courses, Electronic Learning, Value Added Models, Outcomes of Education, Educational Technology, Computer Mediated Communication, Synchronous Communication, Asynchronous Communication","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077597","title":"Pedagogical Applications of Social Media in Business Education: Student and Faculty Perspectives","author":"Piotrowski, Chris","description":"There has been wide academic and research interest in the application of social media modalities, as pedagogical tools, in higher education. Recent research indicates that business-related topics are a major focus of study on this emerging educational issue. Yet a systematic review of outcome studies regarding instructional Web 2.0 adaptations in business education has not appeared. To chart, the contemporary landscape of scholarly research in this area, the current study (a) identified, based on a keyword search in the &quot;ProQuest&quot; database, the key empirically based studies on the business education-social media nexus and (b) summarized the major findings of a subset of these studies (n?=?11) with a focus on views of business students and faculty. The main social media tools used in instruction were Facebook, blogs, Twitter, and YouTube. Although a majority of studies reported positive attitudes by students regarding academic applications of Web 2.0 technologies, faculty views were more tepid and reserved. Transgression of &quot;socializing&quot; during academic interactivity, privacy issues, and data overload were the major drawbacks noted by students. Faculty were most concerned about the vast breadth of social media modalities and the lack of training support in emerging interactive-mobile technology. Future research needs to address the views of business school administrators on educational adaptation of Web 2.0 tools.","subject":"Social Media, Business Administration Education, Student Attitudes, Teacher Attitudes, Higher Education, Web 2.0 Technologies, College Students, Online Searching, Computer Oriented Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137398","title":"Course Redesign Based on the Quality Matters Program: Examples of Before and After","author":"Kreie, Jennifer, Bussmann, Susan","description":"Most universities continue to expand their online course offerings because there is strong demand for such educational opportunities. However, the quality of instruction for online courses continues to be a concern. The Quality Matters (QM) Program provides a set of research-based standards that can guide the redesign of a course and can be used as a rubric to evaluate a course. This paper shows the transition of one course as it was redesigned based on the QM standards. Specific examples of &quot;before&quot; and &quot;after&quot; content are shown along with discussion of the changes made and some design issues encountered. Feedback from students midway through the first semester using the redesigned course is presented.","subject":"Online Courses, Educational Quality, Curriculum Design, Standards, Course Content, Information Systems, Business Administration Education, Computer Science Education, College Curriculum, Behavioral Objectives, College Students, Feedback (Response), Student Surveys","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137369","title":"The Information Systems Core: A Study from the Perspective of IS Core Curricula in the U.S.","author":"Hwang, Drew, Ma, Zhongming, Wang, Ming","description":"To keep up with technology changes and industry trends, it is essential for Information Systems (IS) programs to maintain up to date curricula. In doing so, IS educators need to determine what the IS core is and implement it in their curriculum. This study performed a descriptive analysis of 2,229 core courses offered by 394 undergraduate IS programs in the United States. The result presents a panoramic snapshot of the IS core in the nation from the perspective of IS core curricula. By mapping those core courses to the most recent IS model curriculum, IS 2010, this study also reports how many IS programs offer each of the seven core courses in IS 2010. Moreover, these core courses were examined from three different perspectives: school type, accreditation, and research orientation.","subject":"Information Systems, Core Curriculum, Computer Science Education, Undergraduate Study, College Curriculum, Institutional Characteristics, Accreditation (Institutions), Orientation, College Programs, Standards, Web Sites","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137393","title":"Engaging Engineering and Information Systems Students in Advocacy for Individuals with Disabilities through a Disability Film Media Project","author":"Lawler, James, Iturralde, Val, Goldstein, Allan, Joseph, Anthony","description":"College curricula of engineering and information systems do not afford frequent engagement with individuals with disabilities. The authors of this research study analyzed the benefits of disability films for a community film festival of largely engineering and information systems students and individuals with developmental and intellectual disabilities. The authors learned that disability film media enables discernable engagement and advocacy of the students for the rights of individuals with disabilities. The authors also learned that the disability film media facilitates engagement and self-advocacy of the individuals for themselves. This study will be beneficial to instructors in engineering and information systems, and instructors in liberal arts, evaluating film media as an exciting method for involving students with individuals with disabilities on multidisciplinary projects of public service.","subject":"Engineering Education, Computer Science Education, Information Systems, Advocacy, Films, Developmental Disabilities, Intellectual Disability, Student Projects, Interdisciplinary Approach, College Students, Focus Groups, Participation, Self Advocacy, Likert Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"New York (New York)"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1137146","title":"Incorporating a Human-Computer Interaction Course into Software Development Curriculums","author":"Janicki, Thomas N., Cummings, Jeffrey, Healy, R. Joseph","description":"Individuals have increasing options on retrieving information related to hardware and software. Specific hardware devices include desktops, tablets and smart devices. Also, the number of software applications has significantly increased the user's capability to access data. Software applications include the traditional web site, smart device applications and web pages that emulate apps on mobile devices. The importance of high user satisfaction is critical as users will switch quickly to other devices or sources for their information needs. To assist in developing high impact and positive user satisfaction are the theories from the field of study known as Human Computer Interaction (HCI). This research summarizes several of the key theories from HCI and recommends the placement of learning modules related to HCI in current software development courses as well as proposing an updated standalone HCI course into MIS and CIS curriculums.","subject":"Computer Science Education, Man Machine Systems, Computer Software, Curriculum Development, Information Systems, Management Systems, Computer System Design, Course Content, Models, Core Curriculum","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084380","title":"The Writer's Individualized Transfer Tool: A Freeware Innovation for Fostering and Researching Transfer of Writing Skills and Knowledge","author":"Khost, Peter H.","description":"Most higher education institutions lack a program that promotes students' transfer--that is, reapplication or repurposing--of writing skills and knowledge across the curriculum, a phenomenon that research shows does not tend to happen without deliberate sustained support. This article introduces an online instrument, the Writer's Individualized Transfer Tool, which the author invented to intervene in this area as a supplemental or provisional effort, using freeware to foster and research students' writing transfer from first-year composition to other courses and potentially beyond. The article reviews relevant scholarship on transfer in writing, describes and illustrates Writer's Individualized Transfer Tool's design, provides instructions for the tool's implementation and usage, reviews some results from a pilot study of an application of the tool in an first-year composition curriculum, and discusses related issues requiring further consideration.","subject":"Freshman Composition, Writing Skills, Computer Software, Writing Across the Curriculum, Transfer of Training, Metacognition, Program Implementation, Pilot Projects, Outcomes of Education, Writing Instruction, Student Surveys","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1077591","title":"A Job Announcement Analysis of Educational Technology Professional Positions: Knowledge, Skills, and Abilities","author":"Kang, YoungJu, Ritzhaupt, Albert D.","description":"The purpose of this research was to identify the competencies of an educational technologist via a job announcement analysis. Four hundred job announcements were collected from a variety of online job databases over a 5-month period. Following a systematic process of collection, documentation, and analysis, we derived over 150 knowledge, skill, and ability statements from the job announcements themselves based on a conceptual framework. We coded the frequency to which the competencies occurred in each announcement and summarized the results meaningfully in our article. Results suggest educational technologists must be competent in multiple areas, but especially in instructional design, project management, technical skills, and soft skills. Results provide compelling evidence that educational technology professionals must work with a wide variety of stakeholders in their work. The findings of our research are relevant to professionals, professional associations, and academic programs interested in competencies. A discussion for the results is provided.","subject":"Educational Technology, Competence, Occupational Information, Job Analysis, Coding, Instructional Design, Program Administration, Job Skills, Skill Analysis, Employment Qualifications, Educational Background, Ability Identification","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113945","title":"The Impact of the Introductory IS Course on Students' Perceptions of IS Professionals","author":"Akbulut, Asli Yagmur","description":"Increasing the number of students pursuing Information Systems (IS) majors and careers is vital to the advancement of our knowledge-based economy. Literature suggests that one of the main reasons for students' lack of interest in IS has been the negative stereotypical image of IS professionals. Research has also emphasized that the introductory IS course plays a significant role in busting prevailing myths about the IS profession and in attracting larger pools of students to the discipline. Therefore, the purpose of this study was to understand students' perceptions of IS professionals before and after they were exposed to the IS field and careers through the introductory IS course. The findings suggest that students' image of IS professionals might not be as negative as previously thought. Furthermore, the study confirms the importance of the introductory IS course on how students view the IS field. The paper concludes with a discussion of the findings, implications, limitations, and future research directions.","subject":"Undergraduate Students, Business Administration Education, Introductory Courses, Information Systems, Student Attitudes, Professional Personnel, Stereotypes, Majors (Students), Nonmajors, Psychometrics, Attitude Change, Computer Science Education, Likert Scales, Student Surveys","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098519","title":"The Determinants of Student Effort at Learning ERP: A Cultural Perspective","author":"Alshare, Khaled A., El-Masri, Mazen, Lane, Peggy L.","description":"This paper develops a research model based on the Unified Theory of Acceptance and Use of Technology model (UTAUT) and Hofstede's cultural dimensions to explore factors that influence student effort at learning Enterprise Resource Planning (ERP) systems. A Structural Equation Model (SEM) using LISREL was utilized to validate the proposed research model using a convenience sample of students at two universities in the USA. The results showed that while subjective norm and career relevance were positively associated with performance expectancy (PE), course structure and self-efficacy were positively associated with effort expectancy (EE). Performance expectancy and effort expectancy were positively associated with student attitude toward ERP. Student attitude toward ERP was positively associated with student effort at learning ERP. The results also revealed that power distance, uncertainty avoidance, and masculinity moderate the relationships between EE and PE on one side and attitude on the other side, between EE and PE, and between attitude and effort at learning ERP, respectively. Implications for educators and researchers are reported.","subject":"Management Information Systems, Adoption (Ideas), Models, College Students, Structural Equation Models, Student Behavior, Self Efficacy, Student Attitudes, Relevance (Education), Course Organization, Power Structure, Anxiety, Masculinity, Behavior Standards, Social Behavior, Student Surveys, Questionnaires, Factor Analysis, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113944","title":"Social Representations of Cybersecurity by University Students and Implications for Instructional Design","author":"Pawlowski, Suzanne D., Jung, Yoonhyuk","description":"Cybersecurity has become an essential topic in introductory information systems (IS) core courses. As an aid to course design, the exploratory research in this paper uses a social representations lens to elucidate the perceptions of cybersecurity and cybersecurity threats held by students. Analysis of qualitative survey data from 152 students at a university in the Western U.S. identified 23 concepts forming the students' collective understanding of cybersecurity. Presented in the form of a social representations map, the findings reveal student perspectives that can be used to motivate and enhance learning about cybersecurity threats and mitigation strategies. Interpretation of the map indicates that students' sensemaking about cybersecurity places the strongest emphasis on technological concepts and socio-political concerns. In contrast, potential cybersecurity threats to national critical infrastructure are only minimally represented. The survey also examined students': (a) level of concern about different cybersecurity threats; (b) perceived likelihood they will experience given computer security incidents; and (c) incidents they have already experienced. Instructors of introductory IS courses can utilize the study findings to motivate student interest by building upon topics currently evident in the representation\/frame of reference and increase student awareness and attention to cybersecurity threats that are missing. Suggested instructional design approaches, tailored to the level of awareness\/prior knowledge and concern indicated include: (1) a problem-centered approach for topics related to personal cybersecurity; (2) demonstrating relevance and utilizing case studies for topics on organizational cybersecurity; and (3) collaborative, guided discovery to raise awareness about national security\/critical infrastructure cybersecurity threats and protections.","subject":"Information Security, Information Science Education, Information Systems, Qualitative Research, Student Surveys, Student Attitudes, Learning Motivation, Introductory Courses, Undergraduate Students, Instructional Design, Teaching Methods, Consciousness Raising, National Security, Case Studies, Cooperation, Content Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077611","title":"Designing for Game-Based Learning: The Effective Integration of Technology to Support Learning","author":"Alaswad, Zina, Nadolny, Larysa","description":"The use of games and game structures in educational contexts is growing in popularity. An increasing number of technologies have been developed to meet the needs of designing a course as a game. This article discussed the design process in game-based learning and reviewed the research on structuring a course with a focus on feedback, goals, and interaction. In addition, we presented the best practices and technologies to support the integration of badges and leaderboards into game-based learning. With the intentional and systematic design of game-based learning, instructors and designers will increase the impact of game attributes and elements on student achievement and motivation. Further investigation of game-based learning attributes and elements is needed to provide detailed knowledge on the compatibility with current technological tools.","subject":"Instructional Design, Educational Games, Technology Integration, Best Practices, Feedback (Response), Objectives, Interaction, Motivation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1077607","title":"Regression from Game-Oriented to Traditional School","author":"Westin, Thomas, Wiklund, Mats, Mozelius, Peter, Norberg, Lena","description":"Pupils in Sweden are socialized in commercial off-the-shelf games, and, therefore, game-oriented formal education can constitute a foundation for further socialization of pupils excluded in school. However, digital illiteracy and traditional views among school staff forced a regression from the game-oriented formal trial education in this study back to the traditional education form. Research questions were as follows: How did the pupils act upon the consequences of the regression? How can these acts inform the design of education in digital culture? These questions were addressed using ethnography over 3 years. The pupils' acts differed depending on their socialization in school and in games. While the game-oriented formal education included all in the socialization process, the regression caused half of the pupils to drop out. The pupils' acts are discussed with a conceptual framework. Conclusions show the need for digital literacy and understanding pupils' perspectives on education among school staff.","subject":"Foreign Countries, Secondary School Students, Games, Conventional Instruction, Socialization, Educational Change, Ethnography, Dropouts, Longitudinal Studies","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Sweden"},{"id":"EJ1077628","title":"Individual Differences in Digital Badging: Do Learner Characteristics Matter?","author":"Fanfarelli, Joseph R., McDaniel, Rudy","description":"Badge use has rapidly expanded in recent years and has benefited a variety of applications. However, a large portion of the research has applied a binary &quot;useful&quot; or &quot;not useful&quot; approach to badging. Few studies examine the characteristics of the user and the impact of those characteristics on the effectiveness of the badging system. This study takes preliminary steps toward that cause, examining the effectiveness of a badging system across two web-based university courses in relation to the individual differences of the learners. Individual differences are examined through the lens of Long-Dziuban reactive behavior types and traits. Results revealed differences in badge effectiveness that were dependent upon students' Long-Dziuban categorization. Student engagement, intrinsic motivation, reflective and integrative learning, and higher order learning were the constructs most dependent upon categorization. Additional results and their implications are discussed within.","subject":"College Students, Recognition (Achievement), Individual Differences, Student Characteristics, Online Courses, Electronic Learning, Program Effectiveness, Personality Traits, Student Motivation, Classification, Emotional Response, Personality Measures, Distance Education, Aggression, Statistical Analysis, Correlation, Behavior Patterns","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Florida"},{"id":"EJ1084414","title":"Teaching Adult Learner Characteristics and Facilitation Strategies through Simulation-Based Practice","author":"Speed, Sally A., Bradley, Elizabeth, Garland, Krista Vince","description":"This article relates a project in which a curriculum module was developed to help graduate students more effectively manage behaviors of adults in facilitation sessions. The module was piloted in the project and later included in a graduate level course in the Creative Studies Department of SUNY Buffalo State. The curriculum identified characteristics of adult learners and behaviors that manifest from those characteristics and helped Creative Studies graduate students develop strategies to manage such behaviors in facilitation sessions. The module included practice sessions for facilitation using TeachLivE™, a mixed reality simulation that offers education students practice in classroom management with avatars to enhance their teaching skills. Results indicated that students felt they were more capable of managing adult learner behaviors and more confident and effective in facilitations as a result of the module and TeachLivE™ simulation.","subject":"Adult Learning, Graduate Students, Learning Modules, Computer Simulation, Classroom Techniques, Experiential Learning, Quasiexperimental Design, Pilot Projects, Curriculum Development, Student Educational Objectives, Feedback (Response), Longitudinal Studies, Pretests Posttests, Likert Scales, Student Surveys, Program Effectiveness, Data Analysis, Qualitative Research, Statistical Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1077752","title":"American Association of University Women: Branch Operations Data Modeling Case","author":"Harris, Ranida B., Wedel, Thomas L.","description":"A nationally prominent woman's advocacy organization is featured in this case study. The scenario may be used as a teaching case, an assignment, or a project in systems analysis and design as well as database design classes. Students are required to document the system operations and requirements, apply logical data modeling concepts, and design an appropriate data structure for a relational database. The case focuses on a membership administration system with several extended components to keep track of entities such as the Board of Directors and branch committees. The case has been used successfully in the classroom at both individual and group levels. Feedback from students and instructors who have utilized the case indicate that it is an effective instrument that provides a realistic illustration of real-world data modeling without being unreasonably complex. Teaching notes and a suggested solution including data flow diagrams, an entity-relationship diagram (ERD), and a data dictionary are available through the JISE web site.","subject":"Advocacy, Case Method (Teaching Technique), Womens Studies, Community Organizations, Systems Analysis, Database Design, Operations Research, Assignments, Learning Activities, Units of Study, Instructional Design, Business Administration, Business Administration Education, Professional Associations","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109690","title":"Examining Learning Styles and Perceived Benefits of Analogical Problem Construction on SQL Knowledge Acquisition","author":"Mills, Robert J., Dupin-Bryant, Pamela A., Johnson, John D., Beaulieu, Tanya Y.","description":"The demand for Information Systems (IS) graduates with expertise in Structured Query Language (SQL) and database management is vast and projected to increase as &quot;big data&quot; becomes ubiquitous. To prepare students to solve complex problems in a data-driven world, educators must explore instructional strategies to help link prior knowledge to new knowledge. This study examined learning styles and the perceived benefits of analogical problem construction on SQL knowledge acquisition. The data collected from 80 participants suggests there is a perceived positive benefit to using analogical problem construction for learning introductory database concepts. The learning style of the majority of students in the sample is &quot;Active-Sensing-Visual-Sequential.&quot; However, learning styles were not related to student perceived impact of analogical problem construction to understand database concepts. Student analogies were collected for a variety of SQL concepts; noteworthy examples are highlighted. While results related to learning styles are intriguing, the most promising path for further exploration (for both research and practice) is the use of analogy problem construction in Information Systems educational environments.","subject":"Cognitive Style, Databases, Information Systems, Information Science, Problem Solving, Teaching Methods, Prior Learning, Student Attitudes, Concept Formation, Transfer of Training, Logical Thinking, College Students, Questionnaires, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077768","title":"The Impact of Student Expectations in Using Instructional Tools on Student Engagement: A Look through the Expectation Disconfirmation Theory Lens","author":"Schwarz, Colleen, Zhu, Zhiwei","description":"With increasing class sizes, faculty have increasingly been using online homework software (OHS) and in-person discussion groups as the classroom evolves. We sought to determine the effect of online homework software and in-person discussion groups on student engagement. Specifically, we posited that expectations influence this relationship, and we applied Expectation Disconfirmation Theory (EDT) to determine whether a student's expectations about discussion groups or OHS impacts Student Engagement. Moreover, with EDT, we assessed whether these impacts are direct. Our results indicate that if instructors facilitate the development of expectations when students work in groups in a class, the student's level of group satisfaction in addition to engagement in the course will be positively influenced. However, the findings indicate that OHS exerts differing effects. When instructors focus on developing realistic expectations about the OHS used in class they will achieve greater satisfaction with the technology. This satisfaction with the technology will then lead to student engagement in the course. This exploratory study, in spite of a few limitations, demonstrates the importance of managing expectations in the classroom, and its impact on current educational tools. The study also identifies additional research questions on expectation management relating to student engagement that would reduce the impact of these limitations.","subject":"Learner Engagement, Expectation, Computer Uses in Education, Computer Software, Homework, Discussion Groups, Student Satisfaction, Structural Equation Models, Student Surveys, Undergraduate Students","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1072621","title":"Bringing Business Intelligence to Health Information Technology Curriculum","author":"Zheng, Guangzhi, Zhang, Chi, Li, Lei","description":"Business intelligence (BI) and healthcare analytics are the emerging technologies that provide analytical capability to help healthcare industry improve service quality, reduce cost, and manage risks. However, such component on analytical healthcare data processing is largely missed from current healthcare information technology (HIT) or health informatics (HI) curricula. In this paper, we took an initial step to fill this gap. We investigated the current HIT educational programs, BI industry, and healthcare BI job listings, and students' perceptions of BI and how BI could be incorporated into HIT programs. The student survey results showed strong interests from students in a HIT course containing BI components or a BI course specialized in the healthcare context. Based on the student survey and investigation of BI industry and job market, as well as HIT educational programs, we developed a general curriculum framework and exemplar implementation strategies to demonstrate how BI can be incorporated into an HI or HIT program. To the best of our knowledge, this research is the first of its kind. Our approach of integrating information from students, the HIT industry and other HIT programs can also be used as a model for general HIT curriculum development and improvement.","subject":"Business, Intelligence, Information Technology, Curriculum, Student Attitudes, Industry, Student Surveys, Health Services, Costs, Risk Management, Employment Opportunities, Guidelines, Curriculum Development, Educational Improvement, Computer Science Education, Information Systems, Information Science, Interdisciplinary Approach, Undergraduate Students, Graduate Students","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120994","title":"Mental Hygienic Aspects of Animal Assisted Education","author":"Takács, István, Szalai, Katalin","description":"The Institution for Special Education at the Faculty of Pedagogic of the University of Kaposvár has been engaged in animal assisted activities for about three years. Our most recent research program was conducted for over two month in the Spring of 2014 with the involvement of 66 children--all kindergarten and elementary school age--11 special educators, physicians, psychologists, special educators, teachers, and ethologists. The primary focus of our research was the development (and examination) of memory; however, observations with ethological and mental hygiene angles were a natural segment of our work. A significant part of the observations pointed to factors that both the children and their educators have experienced: the acceptance of each other, an increased level of tolerance, and an increased attention level towards the partner (human and animal). The teachers gave account of their respective observations in a small conference at the end of the last school year. Researches were offered a glimpse into the unique world of the relationship between a part of &quot;living nature&quot;--the pygmy rabbit in our case--and humans. During the 12 sessions of the training our colleagues have made observations that could serve as basis for a new system of paradigms of animal assisted pedagogics in the future. Our experience can also be re-considered with aspects of remedial pedagogics: we are convinced that animal assistance can become an accentuated part of the care of children and students with impairments. This is also implied by the fact that preparatory works for the continuation of this research at a kindergarten and at a school are already in progress.","subject":"Foreign Countries, Educational Research, Mental Health, Pilot Projects, Control Groups, Experimental Groups, Ethology, Animal Behavior, Ecology, Early Childhood Education, Educational Practices, Observation, Interaction Process Analysis, Qualitative Research, Children, Intelligence Tests","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1109684","title":"Introducing an M-Commerce Course into the Business Management Curriculum: Experiences and Recommendations","author":"Nandi, Santosh, Nandi, Madhavi L.","description":"Mobility has become an important extension to the business strategies of present-day organizations. Thus, organizations are increasingly seeking managers with knowledge of value chain related to mobile-oriented business activities, usually referred to as mobile commerce (m-commerce). Accordingly, business management schools are interesting in designing their curricula to respond to the need for m-commerce knowledge and, in particular, the scope of the content for an m-commerce course. The general conception of m-commerce is that it is a component of e-business or e-commerce. This paper presents the unique dimensions of m-commerce that makes it stand out as a separate course for postgraduate business management students. This paper also provides input in regard to the design and delivery of the course by drawing upon the recent teaching experience of the authors at a highly respected business school in India. The course design covers mobility-related technology elements as related to business in diverse industry segments and is expected to enable students to develop a suitable mobile strategy for a real-time business scenario. The course content was drawn primarily from research papers, industry reports, and examples of trending mobile applications. The pedagogy was a blend of lectures and classroom exercises on innovative case studies. The response of the students to the course indicated a high degree of satisfaction in regard to its relevance. The inputs provided in this paper are believed to serve as guidance to business management schools that are interested developing such a course.","subject":"Management Development, Business Administration Education, Business Schools, Teaching Experience, Foreign Countries, Telecommunications, Curriculum Design, Graduate Students, Course Descriptions, Industry, Course Content, Teaching Methods, Lecture Method, Case Studies, Student Attitudes, Handheld Devices, Information Technology","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"India"},{"id":"EJ1121037","title":"Compulsory Book Reading at School and within Leisure","author":"Pavlovic, Slavica","description":"This paper deals with attitudes of secondary school pupils towards compulsory book reading at school, being the integral part of the subject Croat language and literature teaching subject, and its possible impact on their book (not-)reading in their leisure time. It is based on the research carried out through five-point Likert-type scale in secondary schools in Mostar (Bosnia and Herzegovina), in the second half of 2014. The research was conducted on the convenience, stratified sample consisted of 260 secondary school pupils, attending the final class of grammar (130) and vocational (130) school. The results obtained could give an insight into the book reading culture of secondary school pupils within their leisure related to their experience of compulsory book reading at school. It results that compulsory book reading has still been an uninteresting school task for both the strata of the research sample. Moreover, it results that compulsory book reading at school has a certain influence on book reading decrease in both sample strata's leisure time. However, some guidelines how to increase the students' interest in compulsory book reading at (secondary) school as well as in book culture within their leisure time are given in this paper.","subject":"Books, Recreational Reading, Secondary School Students, Student Attitudes, Foreign Countries, Likert Scales, Reading Habits, Reading Interests, Student Surveys","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bosnia and Herzegovina"},{"id":"EJ1120991","title":"Everyday Physical Activity of Students in Nyíregyháza","author":"Fintor, János Gábor","description":"The popularity of physical education lessons has already been demonstrated by a lot of essays, however, it has also been revealed that this popularity, as well as the frequency of doing sports, tends to decrease at later ages of life. Pursuing sports has a positive effect on academic performance. Introducing PE as an everyday lesson at schools was a milestone in physical education. Provided the aims are realised successfully, the general state of health of students can show a favourable change. The aim of our research, on the one hand, is to reveal how important physical education is as contrasted with other school subjects, according to those students asked. On the other hand, we aim to examine how the certain positive and negative attitudes of the subjects of our study appear in the resulting figures. The research was conducted in the form of self-completion questionnaires in four different funded institutions in Nyíregyháza (n = 285), in May, 2014. In the course of evaluation, we have used multivariate function analysis as well as frequency research and cross table reference. Participants mainly regard PE as important as other school subjects, however, boys significantly regard it more important than girls do. Those who do sports on a regular basis were more likely to agree that PE lessons are conducted in a friendly atmosphere than those who do sports less. Significantly, boys tended to agree with positive statements about sport.","subject":"Foreign Countries, Physical Activities, Physical Activity Level, Physical Education, Student Attitudes, Relevance (Education), Questionnaires, Multivariate Analysis, Gender Differences, Elementary School Students, Preferences, Exercise Physiology, Factor Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121007","title":"Social Participation and Health among Ageing People in East-Central Europe","author":"Makai, Alexandra, Prémusz, Viktória, Füge, Kata, Figler, Mária, Lampek, Kinga","description":"In this study we examined the health of the ageing population of East-Central Europe. Data derived from the 6th round of the European Social Survey. The aim of our research was to examine the most important factors that determine ageing people's health status. We paid particular attention to the social ties of our target group.","subject":"Foreign Countries, Geographic Location, Public Health, Aging (Individuals), Social Influences, Social Capital, Surveys, Self Concept, Socioeconomic Status, Older Adults, Social Life, Participation, Statistical Analysis, Individual Characteristics","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Europe, Slovakia, Slovenia, Hungary, Czech Republic, Poland"},{"id":"EJ1120993","title":"Possibilities in Anaemia Prevention during Pregnancy through the Basic Health Care System","author":"Karácsony, Ilona, Albrecht, Hanna, Brantmüller, Éva","description":"In case of pregnancies, one of the most common pathological conditions in internal medicine is aneamia with iron-deficiency. Furthermore, iron deficiency may also affect the mother and the fetus negatively. We wanted to find out which group of expectant mothers are mostly affected, which factors influence the development of aneamia. It was also observable in the case of those living at higher living standards that they take fetus-protecting vitamins with a significantly higher frequency before the pregnancy than those living at lower living standards. According to our research data, 67% of the sample developed aneamia. In our research the risk group consisted of young, vegetarian expectant mothers with low education and the multiparas. After conception, the timing of gynaecological consultation was appropriate and the majority of the sample had a clear idea of the ways of preventing aneamia. However, prevention was only realized in practice--based on the criteria--only with a frequency of 12%. It would be important to consciously plan pregnancy. After taking expectant mothers into care, they should--as soon as possible--be screened for the deficiency and in need, supplements should be started. Risk groups should be given greater attention. In their case, a routine supplement of iron would be desirable even before the development of a deficiency. During pregnancy care, awareness must be raised and an iron-rich diet should be established at the beginning. Beyond these, general practitioner, health visitors have the opportunity--through the close relationship with the expectant mothers--to control laboratory tests, provide appropriate information, recommend vitamin preparations as well as check taken medications.","subject":"Pregnancy, Prenatal Influences, Prenatal Care, Prevention, Mothers, Case Records, Socioeconomic Status, Dietetics, Eating Habits, Disease Incidence, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121032","title":"The Examination of the Factors Determining Career Engagement for Students Preparing for a Social Job","author":"Juhász-Klér, Andrea, Varga, Erika","description":"The higher education courses for social experts started more than 25 years ago in Hungary. Since then more than 20 thousand students have earned a degree in social areas. Some of them quit their original jobs whereas a lot of these specialists still provide support as human assistants and regard their profession a career. Due to the huge amount of experience accumulated in both education and practice since then, in our empirical research an answer was sought to the question which personal and professional competencies determine the long-term engagement to a career and how the competency experience of the students correlates with their further career aspirations. In the research nearly 500 responses from students from 8 different Hungarian higher education institutions were analysed by applying questionnaires and tests accepted in international practice together with our own measures. Data were collected about the students' career decision self-efficiency experiences, their personality traits and also about the question how they see their future profession. Based on our results the students who had a definite idea of their future professional career even during their studies and were determined with improved professional and personal competencies during the training made up a distinct group and were more dedicated to their career. On the basis of our analyses it was empirically proved that the training types which provide opportunities for the conscious monitoring of personal and professional competencies by encouraging the student with their career adjustment are of great significance.","subject":"Foreign Countries, Career Choice, Higher Education, Occupational Aspiration, Questionnaires, Self Efficacy, Personality Traits, Expectation, Hypothesis Testing, Correlation, Educational Attainment, Parent Background, Self Concept Measures, Decision Making, Vocational Maturity, Personality Measures, Goal Orientation, College Students","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121045","title":"The Main Motivations of Ukrainian Students Who Choose to Study in Poland","author":"Rebisz, Slawomir, Sikora, Ilona","description":"Students' educational migration is one of the phenomena characteristic of the globalization processes. It has been growing dynamically since the 1970s. A number of young people studying abroad has grown globally from 0.8m in 1975 to almost 5m in 2014. It comes therefore as no surprise that educational migration has become a subject of many sociological and economic studies. Their authors usually use the push-pull factors model i.e. they investigate the factors that &quot;push&quot; students out of their own countries and those that &quot;pull&quot; them to the new place of study. Our research on foreign students in Poland has been approached from a similar angle. In fact, we set out to find an answer to the question &quot;What made foreign students from Ukraine leave their country and why did they choose to study in Poland?&quot; To find our answers we conducted questionnaire interviews on a random purposive sample of foreign students from Ukraine (N = 83). In addition, to avoid the risk that the resulting correlations were accidental and the knowledge yielded in this way false, we also used the triangulation procedure--a supporting, in-depth qualitative study involving a focus group. We altogether managed to hold 4 sessions. The results obtained in the questionnaire study and in the focus group sessions were sorted and analyzed statistically (quantitative and qualitative analysis), which allowed us to find out about the main motives influencing students' migration decisions as well as the factors &quot;pushing&quot; them out of Ukraine and attracting them to Poland.","subject":"Student Motivation, Student Attitudes, Study Abroad, Decision Making, Correlation, Student Mobility, Foreign Students, Foreign Countries, Questionnaires, Interviews, Focus Groups, Qualitative Research, Statistical Analysis, Student Recruitment","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland, Ukraine"},{"id":"EJ1120995","title":"Relation of Health Condition and Quality of Life: Examination of the Quality of Life of the Disadvantaged Population in Nyíregyháza by the FT Quality of Life Index","author":"Jávorné-Erdei, Renáta, Takács, Péter, Fábián, Gergely","description":"Improving the health of the population, stopping and changing the disadvantage trends have long been one of the health policy objectives in the regions. Unfortunately, in spite of the declared goals Hungary is far away from giving priority to health issues as they are not given proper attention either on individual or societal level. In modern societies local communities play an increasingly important role in the development of quality of life. Their activity, their influence over the power structures become dominant. Quality of life is made up of objective and subjective components. Their important sub-areas are health, financial situation, income situations, housing and social relationship. Quality of life studies are the most frequent health-related research studies, the most remarkable results have been achieved here. Health-related quality of life is one of the most important and maybe the most frequently researched dimension of quality of life showing how much health status contributes to the welfare of the individuals. The primary objective of the research studies the improvement of the health status of the population and within it the health status of the individual as well as the reduction of health inequalities can be designated. The improvement of the quality of life can be rationalized as health benefit for the society. Its two main components are the extension of the life expectancy and the increase in numbers of the resulting years. The health of the Hungarian population is said to be unfavourable in international comparison and it can also be stated that it is significantly poorer than it could be expected according to the socio-economic development level.","subject":"Health Conditions, Quality of Life, Disadvantaged, Social Indicators, Life Satisfaction, Questionnaires, Health Education, Community Surveys, Public Health, Foreign Countries, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121012","title":"Comparison the Psychological Wellbeing of University Students from Hungary and Romania","author":"Barth, Anita, Nagy, Ildikó, Kiss, János","description":"The results obtained in our research of mental distress indicators and results of conflict management strategies are consistent with the results of international studies. Students participating in the study (N = 237) reached the highest average results in the field of personal growth, while we measured the lowest value in the fields of autonomy and the dominance of the environment. Among the mental distress indicators the students gave the highest scores for the stress. The frequency examination showed the results of the participants to fall to 40.9% of moderate-severe and severe extreme range. While among the genders, women indicate much higher stress levels. In addition, the students preferred the avoiding conflict management strategy in preference to the other four strategies. While we compared the students from the two countries we found a significant difference between the survey field of autonomy and purpose in life. We also found a notable difference among the mental distress indicators. While the students of the University of Debrecen were moderate, the students of the universities of Oradea fell in the &quot;slight&quot; area (in the range of stress). For the usage of conflict management strategies we found no significant differences between the two countries' students. The students from both countries preferred the avoiding strategy. This study similar to many national and international studies indicates the high level of stress among the students. One of the most important task of a higher education institution should be the protection of the students' mental health which would lead to an improvement on well-being and that would cause the lowering of the stress level.","subject":"Comparative Analysis, Well Being, College Students, Foreign Countries, Psychological Characteristics, Student Surveys, Questionnaires, Mental Health, Mental Disorders, Depression (Psychology), Anxiety, Anxiety Disorders, Research Methodology, Higher Education, Conflict Resolution, Stress Variables, Stress Management, Likert Scales, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary, Romania"},{"id":"EJ1121030","title":"The Development of Resources of Students in Adolescence as a Key Issue in Contemporary Education","author":"Gosk, Urszula, Kuracki, Kamil","description":"In the presented paper, the issue of recognition and building of resources in adolescent pupils was discussed, referring to salutogenic concept of A. Antonovsky and Conservation of Resources Theory of S. E. Hobfoll. Coming out from developmental pedagogy and positive orientation in social sciences, benefits of scientific and educational actions concentrated on identifying pupils' resources and supporting them in generating them, were shown. On the basis of Polish and foreign literature, empirical research treating about pupils' resource, was analyzed, with special attention put to the sense of coherence and its components, stress management and behavior fostering health.","subject":"Adolescents, Stress Management, Adolescent Attitudes, Secondary School Students, Correlation, Well Being, Health Behavior, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland"},{"id":"EJ1120968","title":"Revealing the Reasons Leading to Students' Drop-Out at the College of Dunaújváros","author":"Szabó, Csilla Marianna, Bacsa-Bán, Anetta","description":"In the strategy &quot;Europe 2020&quot;, EU claimed the aims to increase the ratio of graduates among 30-34-year old people, which means the expansion of the number of students in higher education as well as the decrease of dropouts. This double purpose is considered to be a big challenge both for countries and for higher educational institutes. It could be stated that parallel with the increase of higher education enrolment, supporting students who have already been admitted to higher education must be emphasized so that they could absolve their subject and take their degree.","subject":"Dropout Characteristics, Dropout Research, College Students, School Holding Power, Dropout Prevention, Questionnaires, Academic Achievement, Exit Examinations, Performance Factors, Attribution Theory, Work Experience, Achievement Need, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"European Union, Europe"},{"id":"EJ1121024","title":"Tutoring and Mentoring: An A.R.C. Model for Future Teachers: Affective, Reflexive and Cognitive Orientation to Self-Regulated Learning","author":"Remy, Philippe","description":"With a specific focus on tutoring among future teachers this article proposes a model of self-regulated learning. The focus on different mechanisms inherent to the tutoring relationship will consider Affective impacts or motivation, Reflexive or metacognitive and Cognitive resolutions. The ARC combination proposes that personal skills will be gained and beneficial transfers into the class will be possible. This approach with a model considers explicit learning as a part of tutoring relationship successes. A prospective study on a short scale provides a few indicators in this direction and will be followed by a mentoring study. As private companies also present services in the shadow of the official educational system some recommendations will illustrate the tutoring original pedagogical relation with specific limits and the potential for new understanding.","subject":"Tutoring, Mentors, Motivation, Preservice Teachers, Learning Processes, Qualitative Research, Interviews, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120923","title":"Study of Emotional Intelligence Patterns with Teachers Working in Public Education","author":"Balázs, László","description":"The data necessary for the empirical research presented it this study were provided by 572 people, from altogether 26 schools. The schools included 18 primary schools, 7 secondary training institutions and 1 primary and secondary school. The major question of the study related to the pedagogues' emotional intelligence, more precisely if the teachers of different institutions showed any individual differences in their emotional intelligence patterns according to the given type of their school's organisational culture. We also examined if the nature of the organizational culture had any influence on the development of the individual's emotional intelligence pattern. On the basis of the results we can declare that the teachers of different institutions having their own particular organizational cultures evolve different emotional intelligence patterns. Accordingly, we can come to the conclusion that in the long term the organizational culture affects the evolution of the individual's emotional intelligence pattern and vice versa.","subject":"Foreign Countries, Emotional Intelligence, Elementary School Teachers, Secondary School Teachers, Individual Differences, Organizational Culture, Hypothesis Testing, Questionnaires, Measures (Individuals), Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121027","title":"Implementation of the Project &quot;Including Disabled Senior Citizens in Creative Activities in 2013-2015&quot;","author":"Ploch, Leszek","description":"This paper made an attempt to indicate the findings of the author's research from the experiences of the implementation of the project &quot;Including disabled senior citizens in creative activities in 2013-2015&quot;. The issues of disabled senior citizens have been an object of interest over the recent years though it still has not had a proper place in science and practice. In the situation of a painful lack of initiatives, the Foundation for Propagation of Disability Art and Culture of the in Warsaw, as the only institution for promoting creative activity of the disabled in Poland, undertook a number of activities in order to include this social group in the world of culture and art. It appears that participation in creative initiatives has a very positive effect on the quality of the social functioning of disabled senior citizens in their isolation from their own families.","subject":"Foreign Countries, Program Implementation, Inclusion, Disabilities, Older Adults, Creative Activities, Outcomes of Treatment, Educational Benefits, Individual Development, Participation, Motivation, Creative Development, Preferences","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland"},{"id":"EJ1121051","title":"Talent Support at Kaposvár University, Faculty of Pedagogy","author":"Bencéné-Fekete, Andrea","description":"The shared aim of the professors working at the Faculty of Pedagogy is to help their students find the field, in which they are able to show extraordinary achievements. They help the students recognize what they are talented in and provide them the necessary support to act on this field. The talented students are most often helped by pedagogues; however, no one deals with the issue of pedagogues, who are talented and fulfill their jobs on the highest level. At Kaposvár University, Faculty of Pedagogy a three-step talent support program--based on the Czeizel-talent model--and mentorship for talented pedagogues have been introduced. During the sessions of Csokonai Student Talent Support Program each student is granted with the possibility to participate in research method lectures, rhetoric and personal development trainings and sessions how to create presentations. This new, three-step method has initiated cooperation in professional questions among not only students, but also pedagogues on our faculty.","subject":"Foreign Countries, Talent Development, Mentors, Preservice Teachers, Preservice Teacher Education, Talent Identification","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120999","title":"The Investigation of Mobbing Events Taking Place at Higher Education Institutions in Turkey Considering the Reflections on Media","author":"Çubukçu, Zühal, Girmen, Pinar, Dönmez, Ayse","description":"The business-life related competition established in modern communities has also brought about some other problems. The attacks and intimidation attempts have introduced the term of &quot;mobbing&quot; which is defined as regular and continuous psychological violence faced by people always trying to produce and win from those who they work with. The term of &quot;mobbing&quot; has recently become a popular academic issue which has been sophisticatedly handled in relevant literature. Mobbing is defined as the act of continuous and systematic intimidation purposefully performed by either some employees or employers on some employees through emotional violence. As mobbing is considered to be significant for both corporate and employee, the starting point of this study was to investigate how mobbing acts are reflected on newspapers as they are mass communication means. One of the most important means of media is print media. Print media is the first means of media when mentioned about media. Newspapers are means through which people are always kept up to date about the latest news in civilized societies. With this regard, the most basic purpose of this study is to investigate the news about the mobbing events experienced in higher education system under the light of national policy documents and reports. The study was carried out based on a qualitative approach. The news released in print media was chosen purposefully as print media means report news in a detailed way, have an evidential value and can be read again on demand. The research group in this study consists of the mobbing news released on Hurriyet, Sabah and Zaman which are newspapers published in Turkey between the years of 2009-2013. These newspapers were purposefully chosen based on criterion sampling method. The most basic understanding underlying this sampling method is to study on all cases which meet the standards set prior to the start of the study. The newspapers mentioned above were chosen considering that they are published nationally, reference newspapers and belong to different publication groups. The data used in this study was taken from the archive of the three newspapers. When the archives of the newspapers was scanned, the word &quot;mobbing&quot; was taken as key word for the search. In qualitative researches, newspapers are considered to be public archive and used as reference documents. The data obtained was grouped depending on the newspapers which it was taken from, on the year of publication, on where they took place, on the gender of the victims and on who the sufferers are.","subject":"Foreign Countries, Bullying, Newspapers, Higher Education, Qualitative Research, News Reporting, Violence","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1121042","title":"Professional Attitudes of the Teachers in Implementation of a School-Based Programme about Prevention of the Use Psychoactive Substances in 5-7 Grade","author":"Kozhuharova, Penka Petkova","description":"The subject of the research is the planning, implementation and evaluation of the program about prevention of the use of psychoactive substances among students 5-7 grade. The study was conducted by survey method with 314 teachers who teach in twenty-six schools. The qualification of the teachers to work with the program about prevention was studied in the lesson of the class. We studied the forms, through which the preventive activity, topicality, the methods used and course curricula for hours in individual classes were implemented. It was found that there was an interaction between the various recipients of the preventive activity. The preparation and qualification of the teachers to work on a program for the prevention of the use of alcohol and tobacco products was studied in the lesson of the class. We pointed out some problematic aspects and guidelines for development of the preventive activity.","subject":"Foreign Countries, Secondary School Students, Grade 5, Grade 6, Grade 7, Secondary School Teachers, Teacher Attitudes, Program Implementation, Program Evaluation, Prevention, Drug Abuse, Health Education, Teacher Surveys, Drinking, Smoking, Educational Planning, Likert Scales, Risk, Teaching Methods, Partnerships in Education","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bulgaria"},{"id":"EJ1121019","title":"Materialistic Thinking and Its Mental-Hygienic Implications among Students of Budapest Business School","author":"Gombás, Judit","description":"Previous research with extrinsic (&quot;materialistic&quot;) and intrinsic (&quot;non-materialistic&quot;) life goals suggest that intrinsic aspirations (e.g. relationships, community service, personal development) are associated with a better functioning, mentally and physically more healthy personality. In this survey 198 undergraduate students of BBS were examined by the Aspiration Index questionnaire in order to determine the pattern of extrinsic and intrinsic life goals in their personality, to find relationship between personal background-factors and these aspirations, and to compare the attitudes of the young population to a less homogenous reference group. Compared with the reference group, young women of BBS find all goals more important, except for social commitment and general intrinsic aspiration. Both BBS female and male students were found more materialistic. The materialistic attitudes are significantly stronger among the students of business programs, but not among the students of humanities (andragogy). In conclusion, the students of BBS tend to accept more extrinsic life goals than members of the external reference group. These attitudes are influenced by the generational properties of this young population and by the educational program they attend (business or humanities). The extrinsic attitudes do not serve the individuals' personal development or happiness; neither do they serve the interests of society. The new paradigms of the future business world are not yet interiorized.","subject":"Foreign Countries, Business Schools, Mental Health, Undergraduate Students, Aspiration, Student Surveys, Personality, Background, Student Attitudes, Comparative Analysis, Gender Differences, Humanities, Questionnaires, Student Characteristics","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary (Budapest)"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1121026","title":"The Impact of Pedagogical Agent on Learners' Motivation and Academic Success","author":"Dincer, Serkan, Doganay, Ahmet","description":"Pedagogical agent is generally described as educational programs that guide, motivate learners while encouraging them during learning by providing feedback. The tasks (informative, guiding, or friend, etc.) and types (human-like, cartoon character, audio, text, etc.) of these modules can be classified based on various variables. Although computer-assisted instruction software is commonly used as a teaching material, research on modules integrated on such programs is scarce. Studies in the field have revealed that such computer-assisted instruction programs increase motivation of learners. In order to keep motivation levels high, these programs need to be adopted depending on the individual needs. Therefore, it can be beneficial to integrate software designed that can be personalized. In this respect, the present study was conducted with secondary school students to identify the impact of pedagogical agent on learners' academic success and motivation. For the purpose of the study, four groups were formed. The first group received education via fixed pedagogical agent, the second group had the option to choose among several pedagogical agents, the third group received the education without pedagogical agent and finally the last group received the same education through traditional (non-computer) way. This four-week program was introduced to students via MS Excel program and the data was gathered as pre- and post-test method. The findings have revealed that interfaces impacted motivation and accordingly academic success in a positive way. As a result of the study, it is suggested that learners should be provided programs that can be personalized depending on learners' needs and preferences.","subject":"Student Motivation, Academic Achievement, Computer Assisted Instruction, Pretests Posttests, Pilot Projects, Experimental Groups, Control Groups, Statistical Analysis, Secondary School Students, Grade 5, Grade 8","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121046","title":"Organization of Physical Activities as a Precondition of Quality Development of Motor Abilities of Pre-School and School Children","author":"Markovic, Živorad, Kopas-Vukašinovic, Emina","description":"In their work authors consider the significance of the organization of physical activities for the development of abilities of pre-school and school children. Led by theoretical basis that physical development of children represents the basis of their whole development, and that &quot;fine motor skills&quot; are determined by the development of its large motorics, the authors point to the significance of the content and structure of physical education programme in preschool institutions and younger age school classes. It is evident that the effects of cultivating of children development during preschool period can be seen in younger primary school classes. The goal of this research was to determine if and how much the different organization of preparatory part of physical education lesson for younger school children, determines the differences in the development of their motor abilities. By the use of experimental method, the effects of prolonged preparatory part of a lesson in younger school classes. This part was realized through complex of exercises which were supposed to have influence on transformation of motor abilities in relation to the structure with standard duration of certain parts of a lesson. It is determined that certain increase in body movement of students during physical activity can significantly contribute to better development of motor abilities. These abilities determine correct physical development and strengthening of health, which determines general aim of physical education.","subject":"Psychomotor Skills, Physical Activities, Preschool Children, Physical Activity Level, Physical Education, Foreign Countries, Experimental Groups, Control Groups, Statistical Analysis, Elementary School Students","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Serbia"},{"id":"EJ1120992","title":"Hungarian Dimensions of Physical Activity Based on Studies at School Ages","author":"Cselik, Bence, Szmodis, Márta, Szots, Gábor, Ács, Pongrác","description":"It is an old pursuit to find the balance between nature and society (within the individual and the sum of people). In order to talk about a healthy society, it is necessary to have the people making up the society healthy, too. The health condition of the individuals affects the society, creating a close connection among individuals and society. Health, mental and physical well-beings of members of society affects the economy, since a healthy workforce leads to developing economy, which hence can provide the requirements and conditions that ensure a mentally and physically healthy way of living for the society. Sport, everyday exercise, therefore regular training can also play an important social role, and can greatly contribute to social well-being. Decreased physical activity, sitting lifestyle are both specific traits of economically developed countries, and turns into a more and more threatening public health problem world-wide, which contribute to the development or aggravation of such chronic diseases and health damages, like morbid obesity, heart diseases, diabetes, hypertension, locomotor diseases, malignant tumors, and depression. The topic of our research is related to mainly the subject of primary school healthcare programs. The measurements have been taken in 12 different educational institutions, which included primary, secondary, vocational schools, and a 6-grade school. The actuality of the topic is proven by the increased obesity appearing at more younger ages, and we intend to shed some light on the fact that with a good healthcare strategy and short-term goals we can achieve positive results shortly on the fields of school healthcare.","subject":"Foreign Countries, Physical Activity Level, Physical Activities, School Health Services, Elementary School Students, Health Programs, Experimental Groups, Control Groups, Obesity, Disease Incidence, Cohort Analysis, Age Differences, Intervention, Health Promotion, Health Conditions, Health Related Fitness, Gender Differences, Institutional Characteristics, Questionnaires, Student Surveys, Predictor Variables, Secondary School Students, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121020","title":"Telemetry Option in the Measurement of Physical Activity for Patients with Heart Failure","author":"Melczer, Csaba, Melczer, László, Oláh, András, Sélleyné-Gyúró, Mónika, Welker, Zsanett, Ács, Pongrác","description":"Measurement of physical activity among patients with heart failure typically requires a special approach due to the patients' physical status. Nowadays, a technology is already available that can measure the kinematic movements in 3-D by a pacemaker and implantable defibrillator giving an assessment on software. The telemetry data can be transmitted to a central system. The research aims to elaborate the methods that help to compare of the data concerning physical activity both built-in an accelerometer in Cardiac Resychrinisation Therapy (CRT) devices and data obtained from an external Actigraph GT3XE-Plus Triaxial Activity Monitor. 5 persons participated in the pilot study (n = 5); mean age: 57 ± 13.37; BMI: 90.6 ± 7.63. The Actigraph data from CRT device were examined in a 6-day-interval, between February 28 and March 5, 2014. The investigation started conducting a 6-minute walking test and continued with the measurement of daily physical activity. For data analysis descriptive statistics and linear regression analysis were used. It is clear from the data obtained from Actigraph that the MET values (mean: 1.17 ± 0.096) of the patients in the sample were extremely low due to their disease. However, some patients with higher physical activity than average (1.26; 1.28) seemed to be noteworthy, but they showed lower performance than healthy people. The physical activity of the patients during the 6-minute walking test corresponded to 1.9-2.48 MET. The physical activity of patients was found typically in the &quot;light or moderate range&quot; classifying the physical activity by Actigraph. Data from Actigraph are accurate and detailed making the physical activity of the patients measurable and appreciable. The results of the 6-minute walking test were in the category from moderate to very vigorous for individualized moderate physical performance based on Actigraph. It indicates the individual performance differences among patients. However, the daily physical performance is even lower than that of the 6-minute walking. We can conclude from the data related to the percentage of the average activity in CRT system to the average energy consumption and the improvement in the patients' physical condition. Due to the limitations of the sampling frequency the different time intervals cannot be isolated in the different intensity ranges. Therefore, the percentage of the data of physical activity provided by the device may have a limited use.","subject":"Physical Activities, Patients, Heart Disorders, Equipment, Physical Activity Level, Regression (Statistics), Quality of Life, Measurement, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null}]