[{"id":"EJ1176704","title":"Comprehending and Learning from Internet Sources: A Conceptual Replication Study of Goldman, Braasch, Wiley, Greasser and Brodowinska (2012)","author":"Rott, Susanne, Gavin, Bianca","description":"This investigation reports on a conceptual replication of Goldman et al. (2012) which sought to determine processing patterns of better and poorer learners as they attempted to comprehend and learn from seven textual sources on the Internet in their native language English. The aim of the current investigation was to explore how reading multiple textual sources in the L2 interacts with sense making, monitoring and evaluation processes during reading and researching on the Internet. Nineteen intermediate and advanced learners of German were asked to outline the position of the German government regarding immigration. L2 readers received a selection of five Internet sources which varied in reliability and appropriateness for the research assignment. Students' reading behavior was recorded through think-aloud protocols. The findings only partially replicated Goldman et al. Better learners used significantly more varied reading strategies overall than poorer learners. Their reading behavior was marked by greater use of self-explanation and monitoring. Better learners also skipped more unfamiliar words. Nevertheless, neither group of L2 readers employed reading and research skills that lead to a coherent intertext model fulfilling the goal of the research task.","subject":"Internet, Electronic Learning, Replication (Evaluation), Second Language Learning, German, Progress Monitoring, Protocol Analysis, Reading Skills, Reading Processes, Research Skills, Reading Strategies, Reading Comprehension, Information Sources, College Students, Reliability, Reading Tests, Objective Tests, Outcomes of Education, Statistical Analysis, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143614","title":"It Takes Research to Build a Community: Ongoing Challenges for Scholars in Digitally-Supported Communicative Language Teaching","author":"Dooly, Melinda","description":"This article provides an argument for closer multilateral alliances between the emergent and loosely-bound international community of educational researchers who are working in areas related to Digitally Supported Communicative Language Teaching and learning (herein DSCLT). By taking advantage of the communications revolution that is currently reshaping the world, internationally aligned investigators can foster new knowledge, technology, and practices that develop improved teaching strategies and policies appropriate to our rapidly changing times. Beginning with a brief overview of the impact that technology has had on education and post-2000 nascent research areas related to DSCLT, this article goes on to examine whether or not the impact of research is geographically bound, and if so, how transnational alliances can be useful in bridging gaps in the continuum of knowledge-building. Finally, the potential gains that could stem from an enhanced collaboration between international research communities are examined, although admittedly such endeavors are not without challenges.","subject":"Educational Technology, Technology Uses in Education, Communication Skills, Geographic Location, International Cooperation, Computer Mediated Communication, Educational Research, Second Language Instruction, Telecommunications, Handheld Devices, Internet, Social Media, Communities of Practice","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143784","title":"Learning L2 Pronunciation with a Mobile Speech Recognizer: French \/y\/","author":"Liakin, Denis, Cardoso, Walcir, Liakina, Natallia","description":"This study investigates the acquisition of the L2 French vowel \/y\/ in a mobile-assisted learning environment, via the use of automatic speech recognition (ASR). Particularly, it addresses the question of whether ASR-based pronunciation instruction using a mobile device can improve the production and perception of French \/y\/. Forty-two elementary French students participated in an experimental study in which they were assigned to one of three groups: (1) the ASR Group, which used an ASR application on their mobile devices to complete weekly pronunciation activities, with immediate written visual (textual) feedback provided by the software and no human interaction; (2) the Non-ASR Group, which completed the same weekly pronunciation activities in individual weekly sessions but with a teacher who provided immediate oral feedback using recasts and repetitions; and finally, (3) the Control Group, which participated in weekly individual meetings 'to practice their conversation skills' with a teacher who provided no pronunciation feedback. The study followed a pretest\/posttest design. According to the results of the dependent samples t-tests, only the ASR group improved significantly from pretest to posttest (p &lt; 0.001), and none of the groups improved in perception. The overall success of the ASR group on the production measures suggests that this type of learning environment is propitious for the development of segmental features such as \/y\/ in L2 French.","subject":"French, Second Language Learning, Pronunciation, Telecommunications, Handheld Devices, Automation, Teaching Methods, Elementary School Students, Comparative Analysis, Feedback (Response), Computer Software, Educational Technology, Technology Uses in Education, Randomized Controlled Trials, Mixed Methods Research, Pretests Posttests, Surveys, Interviews, Foreign Countries","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Canada (Montreal)"},{"id":"EJ1143741","title":"The Development of Second Language Critical Thinking in a Virtual Language Learning Environment: A Process-Oriented Mixed-Method Study","author":"Mroz, Aurore","description":"This article presents a process-oriented mixed-method study, focusing on the emergence of second language (L2) critical thinking (CT) skills in the collaborative discourse produced by a focal group of five college-level students of French working in a virtual language learning environment (the VLLE Cinet Second Life). Levels of CT ability were elicited through episodes of L2 negotiation and co-construction of meaning. The study also examines the perception by students of the impact of the VLLE on the emergence of their L2 CT skills. Motivated by the need advocated in recent CALL research for a shift in paradigm and in method to alleviate the limitations inherent to quantitative studies, the study was situated at the juncture of sociocultural theory and ecological perspective, and this article focuses on the theoretical rationale behind the selection of a mixed-method methodology.","subject":"Mixed Methods Research, Critical Thinking, Educational Technology, Thinking Skills, Focus Groups, College Students, French, Simulated Environment, Student Attitudes, Program Effectiveness, Skill Development, Technology Uses in Education, Interaction, Interpersonal Relationship, Semi Structured Interviews","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null}]