[{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1121037","title":"Compulsory Book Reading at School and within Leisure","author":"Pavlovic, Slavica","description":"This paper deals with attitudes of secondary school pupils towards compulsory book reading at school, being the integral part of the subject Croat language and literature teaching subject, and its possible impact on their book (not-)reading in their leisure time. It is based on the research carried out through five-point Likert-type scale in secondary schools in Mostar (Bosnia and Herzegovina), in the second half of 2014. The research was conducted on the convenience, stratified sample consisted of 260 secondary school pupils, attending the final class of grammar (130) and vocational (130) school. The results obtained could give an insight into the book reading culture of secondary school pupils within their leisure related to their experience of compulsory book reading at school. It results that compulsory book reading has still been an uninteresting school task for both the strata of the research sample. Moreover, it results that compulsory book reading at school has a certain influence on book reading decrease in both sample strata's leisure time. However, some guidelines how to increase the students' interest in compulsory book reading at (secondary) school as well as in book culture within their leisure time are given in this paper.","subject":"Books, Recreational Reading, Secondary School Students, Student Attitudes, Foreign Countries, Likert Scales, Reading Habits, Reading Interests, Student Surveys","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bosnia and Herzegovina"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109684","title":"Introducing an M-Commerce Course into the Business Management Curriculum: Experiences and Recommendations","author":"Nandi, Santosh, Nandi, Madhavi L.","description":"Mobility has become an important extension to the business strategies of present-day organizations. Thus, organizations are increasingly seeking managers with knowledge of value chain related to mobile-oriented business activities, usually referred to as mobile commerce (m-commerce). Accordingly, business management schools are interesting in designing their curricula to respond to the need for m-commerce knowledge and, in particular, the scope of the content for an m-commerce course. The general conception of m-commerce is that it is a component of e-business or e-commerce. This paper presents the unique dimensions of m-commerce that makes it stand out as a separate course for postgraduate business management students. This paper also provides input in regard to the design and delivery of the course by drawing upon the recent teaching experience of the authors at a highly respected business school in India. The course design covers mobility-related technology elements as related to business in diverse industry segments and is expected to enable students to develop a suitable mobile strategy for a real-time business scenario. The course content was drawn primarily from research papers, industry reports, and examples of trending mobile applications. The pedagogy was a blend of lectures and classroom exercises on innovative case studies. The response of the students to the course indicated a high degree of satisfaction in regard to its relevance. The inputs provided in this paper are believed to serve as guidance to business management schools that are interested developing such a course.","subject":"Management Development, Business Administration Education, Business Schools, Teaching Experience, Foreign Countries, Telecommunications, Curriculum Design, Graduate Students, Course Descriptions, Industry, Course Content, Teaching Methods, Lecture Method, Case Studies, Student Attitudes, Handheld Devices, Information Technology","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"India"},{"id":"EJ1077753","title":"Teaching Social Media Analytics: An Assessment Based on Natural Disaster Postings","author":"Goh, Tiong T., Sun, Pei-Chen","description":"Unstructured data in social media is as part of the &quot;big data&quot; spectrum. Unstructured data in Social media can provide useful insights into social phenomena and citizen opinions, both of which are critical to government policy and businesses decisions. Teachers of business intelligence and analytics commonly use quantitative data from sales, marketing, finance and manufacturing to demonstrate various analytics concepts in a business context. However, researchers have seldom used social media data to analyze social behavior and communication. In this study we aim to demonstrate an assessment structure for teaching social media analytics concepts with the goal of analyzing and interpreting social media content. We base this assessment on forum postings regarding two recent events: the Christchurch earthquake in New Zealand, and the Japanese earthquake and tsunami. The aim of the assessment is to discover social insights. We base the assessment structure on Cooper's Analytics Framework to cover such concepts as term frequency (TF), term frequency-inverse document frequency (TFIDF), data visualization, sentiments and opinions analysis, the Nearest Neighbor K-NN classification algorithm, and Information Diffusion theory. We review how the students performed on the assignment that used this assessment, and we make recommendations for future studies.","subject":"Foreign Countries, Social Media, Data Analysis, Natural Disasters, Visualization, Word Frequency, Content Analysis, Opinions, Information Theory, Social Behavior, Undergraduate Students, Educational Benefits, Business, Intelligence, Web Sites, Discourse Analysis, Altruism, Emotional Response, Computer Mediated Communication, Affective Behavior, Classification, Information Dissemination, Scores","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Japan, New Zealand"},{"id":"EJ1137386","title":"A Basic Set of Criteria for Evaluation of Teaching Case Studies: Students' Perspective","author":"Havelka, Douglas, Neal, Catherine S.","description":"A study was performed to identify and evaluate characteristics, properties, and attributes of teaching cases that provide value to students. The items identified can be used to create an instrument to evaluate teaching cases during the review process for publication or by instructors to identify cases that would be most appropriate for courses.","subject":"Case Studies, Student Attitudes, Evaluation Criteria, Instructional Material Evaluation, Data Collection, Data Analysis, Test Items, Media Selection, Graduate Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109690","title":"Examining Learning Styles and Perceived Benefits of Analogical Problem Construction on SQL Knowledge Acquisition","author":"Mills, Robert J., Dupin-Bryant, Pamela A., Johnson, John D., Beaulieu, Tanya Y.","description":"The demand for Information Systems (IS) graduates with expertise in Structured Query Language (SQL) and database management is vast and projected to increase as &quot;big data&quot; becomes ubiquitous. To prepare students to solve complex problems in a data-driven world, educators must explore instructional strategies to help link prior knowledge to new knowledge. This study examined learning styles and the perceived benefits of analogical problem construction on SQL knowledge acquisition. The data collected from 80 participants suggests there is a perceived positive benefit to using analogical problem construction for learning introductory database concepts. The learning style of the majority of students in the sample is &quot;Active-Sensing-Visual-Sequential.&quot; However, learning styles were not related to student perceived impact of analogical problem construction to understand database concepts. Student analogies were collected for a variety of SQL concepts; noteworthy examples are highlighted. While results related to learning styles are intriguing, the most promising path for further exploration (for both research and practice) is the use of analogy problem construction in Information Systems educational environments.","subject":"Cognitive Style, Databases, Information Systems, Information Science, Problem Solving, Teaching Methods, Prior Learning, Student Attitudes, Concept Formation, Transfer of Training, Logical Thinking, College Students, Questionnaires, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1137337","title":"Teaching Business Intelligence through Case Studies","author":"Pomykalski, James J.","description":"In teaching business students about the application and implementation of technology, especially involving business intelligence, it is important to discover that project success in enterprise systems development efforts often depend on the non-technological problems or issues. The focus of this paper will be on the use of multiple case studies in an information systems strategy course, taught to business majors, which highlight the importance of non-technological factors. Each of the cases reinforces the need for senior management support, effective change management procedures, focus on data acquisition and quality, attention to key business process, and the integration into the existing organizational infrastructure as key drivers in project success. This approach utilizes the work system framework as a basis for case study analysis.","subject":"Computer Software, Case Studies, Information Systems, Business Administration Education, Majors (Students), Administrator Role, Data Collection, College Students, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137334","title":"Enhancing the Classroom Experience: Instructor Use of Tablets","author":"Cummings, Jeff, Hill, Stephen","description":"Instructors continually search for innovative approaches to interact with and engage students in the classroom. The tablet offers a potential innovation for this purpose. Tablet devices from Apple, Microsoft, and other hardware vendors have overcome many of the challenges of the past (e.g. cost and limited applications) to become useful tools for instructors. Our paper examines instructor use of tablet devices by evaluating current tablet hardware and software solutions. A number of teaching tasks are evaluated to understand how they can be enhanced with tablets. These teaching tasks are utilized in a numbers of classes followed by an examination of student perceptions of tablet technologies in the classroom. Our results suggest that tablets are an effective tool with students rating instructor effectiveness as high compared to traditional classroom approaches. Based on results from student feedback, we recommend continued tablet use in the classroom.","subject":"Handheld Devices, Technology Uses in Education, Instructional Effectiveness, Outcomes of Education, Computer Software Evaluation, Computer Peripherals, Computer Oriented Programs, Teaching Methods, Lecture Method, Spreadsheets, Grading, Notetaking, Benchmarking, Blended Learning, Visual Aids, Student Attitudes, Student Surveys, Likert Scales, Instructional Innovation","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109691","title":"Enhancing Learning Outcomes through Experiential Learning: Using Open-Source Systems to Teach Enterprise Systems and Business Process Management","author":"Jewer, Jennifer, Evermann, Joerg","description":"Enterprise systems and business process management are the two key information technologies to integrate the functions of a modern business into a coherent and efficient system. While the benefits of these systems are easy to describe, students, especially those without business experience, have difficulty appreciating how these systems are used to improve the efficiency of business operations. This paper reports on a project to provide experiential learning to beginning business students. We focus on open-source enterprise and process management systems to investigate whether the benefits can be provided even by small institutions and without a large investment into commercial systems. The results of experimental studies are provided and suggest that hands-on learning on open-source systems can lead to improved learning outcomes. The main contribution is the demonstration that educators need not shy away from experiential learning when faced with the obstacles that large-scale commercial enterprise systems may present, but can instead choose a &quot;bottom-up&quot; approach of easily integrating enterprise systems into the curriculum to benefit student learning.","subject":"Outcomes of Education, Experiential Learning, Management Systems, Business Administration Education, Open Source Technology, Efficiency, Small Businesses, Teaching Methods, Curriculum Design, Undergraduate Students, Foreign Countries, Statistical Analysis, Scores, Pretests Posttests, Factor Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Canada"},{"id":"EJ1137155","title":"An IT Strategy Course: Why and How","author":"Woods, David M., Howard, Elizabeth V.","description":"With continuing changes in all aspects of the technology field, especially the emergence of cloud and &quot;as a service&quot; offerings, developing skills for strategic thinking about technology is of increasing importance to our students. However, the presence of formal IS\/IT strategy courses in programs of study trails that of more traditional courses. In addition, there is limited discussion on the teaching of strategy in the academic literature. This work offers reasons for the continued importance of teaching strategy and provides examples of how strategy is covered in a course on Global and Strategic Issues in IT.","subject":"Information Systems, Information Technology, Active Learning, Experiential Learning, Technology Uses in Education, College Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Ohio"},{"id":"EJ1137390","title":"Slushie World: An In-Class Access Database Tutorial","author":"Wynn, Donald E., Jr., Pratt, Renée M. E.","description":"The Slushie World case study is designed to teach the basics of Microsoft Access and database management over a series of three 75-minute class sessions. Students are asked to build a basic database to track sales and inventory for a small business. Skills to be learned include table creation, data entry and importing, form and report design, switchboards, and numerous single and multiple table query designs. The resulting application is sufficient for students to identify a number of basic functions available to the small business, including order entry, sales reports, customer information, and more. The case is designed to be used in a course where the students have little or no prior relational database experience, such as an Introduction to MIS course.","subject":"Case Studies, Teaching Methods, Databases, Computer Science Education, Database Design, Small Businesses, Skill Development, Information Systems, Case Method (Teaching Technique)","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137333","title":"Teaching Non-Beginner Programmers with App Inventor: Survey Results and Implications","author":"Soares, Andrey, Martin, Nancy L.","description":"This paper reports the results of a survey with 40 students enrolled in an Android Application Development course offered during the spring semester of 2013 and 2014. The course used App Inventor to build the apps and required students to have an introduction to programming course as a prerequisite. The survey asked for demographic information and students' opinions about prerequisites, App Inventor, previous programming skills, new concepts learned, teamwork, and more. The positive responses support the practice of using App Inventor to teach not only beginner programmers, but also more experienced programmers. The paper also shows that App Inventor can be used to support the teaching of more advanced computing concepts. [Note: The issue month (October) shown on this PDF is incorrect. The correct publication month is September 2015.]","subject":"Computer Science Education, Computer Oriented Programs, Programming, Advanced Courses, Advanced Students, Student Attitudes, Student Surveys, Likert Scales, Prior Learning, Prerequisites, Novices, Secondary Education, Higher Education","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137389","title":"The Cocoa Shop: A Database Management Case","author":"Pratt, Renée M. E., Smatt, Cindi T.","description":"This is an example of a real-world applicable case study, which includes background information on a small local business (i.e., TCS), description of functional business requirements, and sample data. Students are asked to design and develop a database to improve the management of the company's customers, products, and purchases by emphasizing effective business rules and professional database development. In addition, this case will explore the benefits of working with MS Access, data population, creation and development of forms, queries, reports and a switchboard to complete the requirements express by TCS. This case can be used in a course where the students have little or no prior relational database experience, as well as a more intermediate\/advance level of experience. Teaching notes containing suggested guidelines, deliverables, and the resulting database containing data, forms, queries, reports, and switchboard are provided upon request.","subject":"Case Studies, Small Businesses, Databases, Database Management Systems, Database Design, Case Method (Teaching Technique), Information Systems","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137387","title":"Live, Model, Learn: Experiencing Information Systems Requirements through Simulation","author":"Hartzel, Kathleen S., Pike, Jacqueline C.","description":"Information system professionals strive to determine requirements by interviewing clients, observing activities at the client's site, and studying existing system documentation. Still this often leads to vague and inaccurate requirements documentation. When teaching the skills needed to determine requirements, it is important to recreate a realistic environment to develop analytical thinking skills. To address this, we developed a simulation for students to learn requirements gathering and analysis where they experience the requirements by operating a fictitious manufacturing firm. The students manage and operate the company, taking on a variety of employee roles from the physical &quot;manufacturing&quot; to the order-taking to the purchasing of component parts. With this pedagogical approach, students deal with the messiness of the problem by drawing on their own experience working in the manufacturing firm, making assumptions, and having the opportunity to verify their assumptions and analyses by working with their classmates. The simulation was implemented across two courses in an undergraduate information systems program.","subject":"Information Systems, Simulation, Teaching Methods, Employees, Role, Manufacturing Industry, Administration, Experiential Learning, Undergraduate Study, Active Learning, Inquiry, Systems Analysis, Design, Information Management, Student Attitudes, Student Surveys, Likert Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1137365","title":"A Project Management Approach to Applying Best Practices to Online CS\/MIS Experiential Learning Projects","author":"Schwieger, Dana, Surendran, Ken","description":"The value of experiential learning projects (which are usually major assessments in courses) in education has been touted since the early 1900s (Dewey, 1938). These projects have the potential to deepen students' understanding of course topics by allowing them to put concepts into practice and watch the results develop. However, experiential learning projects require significant guidance, communication between students and faculty, and direction. Coupled with the communication intricacies of an online learning environment, experiential learning projects become a little more difficult to manage. In this article, the authors examine some of the best practices for teaching online courses as they relate to experiential learning projects, the value of experiential learning projects and then apply a project management approach to addressing the challenges of assigning experiential learning projects in online courses looking at two courses taught at the authors' institution. The authors then describe some best practices that they have incorporated to better manage the application of experiential learning projects in their online classrooms.","subject":"Program Administration, Best Practices, Online Courses, Computer Science Education, Management Information Systems, Experiential Learning, Web Based Instruction, Educational Benefits, Graduate Study, Course Descriptions, Blended Learning, Student Projects, Cooperative Learning, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098517","title":"Teaching Case: Adapting the Access Northwind Database to Support a Database Course","author":"Dyer, John N., Rogers, Camille","description":"A common problem encountered when teaching database courses is that few large illustrative databases exist to support teaching and learning. Most database textbooks have small &quot;toy&quot; databases that are chapter objective specific, and thus do not support application over the complete domain of design, implementation and management concepts across a single database. The Northwind Traders sample database is available by Microsoft for download and use in Microsoft Access, and illustrates transactional processing for a fictitious company that imports (purchases) and exports (sells) specialty foods from around the world. The database contains sample tables, queries, forms, reports, Macros, VBA Class Objects, functions and modules, and other database features. Although the primary purpose for the database is to serve as an illustrative design template for students and practitioners, unfortunately the database and business processes are largely undocumented. This paper attempts to more completely document the business processes, including establishing business rules, describing relationships and participations, and discusses some problems with the existing design. Following understanding of the database and associated business processes, this paper can be used as both a teaching tool and a guide for practitioners using the Northwind Traders sample database as a design template. Additionally, it has been used successfully to introduce the concept of business processes and mapping them in an underlying database in introductory ERP courses.","subject":"Databases, Media Adaptation, Database Design, Database Management Systems, Computer Science Education, Instructional Materials","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113941","title":"Teaching Tip: Using a Group Role-Play Exercise to Engage Students in Learning Business Processes and ERP","author":"Shen, Yide, Nicholson, Jennifer, Nicholson, Darren","description":"With the increasing process-centric focus and proliferation of Enterprise Resource Planning (ERP) systems in organizations, it is imperative for business graduates to understand cross-functional business processes and ERP system's role in supporting business processes. However, this topic can be rather abstract and dry to undergraduate students, most of whom have little work experience. In this paper, we present a group role-play exercise that has been used in an introductory management information systems course to actively engage students in learning business processes and ERP systems. Student learning outcomes and their perceptions of the group role-play exercise were measured using a questionnaire. Results indicate that student knowledge of three key business processes and ERP system's role in supporting business processes increased significantly after participating in the role-play exercise. Students also had positive perceptions of the group role-play exercise. Teaching suggestions for implementing the group role-play exercise, as well as contributions of this study, are discussed.","subject":"Management Information Systems, Strategic Planning, Role Playing, Business Administration Education, Undergraduate Students, Group Activities, Introductory Courses, Student Attitudes, Outcomes of Education, Questionnaires, Teaching Methods, Scores, Educational Benefits","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084406","title":"Open Source Meets Virtual Reality--An Instructor's Journey Unearths New Opportunities for Learning, Community, and Academia","author":"O'Connor, Eileen A.","description":"Opening with the history, recent advances, and emerging ways to use avatar-based virtual reality, an instructor who has used virtual environments since 2007 shares how these environments bring more options to community building, teaching, and education. With the open-source movement, where the source code for virtual environments was made available to the public, greatly reduced prices and increased options are shifting dramatically the utility of virtual environments for developing student competencies as virtual creators; supporting faculty and organizational needs; enabling comprehensive curriculum, assessment, and design; and allowing for multipurpose virtual environments. Reporting changes to how she taught the development of virtual environments, the author explains the enhanced learning observed within a newly designed course and the improvements she will make in the future. Additional recommendations address how education, communication, and learning organizations can use improvements to implement multipurpose virtual environments and can support technology-facilitated design in general.","subject":"Electronic Learning, Virtual Classrooms, Simulated Environment, Open Source Technology, Teaching Methods, Educational Change, Computer Simulation, Internet, Educational Technology, Curriculum Design, Lifelong Learning, Communities of Practice, Scaffolding (Teaching Technique), Masters Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1077752","title":"American Association of University Women: Branch Operations Data Modeling Case","author":"Harris, Ranida B., Wedel, Thomas L.","description":"A nationally prominent woman's advocacy organization is featured in this case study. The scenario may be used as a teaching case, an assignment, or a project in systems analysis and design as well as database design classes. Students are required to document the system operations and requirements, apply logical data modeling concepts, and design an appropriate data structure for a relational database. The case focuses on a membership administration system with several extended components to keep track of entities such as the Board of Directors and branch committees. The case has been used successfully in the classroom at both individual and group levels. Feedback from students and instructors who have utilized the case indicate that it is an effective instrument that provides a realistic illustration of real-world data modeling without being unreasonably complex. Teaching notes and a suggested solution including data flow diagrams, an entity-relationship diagram (ERD), and a data dictionary are available through the JISE web site.","subject":"Advocacy, Case Method (Teaching Technique), Womens Studies, Community Organizations, Systems Analysis, Database Design, Operations Research, Assignments, Learning Activities, Units of Study, Instructional Design, Business Administration, Business Administration Education, Professional Associations","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137384","title":"Information Security in a World of Global Connectivity: A Case Study","author":"Lawrence, Cameron, Olson, Garrett, Douma, Bambi","description":"The widespread use of digital technologies such as smartphones, tablets, and notebook computers expose firms engaged in international business to risks that far exceed what most corporate technology users understand. This case study examines some of the technology-specific vulnerabilities managers face when engaged in international travel and introduces tools and technologies including HTTPS, two-factor authentication, VPNs and the use and management of complex passwords. The case concludes with a set of discussion questions and hands-on exercises that can be completed in or out of class. This case is intended for the Intro to MIS class and complements the model curriculum objectives in IS 2010.1 and IS 2010.7.","subject":"Information Security, Computer Security, Global Approach, Travel, Introductory Courses, Management Information Systems, Student Educational Objectives, Privacy, Computer Science Education, Learning Activities, Case Method (Teaching Technique), Case Studies","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137096","title":"Learning Styles, Online Content Usage and Exam Performance in a Mixed-Format Introductory Computer Information Systems Course","author":"Lang, Guido, O'Connell, Stephen D.","description":"We investigate the relationship between learning styles, online content usage and exam performance in an undergraduate introductory Computer Information Systems class comprised of both online video tutorials and in-person classes. Our findings suggest that, across students, (1) traditional learning style classification methodologies do not predict behavioral measures of online learning, and (2) working on the online content specifically during allotted class time is positively related to exam performance. Controlling for differences across students, we find (3) accessing content on non-class days (consistency) is positively related to exam performance, while (4) working substantially ahead of the scheduled content pace is negatively related to exam performance.","subject":"Introductory Courses, Correlation, Cognitive Style, Undergraduate Students, Information Systems, Computer Science Education, Video Technology, Prediction, Tests, Classification, Online Courses, Course Content, Scores, Teaching Methods, Blended Learning, Measures (Individuals), Private Colleges, Course Descriptions, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098512","title":"Should You Allow Your Students to Grade Their Own Homework?","author":"Simkin, Mark G.","description":"Allowing students to grade their own homework promises several advantages to both students and instructors. But does such a policy make sense? This paper reports the results of an experiment in which eight separate assignments completed by approximately 80 students were first graded by the students using a grading rubric, and then re-graded by a teaching assistant, using this same rubric. The study found that the differences observed in the two sets of data were statistically significant, but (in the author's opinion) acceptably small. The study also confirmed observations by earlier researchers that students who generously grade their work tend to fall among the lower-performing individuals in a class.","subject":"College Students, Grading, Self Evaluation (Individuals), Homework, Educational Experiments, Scoring Rubrics, Teaching Assistants, Comparative Analysis, Statistical Significance, Low Achievement, Cooperative Learning, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1072622","title":"Healthcare.gov: Opportunity out of Disaster. Teaching Case","author":"Cundiff, Jacob, McCallum, Taylor, Rich, Andrew, Truax, Michael, Ward, Tamara, Havelka, Douglas","description":"The launch of HealthCare.gov, the website of the Affordable Care Act (AKA Obamacare), was a major public relations disaster for the Obama administration. This case examines some of the factors that contributed to the failure of the launch and then details how Optum, an information technology service provider, considered the opportunity provided by the failure. The case provides examples of both good and bad IT management processes and poses questions for discussion related to the evaluation of risk associated with high profile projects.","subject":"Case Studies, Information Systems, Database Management Systems, Online Vendors, Health Services, Performance Factors, Computer Software Evaluation, Performance Technology, Outsourcing, Program Administration, Background, Federal Programs, Program Implementation, Database Design, Databases, Information Science Education, Information Networks, Computer System Design, Case Method (Teaching Technique), Higher Education, Systems Development","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137368","title":"USMCo Payroll System","author":"Cohill, Katrina, Dudley, Danielle, Gregg, Jason, Millette, Elizabeth, Zinnecker, Adam, Havelka, Douglas","description":"The General Manager, Steve Gunderson, is currently charged with leading the decision on whether to outsource the payroll function of the USMCo (UltraSonic Machining Co) organization or to purchase a system and hire a full-time, experienced payroll staff member to manage the details of payroll for the company. There are differing opinions of stakeholders in the business units, and a staff member could lose their job. The objective USMCo is trying to meet is to have a payroll system that works correctly, minimize risk of entering wrong information, reduce the costs of running the payroll processes, and provide more time to the current HR staff for their more important duties. Financial services and HR have differing views on the solution based on their desired outcome and needs. Steve has the goal of streamlining processes and making sense of the business objectives.","subject":"Accounting, Outsourcing, Manufacturing Industry, Decision Making, Selection, Human Resources, Case Method (Teaching Technique), Administrative Change, Efficiency","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084444","title":"Using Computer Simulations and Games to Prevent Student Plagiarism","author":"Bradley, Elizabeth G.","description":"In this increasingly digital age, student plagiarism is rampant. Roughly half of college students admit to plagiarizing using content found online, directly copying and pasting the work of others. Digital technology and social media have greatly changed the landscape of how knowledge is acquired and disseminated; thus, students must be explicitly taught digital literacy skills and how to correctly utilize information they find online. Computer simulations are an active, engaging, and efficient way of explicitly teaching students about plagiarism and how to avoid academic dishonesty. A number of colleges and universities provide free open source games and simulations, which can be utilized as course assignments or activities in order to explicitly teach students proper citation procedures. This article reviews 10 plagiarism prevention computer games and simulations, with details about each program, including access information.","subject":"Prevention, Plagiarism, Computer Simulation, Teaching Methods, Technological Literacy, College Students, Computer Games, Cheating, Open Source Technology, Assignments, Citations (References)","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137191","title":"The Flipped Classroom in Systems Analysis &amp; Design: Leveraging Technology to Increase Student Engagement","author":"Saulnier, Bruce M.","description":"Problems associated with the ubiquitous presence of technology on college campuses are discussed and the concept of the flipped classroom is explained. Benefits of using the flipped classroom to offset issues associated with the presence of technology in the classroom are explored. Fink's Integrated Course Design is used to develop a flipped class approach to the author's Systems Analysis &amp; Design course, and a resulting classroom module is provided as an example. Results of the initial use of this approach are discussed. It is concluded that the use of the flipped classroom in systems analysis and design definitely increases in-class student focus and engagement and as a result helped to increased student learning of both program specific and course specific student outcomes. Further longitudinal studies are suggested to determine effects of employing the flipped classroom approach on the continuing attainment of student learning outcomes.","subject":"Systems Analysis, Classroom Techniques, Design, Technology Uses in Education, Student Participation, Learner Engagement, Learning Modules, Instructional Effectiveness, Integrated Curriculum, Curriculum Design, Achievement Gains, Student Satisfaction, Teaching Methods, College Students, Blended Learning, Homework","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Connecticut"},{"id":"EJ1084414","title":"Teaching Adult Learner Characteristics and Facilitation Strategies through Simulation-Based Practice","author":"Speed, Sally A., Bradley, Elizabeth, Garland, Krista Vince","description":"This article relates a project in which a curriculum module was developed to help graduate students more effectively manage behaviors of adults in facilitation sessions. The module was piloted in the project and later included in a graduate level course in the Creative Studies Department of SUNY Buffalo State. The curriculum identified characteristics of adult learners and behaviors that manifest from those characteristics and helped Creative Studies graduate students develop strategies to manage such behaviors in facilitation sessions. The module included practice sessions for facilitation using TeachLivE™, a mixed reality simulation that offers education students practice in classroom management with avatars to enhance their teaching skills. Results indicated that students felt they were more capable of managing adult learner behaviors and more confident and effective in facilitations as a result of the module and TeachLivE™ simulation.","subject":"Adult Learning, Graduate Students, Learning Modules, Computer Simulation, Classroom Techniques, Experiential Learning, Quasiexperimental Design, Pilot Projects, Curriculum Development, Student Educational Objectives, Feedback (Response), Longitudinal Studies, Pretests Posttests, Likert Scales, Student Surveys, Program Effectiveness, Data Analysis, Qualitative Research, Statistical Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137336","title":"How Students Use Technology to Cheat and What Faculty Can Do about It","author":"Bain, Lisa Z.","description":"Technology, like most things in life, can provide many benefits to society and improve both the business and academic environments. Technology can also be used in ways that circumvent the educational process and create situations where it is not being used in the appropriate way. College students that use technology to gain access to unauthorized information is a form of academic dishonesty referred to as e-cheating. This can happen both inside and outside of the classroom and takes on many forms. The Internet, in particular, fuels this behavior making it easier, faster, and more convenient then in the past. In addition, electronic devices like smartphones, tablets, and laptops are commonly used across all institutions and will continue to be used for the foreseeable future. Fortunately, faculty can use traditional pedagogical methods for educating, preventing, and reporting academic dishonesty. This paper discusses the common ways technology is being used by students for e-cheating and the actions faculty can take to hopefully reduce academic dishonesty in their courses.","subject":"Cheating, Student Behavior, Ethics, Teaching Methods, Prevention, Plagiarism, Integrity, Technology Uses in Education, Educational Technology, Teacher Responsibility","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137339","title":"Why Phishing Works: Project for an Information Security Capstone Course","author":"Pollacia, Lissa, Ding, Yan Zong, Yang, Seung","description":"This paper presents a project which was conducted in a capstone course in Information Security. The project focused on conducting research concerning the various aspects of phishing, such as why phishing works and who is more likely to be deceived by phishing. Students were guided through the process of conducting research: finding background and related work on the topic, determining the hypothesis, development of the survey system, data collection, analysis of the results, and writing of the academic paper. This project was very successful in that students gained in-depth knowledge about phishing, developed an understanding of research and academic writing, and learned to statistically analyze data to support or refute their hypothesis. Educators who are teaching a capstone course in Information Security may be interested in this project because it is an appropriate level for undergraduate seniors, it can be accomplished in one semester, and the participants can be other students at the institution.","subject":"Information Security, College Seniors, Research Projects, Student Research, Research Methodology, Research Papers (Students), Research Skills, Writing Skills, Skill Development, Statistical Analysis, Hypothesis Testing, Library Research, Web Sites, Electronic Mail, Surveys, Test Construction, Student Developed Materials","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109645","title":"Teaching Tip: Active Learning via a Sample Database: The Case of Microsoft's Adventure Works","author":"Mitri, Michel","description":"This paper describes the use and benefits of Microsoft's Adventure Works (AW) database to teach advanced database skills in a hands-on, realistic environment. Database management and querying skills are a key element of a robust information systems curriculum, and active learning is an important way to develop these skills. To facilitate active learning and produce a compelling narrative, the data structure and content of a useful pedagogically-oriented database should be realistic and lifelike. It should contain data that accurately depicts the business processes, functions, and entities of a realistic organization, structured in a way that demonstrates best practices in database design. Most database textbooks include sample databases, but these are often small and sparse of data. By contrast, Microsoft's AW database presents a robust, realistic, and comprehensive framework for many important educational objectives in an IS curriculum. This paper introduces the AW business case and database, and illustrates several pedagogical uses in an undergraduate CIS program.","subject":"Active Learning, Databases, Computer Software, Educational Benefits, Case Method (Teaching Technique), Case Studies, Skill Development, Information Systems, Curriculum Development, Educational Technology, Business Education, Best Practices, Database Design, Problem Based Learning, Problem Solving, Database Management Systems, Educational Objectives, Undergraduate Study, Computer Science Education, Programming Languages, Information Retrieval, Student Attitudes","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121042","title":"Professional Attitudes of the Teachers in Implementation of a School-Based Programme about Prevention of the Use Psychoactive Substances in 5-7 Grade","author":"Kozhuharova, Penka Petkova","description":"The subject of the research is the planning, implementation and evaluation of the program about prevention of the use of psychoactive substances among students 5-7 grade. The study was conducted by survey method with 314 teachers who teach in twenty-six schools. The qualification of the teachers to work with the program about prevention was studied in the lesson of the class. We studied the forms, through which the preventive activity, topicality, the methods used and course curricula for hours in individual classes were implemented. It was found that there was an interaction between the various recipients of the preventive activity. The preparation and qualification of the teachers to work on a program for the prevention of the use of alcohol and tobacco products was studied in the lesson of the class. We pointed out some problematic aspects and guidelines for development of the preventive activity.","subject":"Foreign Countries, Secondary School Students, Grade 5, Grade 6, Grade 7, Secondary School Teachers, Teacher Attitudes, Program Implementation, Program Evaluation, Prevention, Drug Abuse, Health Education, Teacher Surveys, Drinking, Smoking, Educational Planning, Likert Scales, Risk, Teaching Methods, Partnerships in Education","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bulgaria"},{"id":"EJ1137323","title":"Evaluating Business Intelligence\/Business Analytics Software for Use in the Information Systems Curriculum","author":"Davis, Gary Alan, Woratschek, Charles R.","description":"Business Intelligence (BI) and Business Analytics (BA) Software has been included in many Information Systems (IS) curricula. This study surveyed current and past undergraduate and graduate students to evaluate various BI\/BA tools. Specifically, this study compared several software tools from two of the major software providers in the BI\/BA field. The participants in the study evaluated each software tool according to three key criteria: 1) functionality, 2) ease of use, and 3) learning effectiveness. The &quot;learning effectiveness&quot; criterion was used to determine which BI\/BA tools provided the most effective learning of BI\/BA concepts in the IS classroom. The three criteria were used to develop recommendations for including specific BI\/BA software tools in the IS curriculum. Based on the findings of the study, the authors recommend that colleges and universities consider the use of the IBM-Cognos suite of tools as a viable means for teaching BI\/BA concepts in their Information Systems curricula. The results of the study are relevant to any college or university that currently includes (or is considering the inclusion of) Business Intelligence \/ Business Analytics concepts in its Information Systems curriculum.","subject":"Computer Software, Information Systems, Technology Uses in Education, Educational Technology, College Students, Business, Data Collection, Data Analysis, Curriculum, Student Surveys, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1137375","title":"Coastal Pacific Doctor Associates: Implementation of a Purchased System","author":"Schwieger, Dana, McDonald, Michael","description":"Coastal Pacific Doctor Associates (CPDA) is a multi-physician medical practice located along the west coast. CPDA decided to replace their inadequate and outdated medical office system during a time of tremendous restructuring in the medical software industry. In their impatience, CPDA chose an electronic medical record (EMR) and practice management (PM) system that would better accommodate the needs of a hospital rather than a medical clinic. The system that they chose to purchase was under development and had not been fully tested before it was hurriedly installed as CPDA's main system during a cutover implementation. EMR\/PM software representatives failed to live up to their original promises as deadlines passed and the employees were trained in the last days before the go live date. Training took place on a portable network brought in by the sales representatives using manufacturer's test data. After the problems started to escalate, the manufacturer's help line stopped providing assistance and CPDA was left to solve its own problems. The organization in this case faces a number of project management and technology implementation issues. These issues can be addressed in multiple courses including: enterprise architecture, project management, systems analysis and design as well as systems implementation.","subject":"Medical Services, Information Systems, Database Management Systems, Database Design, Usability, Technical Support, Technology Planning, Online Vendors, Program Implementation, Program Administration, Performance Factors, Case Method (Teaching Technique)","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137094","title":"Cybersecurity Curriculum Development: Introducing Specialties in a Graduate Program","author":"Bicak, Ali, Liu, Michelle, Murphy, Diane","description":"The cybersecurity curriculum has grown dramatically over the past decade: once it was just a couple of courses in a computer science graduate program. Today cybersecurity is introduced at the high school level, incorporated into undergraduate computer science and information systems programs, and has resulted in a variety of cybersecurity-specific graduate programs. However, is that even enough? Is cybersecurity so broad that education needs to be more specialized? Employers want graduates who can hit the ground running: not in the broad field of cybersecurity but in some very specific areas. This paper is structured as follows. First, we will provide a brief overview of the current approaches to cybersecurity education including government standards bodies such as the National Initiative for Cybersecurity Education (NICE) framework, the upcoming changes in the National Information Assurance (IA) Education and Training Programs (NIETP) Center of Academic Excellence (CAE) designation requirements, and the Department of Labor competency model. Second, we will present a framework for curriculum changes, which we use to determine the viability of information technology\/information systems (IS\/IT) curriculum changes to our departmental educational offerings. We examine relationships with other departments and how cybersecurity is enhanced by other domain knowledge. Then we discuss the three specialties we plan to introduce in the cybersecurity graduate curriculum: cybersecurity data analysis, cyber intelligence, and health care information security and privacy. Finally, the future cybersecurity curriculum directions are presented and discussed.","subject":"Information Security, Curriculum Design, Computer Science, Graduate Study, Information Science Education, Employers, Education Work Relationship, Standards, Guidelines, Teaching Methods, Educational Change, Excellence in Education, Models, Data Analysis, Health Services, Privacy, Records (Forms), Medical Evaluation, Program Descriptions, Private Colleges","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Virginia"},{"id":"EJ1077745","title":"Making Data Flow Diagrams Accessible for Visually Impaired Students Using Excel Tables","author":"Sauter, Vicki L.","description":"This paper addresses the use of Excel tables to convey information to blind students that would otherwise be presented using graphical tools, such as Data Flow Diagrams. These tables can supplement diagrams in the classroom when introducing their use to understand the scope of a system and its main sub-processes, on exams when answering questions about such relationships, or in group projects in discussing problems with and recommendations for systems. The main contributions are a) a suggestion on how to translate the different aspects of Data Flow Diagrams into a table format and b) the in-class experiences from using the approach. The approach can be broadened to other graphical representations such as Entity-Relationship Diagrams or Use-Case Diagrams. Further, this approach could be broadened to support alternative learning styles of sighted students in the class.","subject":"Tables (Data), Visual Impairments, Blindness, Flow Charts, Teaching Methods, Assistive Technology, Courseware, Computer System Design, Appropriate Technology, Systems Analysis, Knowledge Representation, Educational Practices","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113948","title":"Teaching Tip: Managing Software Engineering Student Teams Using Pellerin's 4-D System","author":"Doman, Marguerite, Besmer, Andrew, Olsen, Anne","description":"In this article, we discuss the use of Pellerin's Four Dimension Leadership System (4-D) as a way to manage teams in a classroom setting. Over a 5-year period, we used a modified version of the 4-D model to manage teams within a senior level Software Engineering capstone course. We found that this approach for team management in a classroom setting led to qualitatively fewer incidents of teams unable to effectively work together, better projects, and greater group cohesion. In this article, we discuss our experience using the 4-D System, which was not originally designed for use in the classroom. We find our modified version of the 4-D System to be viable in a classroom setting and provide the reader with everything needed to implement 4-D in his or her own course.","subject":"Engineering Education, Computer Science Education, Computer Software, Programming, Leadership Styles, Teamwork, Cooperative Learning, Classroom Environment, College Curriculum, Group Dynamics, Educational Practices, Educational Strategies, Program Administration","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1098514","title":"How Does ERPsim Influence Students' Perceived Learning Outcomes in an Information Systems Course? An Empirical Study","author":"Chen, Liqiang, Keys, Anthony, Gaber, Donald","description":"It is a challenge for business students or even employees to understand business processes and enterprise software usage without involvement in real-world practices. Many business schools are using ERP software in their curriculum, aiming to expose students to real-world business practices. ERPsim is an Enterprise Resource Planning (ERP) teaching-learning tool for business students to learn actual SAP and business processes. This study empirically examines how ERPsim enhances student learning outcomes in an IS course. The findings reveal the antecedent effects of two important IS constructs (enjoyment and cognitive appraisal) on learning behavior and learning outcomes during students' involvement with ERPsim. The study provides empirical evidence that some major IS constructs (i.e., enjoyment and cognitive appraisal of using information systems) play important roles in shaping the effectiveness of using simulation game software to learn business processes and ERP software.","subject":"Business Administration Education, Strategic Planning, Computer Software, Information Systems, Outcomes of Education, Learning Processes, Computer Simulation, Hypothesis Testing, College Students, Student Surveys, Introductory Courses, Educational Experiments, Statistical Analysis, Path Analysis, Measurement, Reliability, Validity, Program Effectiveness","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113944","title":"Social Representations of Cybersecurity by University Students and Implications for Instructional Design","author":"Pawlowski, Suzanne D., Jung, Yoonhyuk","description":"Cybersecurity has become an essential topic in introductory information systems (IS) core courses. As an aid to course design, the exploratory research in this paper uses a social representations lens to elucidate the perceptions of cybersecurity and cybersecurity threats held by students. Analysis of qualitative survey data from 152 students at a university in the Western U.S. identified 23 concepts forming the students' collective understanding of cybersecurity. Presented in the form of a social representations map, the findings reveal student perspectives that can be used to motivate and enhance learning about cybersecurity threats and mitigation strategies. Interpretation of the map indicates that students' sensemaking about cybersecurity places the strongest emphasis on technological concepts and socio-political concerns. In contrast, potential cybersecurity threats to national critical infrastructure are only minimally represented. The survey also examined students': (a) level of concern about different cybersecurity threats; (b) perceived likelihood they will experience given computer security incidents; and (c) incidents they have already experienced. Instructors of introductory IS courses can utilize the study findings to motivate student interest by building upon topics currently evident in the representation\/frame of reference and increase student awareness and attention to cybersecurity threats that are missing. Suggested instructional design approaches, tailored to the level of awareness\/prior knowledge and concern indicated include: (1) a problem-centered approach for topics related to personal cybersecurity; (2) demonstrating relevance and utilizing case studies for topics on organizational cybersecurity; and (3) collaborative, guided discovery to raise awareness about national security\/critical infrastructure cybersecurity threats and protections.","subject":"Information Security, Information Science Education, Information Systems, Qualitative Research, Student Surveys, Student Attitudes, Learning Motivation, Introductory Courses, Undergraduate Students, Instructional Design, Teaching Methods, Consciousness Raising, National Security, Case Studies, Cooperation, Content Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121026","title":"The Impact of Pedagogical Agent on Learners' Motivation and Academic Success","author":"Dincer, Serkan, Doganay, Ahmet","description":"Pedagogical agent is generally described as educational programs that guide, motivate learners while encouraging them during learning by providing feedback. The tasks (informative, guiding, or friend, etc.) and types (human-like, cartoon character, audio, text, etc.) of these modules can be classified based on various variables. Although computer-assisted instruction software is commonly used as a teaching material, research on modules integrated on such programs is scarce. Studies in the field have revealed that such computer-assisted instruction programs increase motivation of learners. In order to keep motivation levels high, these programs need to be adopted depending on the individual needs. Therefore, it can be beneficial to integrate software designed that can be personalized. In this respect, the present study was conducted with secondary school students to identify the impact of pedagogical agent on learners' academic success and motivation. For the purpose of the study, four groups were formed. The first group received education via fixed pedagogical agent, the second group had the option to choose among several pedagogical agents, the third group received the education without pedagogical agent and finally the last group received the same education through traditional (non-computer) way. This four-week program was introduced to students via MS Excel program and the data was gathered as pre- and post-test method. The findings have revealed that interfaces impacted motivation and accordingly academic success in a positive way. As a result of the study, it is suggested that learners should be provided programs that can be personalized depending on learners' needs and preferences.","subject":"Student Motivation, Academic Achievement, Computer Assisted Instruction, Pretests Posttests, Pilot Projects, Experimental Groups, Control Groups, Statistical Analysis, Secondary School Students, Grade 5, Grade 8","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null}]