[{"id":"EJ1074893","title":"Computer-Mediated Input, Output and Feedback in the Development of L2 Word Recognition from Speech","author":"Matthews, Joshua, Cheng, Junyu, O'Toole, John Mitchell","description":"This paper reports on the impact of computer-mediated input, output and feedback on the development of second language (L2) word recognition from speech (WRS). A quasi-experimental pre-test\/treatment\/post-test research design was used involving three intact tertiary level English as a Second Language (ESL) classes. Classes were either assigned to a control group (n = 31) or to one of two alternative treatment levels which used a web-based computer application enabling self-determined opportunities to repeatedly listen to and reconstruct spoken target text into its written form. Treatment group one (n = 30) received text feedback after each of their efforts at target text reconstruction, whereas treatment group two (n = 35) did not. Results indicated that word recognition gain scores of those who used the application, regardless of treatment level, were significantly higher than those of the control group. The relationship between the quantity of self-determined exposure to input and word recognition improvements was moderate but not linear, with those choosing moderate levels of speech input deriving the greatest measurable improvement. Neither increased levels of modified output nor the provision of text feedback were associated with significant improvements in word recognition gain scores. Implications for computer-mediated approaches for the development of L2 WRS are described and areas for future empirical research are suggested.","subject":"Second Language Learning, English (Second Language), Quasiexperimental Design, Control Groups, Pretests Posttests, Linguistic Input, Feedback (Response), Scores, Correlation, Computer Assisted Instruction, Higher Education, Speech","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074878","title":"Using Key Part-of-Speech Analysis to Examine Spoken Discourse by Taiwanese EFL Learners","author":"Lin, Yen-Liang","description":"This study reports on a corpus analysis of samples of spoken discourse between a group of British and Taiwanese adolescents, with the aim of exploring the statistically significant differences in the use of grammatical categories between the two groups of participants. The key word method extended to a part-of-speech level using the web-based corpus analytical tool, &quot;Wmatrix,&quot; highlights those linguistic domains which deserve particular attention. Specifically, it reveals the lexical and grammatical categories that occur unusually frequently or unusually infrequently in the English learners' discourse when compared with the language used by the native speakers of English in the sample. The research findings delineate the pedagogical merit of key domain analysis and thus help to inform English as a foreign language teachers and materials developers in the design of courses emphasising spoken interaction.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Discourse Analysis, Computational Linguistics, Grammar, Second Language Instruction, Teaching Methods, Material Development, Language Teachers, English, Native Speakers, Cross Cultural Studies","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom"},{"id":"EJ1059678","title":"The Influence of Group Formation on Learner Participation, Language Complexity, and Corrective Behaviour in Synchronous Written Chat as Part of Academic German Studies","author":"Fredriksson, Christine","description":"Synchronous written chat and instant messaging are tools which have been used and explored in online language learning settings for at least two decades. Research literature has shown that such tools give second language (L2) learners opportunities for language learning, e.g. , the interaction in real time with peers and native speakers, the written mode of language, and the time available for planning and monitoring utterances. However, since the majority of the empirical work on chat and instant messaging has been conducted under experimental conditions, relatively little research has investigated how interaction in chat influences language learning opportunities under the conditions of an online academic language course where students have unequal status because of their different language background and level of L2 proficiency. This article presents an explorative study of the interaction in chat in a web-based academic language course between students with different L1s and different levels of L2. The aim is to shed light on how student interaction in an institutional context benefits the language learning environment in a manner that promotes L2 learners' attention to linguistic items in their input and output, and that allow opportunities for functional practising. Based on a mainly quantitative analysis, this article illustrates how L2 learners' participation, the complexity of their utterances, and their opportunities for self-correction and corrective feedback are influenced by group formation.","subject":"German, Computer Mediated Communication, Group Dynamics, Second Language Learning, Synchronous Communication, Language Proficiency, Online Courses, Academic Discourse, Native Language, Educational Benefits, Interaction Process Analysis, Linguistic Input, Statistical Analysis, Error Correction, Feedback (Response), Native Speakers, Student Participation","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074883","title":"Attitudes towards Online Feedback on Writing: Why Students Mistrust the Learning Potential of Models","author":"Strobl, Carola","description":"This exploratory study sheds new light on students' perceptions of online feedback types for a complex writing task, summary writing from spoken input in a foreign language (L2), and investigates how these correlate with their actual learning to write. Students tend to favour clear-cut, instructivist rather than constructivist feedback, and guided self-evaluation through model solutions in online learning environments. However, the former type is too limited to tackle all dimensions of advanced writing. Constructivist feedback, in the form of guided modelling, allows addressing the higher-order concerns involved in summary writing. In addition, it is widely acknowledged that activating the zone of proximal development (ZPD) through cognitive involvement is beneficial to learning. To investigate students' learning from both types of feedback, a one-group pre-post-test intervention study was set up. Students attending a course on summary writing in L2 within a bachelor programme in Applied Languages (n = 38) followed an individual online learning module containing both instructivist fill-the-gap exercises and model solutions with constructivist guiding questions for self-assessment. The students' actual learning gain was measured through pre- and post-tests, and compared with their perceived learning gain, as expressed in self-evaluation. The comparison reveals a dichotomy between the students' observed learning curve and an underestimation of their own progress. This dichotomy was found to originate in a mismatch between their expectations towards the online learning module and the characteristics of the constructivist feedback conveyed. This mismatch can be attributed to three key factors: (1) evaluation, (2) linguistic focus, and (3) learner motivation.","subject":"Feedback (Response), Writing (Composition), Constructivism (Learning), Computer Mediated Communication, Student Attitudes, Writing Attitudes, Second Language Learning, Correlation, Writing Instruction, Trust (Psychology), Models, Undergraduate Students, Bachelors Degrees, Applied Linguistics, Problem Solving, Ability, Cognitive Development, Educational Benefits, Pretests Posttests, Intervention, Electronic Learning, Learning Modules, Writing Exercises, Self Evaluation (Individuals), Comparative Analysis, Learning Motivation, Blended Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]