[{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1109691","title":"Enhancing Learning Outcomes through Experiential Learning: Using Open-Source Systems to Teach Enterprise Systems and Business Process Management","author":"Jewer, Jennifer, Evermann, Joerg","description":"Enterprise systems and business process management are the two key information technologies to integrate the functions of a modern business into a coherent and efficient system. While the benefits of these systems are easy to describe, students, especially those without business experience, have difficulty appreciating how these systems are used to improve the efficiency of business operations. This paper reports on a project to provide experiential learning to beginning business students. We focus on open-source enterprise and process management systems to investigate whether the benefits can be provided even by small institutions and without a large investment into commercial systems. The results of experimental studies are provided and suggest that hands-on learning on open-source systems can lead to improved learning outcomes. The main contribution is the demonstration that educators need not shy away from experiential learning when faced with the obstacles that large-scale commercial enterprise systems may present, but can instead choose a &quot;bottom-up&quot; approach of easily integrating enterprise systems into the curriculum to benefit student learning.","subject":"Outcomes of Education, Experiential Learning, Management Systems, Business Administration Education, Open Source Technology, Efficiency, Small Businesses, Teaching Methods, Curriculum Design, Undergraduate Students, Foreign Countries, Statistical Analysis, Scores, Pretests Posttests, Factor Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Canada"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1120922","title":"Pedagogical Aspects of Voluntary School Work","author":"Mária Jármai, Erzsébet, Palányi, Ildikó Zsupanekné","description":"The economic importance of voluntary work has been exceedingly appreciated in the last few decades. This is not surprising at all, because it is highly profitable according to the related estimated data. There are 115,9 million people doing voluntary work only in Europe, which means that they would create the world's 7th biggest economy with EUR 282 billion value creation if they formed an individual state. The organizations know that voluntary work has several advantages apart from the economic benefits. It is profitable both for the society and for the individuals as well. Several researches have proven that voluntary work positively influences the development of the personality, because the key-competencies--such as: co-operation, empathy, solidarity, conflict handling, problem solving, etc.--expected in the labor market can be improved.","subject":"Foreign Countries, Volunteers, Labor Market, Labor Force Development, Informal Education, Service Learning, Student Attitudes, High School Students, College Students, Competence, Social Capital, Student Motivation, Age Differences, Required Courses, Literature Reviews, Questionnaires, Student Participation, Incidence, Likert Scales, Scores, Work Experience","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121045","title":"The Main Motivations of Ukrainian Students Who Choose to Study in Poland","author":"Rebisz, Slawomir, Sikora, Ilona","description":"Students' educational migration is one of the phenomena characteristic of the globalization processes. It has been growing dynamically since the 1970s. A number of young people studying abroad has grown globally from 0.8m in 1975 to almost 5m in 2014. It comes therefore as no surprise that educational migration has become a subject of many sociological and economic studies. Their authors usually use the push-pull factors model i.e. they investigate the factors that &quot;push&quot; students out of their own countries and those that &quot;pull&quot; them to the new place of study. Our research on foreign students in Poland has been approached from a similar angle. In fact, we set out to find an answer to the question &quot;What made foreign students from Ukraine leave their country and why did they choose to study in Poland?&quot; To find our answers we conducted questionnaire interviews on a random purposive sample of foreign students from Ukraine (N = 83). In addition, to avoid the risk that the resulting correlations were accidental and the knowledge yielded in this way false, we also used the triangulation procedure--a supporting, in-depth qualitative study involving a focus group. We altogether managed to hold 4 sessions. The results obtained in the questionnaire study and in the focus group sessions were sorted and analyzed statistically (quantitative and qualitative analysis), which allowed us to find out about the main motives influencing students' migration decisions as well as the factors &quot;pushing&quot; them out of Ukraine and attracting them to Poland.","subject":"Student Motivation, Student Attitudes, Study Abroad, Decision Making, Correlation, Student Mobility, Foreign Students, Foreign Countries, Questionnaires, Interviews, Focus Groups, Qualitative Research, Statistical Analysis, Student Recruitment","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland, Ukraine"},{"id":"EJ1121030","title":"The Development of Resources of Students in Adolescence as a Key Issue in Contemporary Education","author":"Gosk, Urszula, Kuracki, Kamil","description":"In the presented paper, the issue of recognition and building of resources in adolescent pupils was discussed, referring to salutogenic concept of A. Antonovsky and Conservation of Resources Theory of S. E. Hobfoll. Coming out from developmental pedagogy and positive orientation in social sciences, benefits of scientific and educational actions concentrated on identifying pupils' resources and supporting them in generating them, were shown. On the basis of Polish and foreign literature, empirical research treating about pupils' resource, was analyzed, with special attention put to the sense of coherence and its components, stress management and behavior fostering health.","subject":"Adolescents, Stress Management, Adolescent Attitudes, Secondary School Students, Correlation, Well Being, Health Behavior, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland"},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1077607","title":"Regression from Game-Oriented to Traditional School","author":"Westin, Thomas, Wiklund, Mats, Mozelius, Peter, Norberg, Lena","description":"Pupils in Sweden are socialized in commercial off-the-shelf games, and, therefore, game-oriented formal education can constitute a foundation for further socialization of pupils excluded in school. However, digital illiteracy and traditional views among school staff forced a regression from the game-oriented formal trial education in this study back to the traditional education form. Research questions were as follows: How did the pupils act upon the consequences of the regression? How can these acts inform the design of education in digital culture? These questions were addressed using ethnography over 3 years. The pupils' acts differed depending on their socialization in school and in games. While the game-oriented formal education included all in the socialization process, the regression caused half of the pupils to drop out. The pupils' acts are discussed with a conceptual framework. Conclusions show the need for digital literacy and understanding pupils' perspectives on education among school staff.","subject":"Foreign Countries, Secondary School Students, Games, Conventional Instruction, Socialization, Educational Change, Ethnography, Dropouts, Longitudinal Studies","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Sweden"},{"id":"EJ1077753","title":"Teaching Social Media Analytics: An Assessment Based on Natural Disaster Postings","author":"Goh, Tiong T., Sun, Pei-Chen","description":"Unstructured data in social media is as part of the &quot;big data&quot; spectrum. Unstructured data in Social media can provide useful insights into social phenomena and citizen opinions, both of which are critical to government policy and businesses decisions. Teachers of business intelligence and analytics commonly use quantitative data from sales, marketing, finance and manufacturing to demonstrate various analytics concepts in a business context. However, researchers have seldom used social media data to analyze social behavior and communication. In this study we aim to demonstrate an assessment structure for teaching social media analytics concepts with the goal of analyzing and interpreting social media content. We base this assessment on forum postings regarding two recent events: the Christchurch earthquake in New Zealand, and the Japanese earthquake and tsunami. The aim of the assessment is to discover social insights. We base the assessment structure on Cooper's Analytics Framework to cover such concepts as term frequency (TF), term frequency-inverse document frequency (TFIDF), data visualization, sentiments and opinions analysis, the Nearest Neighbor K-NN classification algorithm, and Information Diffusion theory. We review how the students performed on the assignment that used this assessment, and we make recommendations for future studies.","subject":"Foreign Countries, Social Media, Data Analysis, Natural Disasters, Visualization, Word Frequency, Content Analysis, Opinions, Information Theory, Social Behavior, Undergraduate Students, Educational Benefits, Business, Intelligence, Web Sites, Discourse Analysis, Altruism, Emotional Response, Computer Mediated Communication, Affective Behavior, Classification, Information Dissemination, Scores","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Japan, New Zealand"},{"id":"EJ1120970","title":"Medical Liability in the Light of New Hungarian Civil Code","author":"Barzó, Tímea","description":"The number of medical malpractice lawsuits filed each year in Hungary has considerably increased since the change of regime. The judicial decisions and practices on determining and awarding wrongful damages recoverable for medical malpractices in the Hungarian civil law have been developing for decades.","subject":"Foreign Countries, Medical Services, Legal Responsibility, Negligence, Court Litigation, Laws, Contracts, Patients, Risk Assessment","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1109684","title":"Introducing an M-Commerce Course into the Business Management Curriculum: Experiences and Recommendations","author":"Nandi, Santosh, Nandi, Madhavi L.","description":"Mobility has become an important extension to the business strategies of present-day organizations. Thus, organizations are increasingly seeking managers with knowledge of value chain related to mobile-oriented business activities, usually referred to as mobile commerce (m-commerce). Accordingly, business management schools are interesting in designing their curricula to respond to the need for m-commerce knowledge and, in particular, the scope of the content for an m-commerce course. The general conception of m-commerce is that it is a component of e-business or e-commerce. This paper presents the unique dimensions of m-commerce that makes it stand out as a separate course for postgraduate business management students. This paper also provides input in regard to the design and delivery of the course by drawing upon the recent teaching experience of the authors at a highly respected business school in India. The course design covers mobility-related technology elements as related to business in diverse industry segments and is expected to enable students to develop a suitable mobile strategy for a real-time business scenario. The course content was drawn primarily from research papers, industry reports, and examples of trending mobile applications. The pedagogy was a blend of lectures and classroom exercises on innovative case studies. The response of the students to the course indicated a high degree of satisfaction in regard to its relevance. The inputs provided in this paper are believed to serve as guidance to business management schools that are interested developing such a course.","subject":"Management Development, Business Administration Education, Business Schools, Teaching Experience, Foreign Countries, Telecommunications, Curriculum Design, Graduate Students, Course Descriptions, Industry, Course Content, Teaching Methods, Lecture Method, Case Studies, Student Attitudes, Handheld Devices, Information Technology","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"India"},{"id":"EJ1121007","title":"Social Participation and Health among Ageing People in East-Central Europe","author":"Makai, Alexandra, Prémusz, Viktória, Füge, Kata, Figler, Mária, Lampek, Kinga","description":"In this study we examined the health of the ageing population of East-Central Europe. Data derived from the 6th round of the European Social Survey. The aim of our research was to examine the most important factors that determine ageing people's health status. We paid particular attention to the social ties of our target group.","subject":"Foreign Countries, Geographic Location, Public Health, Aging (Individuals), Social Influences, Social Capital, Surveys, Self Concept, Socioeconomic Status, Older Adults, Social Life, Participation, Statistical Analysis, Individual Characteristics","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Europe, Slovakia, Slovenia, Hungary, Czech Republic, Poland"},{"id":"EJ1121031","title":"Voluntary Activity of Polish People and Its Motives in Recent Years: New Volunteering","author":"Kosewska, Bernadetta","description":"This article covers an issue or the phenomenon of volunteering. The introduction is a recall of a definition of volunteering. Then it shows the distribution of voluntary activity in different countries of the European Union in order to look at some aspects of the phenomenon in the microscale of one country--Poland. It shows the percentage of involvement of Polish women and men in volunteering, their age, their motives to work for others. It makes the reader to think about an innovative definition of volunteering.","subject":"Foreign Countries, Volunteers, Motivation, Individual Characteristics, Age","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland, European Union"},{"id":"EJ1120968","title":"Revealing the Reasons Leading to Students' Drop-Out at the College of Dunaújváros","author":"Szabó, Csilla Marianna, Bacsa-Bán, Anetta","description":"In the strategy &quot;Europe 2020&quot;, EU claimed the aims to increase the ratio of graduates among 30-34-year old people, which means the expansion of the number of students in higher education as well as the decrease of dropouts. This double purpose is considered to be a big challenge both for countries and for higher educational institutes. It could be stated that parallel with the increase of higher education enrolment, supporting students who have already been admitted to higher education must be emphasized so that they could absolve their subject and take their degree.","subject":"Dropout Characteristics, Dropout Research, College Students, School Holding Power, Dropout Prevention, Questionnaires, Academic Achievement, Exit Examinations, Performance Factors, Attribution Theory, Work Experience, Achievement Need, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"European Union, Europe"},{"id":"EJ1121040","title":"Eye-Tracking Analysis of the Figures of Anti-Smoking Health Promoting Periodical's Illustrations","author":"Maródi, Ágnes, Devosa, Iván, Steklács, János, Fáyné-Dombi, Alice, Buzas, Zsuzsanna, Vanya, Melinda","description":"Nowadays new education technologies and e-communication devices give new measuring and assessing tools for researchers. Eye-tracking is one of these new methods in education. In our study we assessed 4 figures from the anti-smoking heath issues of National Institute for Health Development. In the study 22 students were included from a 7th grade class of a Kecskemét primary school. Our results show that students concentrate on the text-part of the figures except if the picture is frightening. However if the text and the picture are not both frightening enough, the message will not be transferred to young students.","subject":"Foreign Countries, Educational Technology, Eye Movements, Smoking, Prevention, Health Promotion, Periodicals, Illustrations, Grade 7, Primary Education, Program Effectiveness, Textbook Content, Reader Text Relationship, Motivation, Fear","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120923","title":"Study of Emotional Intelligence Patterns with Teachers Working in Public Education","author":"Balázs, László","description":"The data necessary for the empirical research presented it this study were provided by 572 people, from altogether 26 schools. The schools included 18 primary schools, 7 secondary training institutions and 1 primary and secondary school. The major question of the study related to the pedagogues' emotional intelligence, more precisely if the teachers of different institutions showed any individual differences in their emotional intelligence patterns according to the given type of their school's organisational culture. We also examined if the nature of the organizational culture had any influence on the development of the individual's emotional intelligence pattern. On the basis of the results we can declare that the teachers of different institutions having their own particular organizational cultures evolve different emotional intelligence patterns. Accordingly, we can come to the conclusion that in the long term the organizational culture affects the evolution of the individual's emotional intelligence pattern and vice versa.","subject":"Foreign Countries, Emotional Intelligence, Elementary School Teachers, Secondary School Teachers, Individual Differences, Organizational Culture, Hypothesis Testing, Questionnaires, Measures (Individuals), Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120925","title":"Intercultural Education as an Imperative of Social Development","author":"Baça, Ferit","description":"The imperative need of a social coexistence among different groups of people is the implementation of the intercultural education. In these circumstances, school is the most important place and factor for pupils and students as future citizens to take the first knowledge-based on society, life and coexistence in a given country. On the other hand, all social-cultural school courses should be reviewed in accordance with western visions which accelerate the pace towards a future world without borders, despite different races and cultures. Thus, the content of such courses, such as history, geography, drawing, music and literature should occupy more important new notions and information about intercultural education and its role on a social development. Therefore, it is important for the given society, that all the schools' directors should pay more attention on entertainments about cultural activities among pupils and students as future citizens. The focus of this paper is the role and importance of intercultural education for the development of a social society.","subject":"Foreign Countries, Multicultural Education, Social Development, Social Values, Educational Trends, Global Approach","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Albania"},{"id":"EJ1121027","title":"Implementation of the Project &quot;Including Disabled Senior Citizens in Creative Activities in 2013-2015&quot;","author":"Ploch, Leszek","description":"This paper made an attempt to indicate the findings of the author's research from the experiences of the implementation of the project &quot;Including disabled senior citizens in creative activities in 2013-2015&quot;. The issues of disabled senior citizens have been an object of interest over the recent years though it still has not had a proper place in science and practice. In the situation of a painful lack of initiatives, the Foundation for Propagation of Disability Art and Culture of the in Warsaw, as the only institution for promoting creative activity of the disabled in Poland, undertook a number of activities in order to include this social group in the world of culture and art. It appears that participation in creative initiatives has a very positive effect on the quality of the social functioning of disabled senior citizens in their isolation from their own families.","subject":"Foreign Countries, Program Implementation, Inclusion, Disabilities, Older Adults, Creative Activities, Outcomes of Treatment, Educational Benefits, Individual Development, Participation, Motivation, Creative Development, Preferences","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Poland"},{"id":"EJ1121051","title":"Talent Support at Kaposvár University, Faculty of Pedagogy","author":"Bencéné-Fekete, Andrea","description":"The shared aim of the professors working at the Faculty of Pedagogy is to help their students find the field, in which they are able to show extraordinary achievements. They help the students recognize what they are talented in and provide them the necessary support to act on this field. The talented students are most often helped by pedagogues; however, no one deals with the issue of pedagogues, who are talented and fulfill their jobs on the highest level. At Kaposvár University, Faculty of Pedagogy a three-step talent support program--based on the Czeizel-talent model--and mentorship for talented pedagogues have been introduced. During the sessions of Csokonai Student Talent Support Program each student is granted with the possibility to participate in research method lectures, rhetoric and personal development trainings and sessions how to create presentations. This new, three-step method has initiated cooperation in professional questions among not only students, but also pedagogues on our faculty.","subject":"Foreign Countries, Talent Development, Mentors, Preservice Teachers, Preservice Teacher Education, Talent Identification","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121048","title":"Towards a Methodology to Identify a Talent by Using Psychological Cognitive Prototyping","author":"Hammer, Matthijs H. M.","description":"Since education became an important aspect of society, teachers have a prelove for highly talented students. Especially young talented people relish profound attention of universities, firms, music ensembles, sports societies and artist groups. In higher education, students are encouraged to develop their unique strong point, named as talents. Around the globe, universities, institutes of higher and professional education provide students with programs for talent development and exploitation. Practitioners and educators complain on a regular basis that students rarely aware of what their talents are. It is experienced as difficult to identify them. This paper explores the possibility for mechanisms to identify, or recognize, a talent. Scholars and consultants developed many instrument on the development and exploitation of talents. But how can talents be identified? In this paper the fuzzy front end of talent recognition will be fostered. It is advocated that the psychological cognitive prototyping principles can be applied to identify the prototype of a talent.","subject":"Talent Identification, Psychomotor Skills, Psychological Patterns, Individual Characteristics, Academically Gifted, Foreign Countries, Models, Cognitive Ability, Group Discussion, Undergraduate Students, Maturity (Individuals)","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1120969","title":"Dilemmas in the Legal Treatment of the Status of People Living with Disabilities","author":"Laki, Ildikó, Tóth, László","description":"The legal treatment of disability affairs carries in itself an inherent contradiction due to the nature of modern society and free-market economy. On the one hand both the historically developed notions of essentialism and on the other the particular-functional definition of manhood drawing its roots from the established democratic order and market economics are present simultaneously. However, within the current order of things there is an unbridgeable divide between them. Nevertheless, with the progression of time there is a slow gradual shift discernible away from the functional definition with the parallel strengthening of the essentialist approach. This shift is further exaggerated by the more widespread acceptance of the rights of self-determination and the provision of opportunities for the disabled, the emergence of social self-determination in case of a population subgroup living under special conditions. For the proper interpretation of the currents in the evolution of legal treatment of disabled people it would be indispensable to institute a proper social-discourse analysis, which, however, exceeds in scope its narrowly defined task.","subject":"Disabilities, Legal Problems, Legal Responsibility, Social Problems, Integrated Services, Related Services (Special Education), Delivery Systems, Civil Rights, International Law, Success, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Europe"},{"id":"EJ1121042","title":"Professional Attitudes of the Teachers in Implementation of a School-Based Programme about Prevention of the Use Psychoactive Substances in 5-7 Grade","author":"Kozhuharova, Penka Petkova","description":"The subject of the research is the planning, implementation and evaluation of the program about prevention of the use of psychoactive substances among students 5-7 grade. The study was conducted by survey method with 314 teachers who teach in twenty-six schools. The qualification of the teachers to work with the program about prevention was studied in the lesson of the class. We studied the forms, through which the preventive activity, topicality, the methods used and course curricula for hours in individual classes were implemented. It was found that there was an interaction between the various recipients of the preventive activity. The preparation and qualification of the teachers to work on a program for the prevention of the use of alcohol and tobacco products was studied in the lesson of the class. We pointed out some problematic aspects and guidelines for development of the preventive activity.","subject":"Foreign Countries, Secondary School Students, Grade 5, Grade 6, Grade 7, Secondary School Teachers, Teacher Attitudes, Program Implementation, Program Evaluation, Prevention, Drug Abuse, Health Education, Teacher Surveys, Drinking, Smoking, Educational Planning, Likert Scales, Risk, Teaching Methods, Partnerships in Education","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bulgaria"},{"id":"EJ1121037","title":"Compulsory Book Reading at School and within Leisure","author":"Pavlovic, Slavica","description":"This paper deals with attitudes of secondary school pupils towards compulsory book reading at school, being the integral part of the subject Croat language and literature teaching subject, and its possible impact on their book (not-)reading in their leisure time. It is based on the research carried out through five-point Likert-type scale in secondary schools in Mostar (Bosnia and Herzegovina), in the second half of 2014. The research was conducted on the convenience, stratified sample consisted of 260 secondary school pupils, attending the final class of grammar (130) and vocational (130) school. The results obtained could give an insight into the book reading culture of secondary school pupils within their leisure related to their experience of compulsory book reading at school. It results that compulsory book reading has still been an uninteresting school task for both the strata of the research sample. Moreover, it results that compulsory book reading at school has a certain influence on book reading decrease in both sample strata's leisure time. However, some guidelines how to increase the students' interest in compulsory book reading at (secondary) school as well as in book culture within their leisure time are given in this paper.","subject":"Books, Recreational Reading, Secondary School Students, Student Attitudes, Foreign Countries, Likert Scales, Reading Habits, Reading Interests, Student Surveys","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bosnia and Herzegovina"},{"id":"EJ1121019","title":"Materialistic Thinking and Its Mental-Hygienic Implications among Students of Budapest Business School","author":"Gombás, Judit","description":"Previous research with extrinsic (&quot;materialistic&quot;) and intrinsic (&quot;non-materialistic&quot;) life goals suggest that intrinsic aspirations (e.g. relationships, community service, personal development) are associated with a better functioning, mentally and physically more healthy personality. In this survey 198 undergraduate students of BBS were examined by the Aspiration Index questionnaire in order to determine the pattern of extrinsic and intrinsic life goals in their personality, to find relationship between personal background-factors and these aspirations, and to compare the attitudes of the young population to a less homogenous reference group. Compared with the reference group, young women of BBS find all goals more important, except for social commitment and general intrinsic aspiration. Both BBS female and male students were found more materialistic. The materialistic attitudes are significantly stronger among the students of business programs, but not among the students of humanities (andragogy). In conclusion, the students of BBS tend to accept more extrinsic life goals than members of the external reference group. These attitudes are influenced by the generational properties of this young population and by the educational program they attend (business or humanities). The extrinsic attitudes do not serve the individuals' personal development or happiness; neither do they serve the interests of society. The new paradigms of the future business world are not yet interiorized.","subject":"Foreign Countries, Business Schools, Mental Health, Undergraduate Students, Aspiration, Student Surveys, Personality, Background, Student Attitudes, Comparative Analysis, Gender Differences, Humanities, Questionnaires, Student Characteristics","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary (Budapest)"},{"id":"EJ1120991","title":"Everyday Physical Activity of Students in Nyíregyháza","author":"Fintor, János Gábor","description":"The popularity of physical education lessons has already been demonstrated by a lot of essays, however, it has also been revealed that this popularity, as well as the frequency of doing sports, tends to decrease at later ages of life. Pursuing sports has a positive effect on academic performance. Introducing PE as an everyday lesson at schools was a milestone in physical education. Provided the aims are realised successfully, the general state of health of students can show a favourable change. The aim of our research, on the one hand, is to reveal how important physical education is as contrasted with other school subjects, according to those students asked. On the other hand, we aim to examine how the certain positive and negative attitudes of the subjects of our study appear in the resulting figures. The research was conducted in the form of self-completion questionnaires in four different funded institutions in Nyíregyháza (n = 285), in May, 2014. In the course of evaluation, we have used multivariate function analysis as well as frequency research and cross table reference. Participants mainly regard PE as important as other school subjects, however, boys significantly regard it more important than girls do. Those who do sports on a regular basis were more likely to agree that PE lessons are conducted in a friendly atmosphere than those who do sports less. Significantly, boys tended to agree with positive statements about sport.","subject":"Foreign Countries, Physical Activities, Physical Activity Level, Physical Education, Student Attitudes, Relevance (Education), Questionnaires, Multivariate Analysis, Gender Differences, Elementary School Students, Preferences, Exercise Physiology, Factor Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120993","title":"Possibilities in Anaemia Prevention during Pregnancy through the Basic Health Care System","author":"Karácsony, Ilona, Albrecht, Hanna, Brantmüller, Éva","description":"In case of pregnancies, one of the most common pathological conditions in internal medicine is aneamia with iron-deficiency. Furthermore, iron deficiency may also affect the mother and the fetus negatively. We wanted to find out which group of expectant mothers are mostly affected, which factors influence the development of aneamia. It was also observable in the case of those living at higher living standards that they take fetus-protecting vitamins with a significantly higher frequency before the pregnancy than those living at lower living standards. According to our research data, 67% of the sample developed aneamia. In our research the risk group consisted of young, vegetarian expectant mothers with low education and the multiparas. After conception, the timing of gynaecological consultation was appropriate and the majority of the sample had a clear idea of the ways of preventing aneamia. However, prevention was only realized in practice--based on the criteria--only with a frequency of 12%. It would be important to consciously plan pregnancy. After taking expectant mothers into care, they should--as soon as possible--be screened for the deficiency and in need, supplements should be started. Risk groups should be given greater attention. In their case, a routine supplement of iron would be desirable even before the development of a deficiency. During pregnancy care, awareness must be raised and an iron-rich diet should be established at the beginning. Beyond these, general practitioner, health visitors have the opportunity--through the close relationship with the expectant mothers--to control laboratory tests, provide appropriate information, recommend vitamin preparations as well as check taken medications.","subject":"Pregnancy, Prenatal Influences, Prenatal Care, Prevention, Mothers, Case Records, Socioeconomic Status, Dietetics, Eating Habits, Disease Incidence, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121032","title":"The Examination of the Factors Determining Career Engagement for Students Preparing for a Social Job","author":"Juhász-Klér, Andrea, Varga, Erika","description":"The higher education courses for social experts started more than 25 years ago in Hungary. Since then more than 20 thousand students have earned a degree in social areas. Some of them quit their original jobs whereas a lot of these specialists still provide support as human assistants and regard their profession a career. Due to the huge amount of experience accumulated in both education and practice since then, in our empirical research an answer was sought to the question which personal and professional competencies determine the long-term engagement to a career and how the competency experience of the students correlates with their further career aspirations. In the research nearly 500 responses from students from 8 different Hungarian higher education institutions were analysed by applying questionnaires and tests accepted in international practice together with our own measures. Data were collected about the students' career decision self-efficiency experiences, their personality traits and also about the question how they see their future profession. Based on our results the students who had a definite idea of their future professional career even during their studies and were determined with improved professional and personal competencies during the training made up a distinct group and were more dedicated to their career. On the basis of our analyses it was empirically proved that the training types which provide opportunities for the conscious monitoring of personal and professional competencies by encouraging the student with their career adjustment are of great significance.","subject":"Foreign Countries, Career Choice, Higher Education, Occupational Aspiration, Questionnaires, Self Efficacy, Personality Traits, Expectation, Hypothesis Testing, Correlation, Educational Attainment, Parent Background, Self Concept Measures, Decision Making, Vocational Maturity, Personality Measures, Goal Orientation, College Students","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121046","title":"Organization of Physical Activities as a Precondition of Quality Development of Motor Abilities of Pre-School and School Children","author":"Markovic, Živorad, Kopas-Vukašinovic, Emina","description":"In their work authors consider the significance of the organization of physical activities for the development of abilities of pre-school and school children. Led by theoretical basis that physical development of children represents the basis of their whole development, and that &quot;fine motor skills&quot; are determined by the development of its large motorics, the authors point to the significance of the content and structure of physical education programme in preschool institutions and younger age school classes. It is evident that the effects of cultivating of children development during preschool period can be seen in younger primary school classes. The goal of this research was to determine if and how much the different organization of preparatory part of physical education lesson for younger school children, determines the differences in the development of their motor abilities. By the use of experimental method, the effects of prolonged preparatory part of a lesson in younger school classes. This part was realized through complex of exercises which were supposed to have influence on transformation of motor abilities in relation to the structure with standard duration of certain parts of a lesson. It is determined that certain increase in body movement of students during physical activity can significantly contribute to better development of motor abilities. These abilities determine correct physical development and strengthening of health, which determines general aim of physical education.","subject":"Psychomotor Skills, Physical Activities, Preschool Children, Physical Activity Level, Physical Education, Foreign Countries, Experimental Groups, Control Groups, Statistical Analysis, Elementary School Students","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Serbia"},{"id":"EJ1121049","title":"The Effect of a Complex (3-Week) Therapy on the Hip and Knee Joints in Obese Patients","author":"Tóvári, Anett, Hermann, Mária, Tóvári, Ferenc, Prisztóka, Gyöngyvér, Kránicz, János","description":"Currently, overweight and obesity are the most widespread problems in life-style having a significant impact on everyday life, and thus, conduct of life. Further contributory problems may develop in patients with weight problems: deformities of the joints and skeleton (coxarthrosis and gonarthrosis), circulatory problems and arrhythmia. Overweight definitely has an effect on motion: some people are not involved in certain activities as it is impossible for them because of their weight problem. Thus, even more health problems are generated because of the overweight. The first question arising in discussing the actuality of this issue is what effect the applied therapy (massage, therapeutic exercises, electrotherapy and balneotherapy) has on the knee and hip joints of patients with weight problems hospitalised in our Institute for a 3-week complex therapy. Based on my prior hypothesis, positive changes are detected in a minimum percentage in the condition of overweight or obese patients. My hypothesis was that the range of flexion and extension of the hip and knee joints would improve compared to other movements. Based on the results of the studied population (n = 30), my hypothesis seems to be proven. After the 3-week complex therapy of obese patients, positive changes were found in the prearranged assessments and tests, thereby improving the general health, life-style, life quality and mental status of the patients. After the end of the complex therapy, patients were provided life-style counselling and exercise schemes to be performed in their home to maintain the achieved health status.","subject":"Obesity, Human Body, Pain, Life Style, Therapy, Program Effectiveness, Intervention, Hypothesis Testing, Rehabilitation, Foreign Countries, Counseling, Exercise, Quality of Life, Questionnaires, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120992","title":"Hungarian Dimensions of Physical Activity Based on Studies at School Ages","author":"Cselik, Bence, Szmodis, Márta, Szots, Gábor, Ács, Pongrác","description":"It is an old pursuit to find the balance between nature and society (within the individual and the sum of people). In order to talk about a healthy society, it is necessary to have the people making up the society healthy, too. The health condition of the individuals affects the society, creating a close connection among individuals and society. Health, mental and physical well-beings of members of society affects the economy, since a healthy workforce leads to developing economy, which hence can provide the requirements and conditions that ensure a mentally and physically healthy way of living for the society. Sport, everyday exercise, therefore regular training can also play an important social role, and can greatly contribute to social well-being. Decreased physical activity, sitting lifestyle are both specific traits of economically developed countries, and turns into a more and more threatening public health problem world-wide, which contribute to the development or aggravation of such chronic diseases and health damages, like morbid obesity, heart diseases, diabetes, hypertension, locomotor diseases, malignant tumors, and depression. The topic of our research is related to mainly the subject of primary school healthcare programs. The measurements have been taken in 12 different educational institutions, which included primary, secondary, vocational schools, and a 6-grade school. The actuality of the topic is proven by the increased obesity appearing at more younger ages, and we intend to shed some light on the fact that with a good healthcare strategy and short-term goals we can achieve positive results shortly on the fields of school healthcare.","subject":"Foreign Countries, Physical Activity Level, Physical Activities, School Health Services, Elementary School Students, Health Programs, Experimental Groups, Control Groups, Obesity, Disease Incidence, Cohort Analysis, Age Differences, Intervention, Health Promotion, Health Conditions, Health Related Fitness, Gender Differences, Institutional Characteristics, Questionnaires, Student Surveys, Predictor Variables, Secondary School Students, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120994","title":"Mental Hygienic Aspects of Animal Assisted Education","author":"Takács, István, Szalai, Katalin","description":"The Institution for Special Education at the Faculty of Pedagogic of the University of Kaposvár has been engaged in animal assisted activities for about three years. Our most recent research program was conducted for over two month in the Spring of 2014 with the involvement of 66 children--all kindergarten and elementary school age--11 special educators, physicians, psychologists, special educators, teachers, and ethologists. The primary focus of our research was the development (and examination) of memory; however, observations with ethological and mental hygiene angles were a natural segment of our work. A significant part of the observations pointed to factors that both the children and their educators have experienced: the acceptance of each other, an increased level of tolerance, and an increased attention level towards the partner (human and animal). The teachers gave account of their respective observations in a small conference at the end of the last school year. Researches were offered a glimpse into the unique world of the relationship between a part of &quot;living nature&quot;--the pygmy rabbit in our case--and humans. During the 12 sessions of the training our colleagues have made observations that could serve as basis for a new system of paradigms of animal assisted pedagogics in the future. Our experience can also be re-considered with aspects of remedial pedagogics: we are convinced that animal assistance can become an accentuated part of the care of children and students with impairments. This is also implied by the fact that preparatory works for the continuation of this research at a kindergarten and at a school are already in progress.","subject":"Foreign Countries, Educational Research, Mental Health, Pilot Projects, Control Groups, Experimental Groups, Ethology, Animal Behavior, Ecology, Early Childhood Education, Educational Practices, Observation, Interaction Process Analysis, Qualitative Research, Children, Intelligence Tests","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120995","title":"Relation of Health Condition and Quality of Life: Examination of the Quality of Life of the Disadvantaged Population in Nyíregyháza by the FT Quality of Life Index","author":"Jávorné-Erdei, Renáta, Takács, Péter, Fábián, Gergely","description":"Improving the health of the population, stopping and changing the disadvantage trends have long been one of the health policy objectives in the regions. Unfortunately, in spite of the declared goals Hungary is far away from giving priority to health issues as they are not given proper attention either on individual or societal level. In modern societies local communities play an increasingly important role in the development of quality of life. Their activity, their influence over the power structures become dominant. Quality of life is made up of objective and subjective components. Their important sub-areas are health, financial situation, income situations, housing and social relationship. Quality of life studies are the most frequent health-related research studies, the most remarkable results have been achieved here. Health-related quality of life is one of the most important and maybe the most frequently researched dimension of quality of life showing how much health status contributes to the welfare of the individuals. The primary objective of the research studies the improvement of the health status of the population and within it the health status of the individual as well as the reduction of health inequalities can be designated. The improvement of the quality of life can be rationalized as health benefit for the society. Its two main components are the extension of the life expectancy and the increase in numbers of the resulting years. The health of the Hungarian population is said to be unfavourable in international comparison and it can also be stated that it is significantly poorer than it could be expected according to the socio-economic development level.","subject":"Health Conditions, Quality of Life, Disadvantaged, Social Indicators, Life Satisfaction, Questionnaires, Health Education, Community Surveys, Public Health, Foreign Countries, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1121012","title":"Comparison the Psychological Wellbeing of University Students from Hungary and Romania","author":"Barth, Anita, Nagy, Ildikó, Kiss, János","description":"The results obtained in our research of mental distress indicators and results of conflict management strategies are consistent with the results of international studies. Students participating in the study (N = 237) reached the highest average results in the field of personal growth, while we measured the lowest value in the fields of autonomy and the dominance of the environment. Among the mental distress indicators the students gave the highest scores for the stress. The frequency examination showed the results of the participants to fall to 40.9% of moderate-severe and severe extreme range. While among the genders, women indicate much higher stress levels. In addition, the students preferred the avoiding conflict management strategy in preference to the other four strategies. While we compared the students from the two countries we found a significant difference between the survey field of autonomy and purpose in life. We also found a notable difference among the mental distress indicators. While the students of the University of Debrecen were moderate, the students of the universities of Oradea fell in the &quot;slight&quot; area (in the range of stress). For the usage of conflict management strategies we found no significant differences between the two countries' students. The students from both countries preferred the avoiding strategy. This study similar to many national and international studies indicates the high level of stress among the students. One of the most important task of a higher education institution should be the protection of the students' mental health which would lead to an improvement on well-being and that would cause the lowering of the stress level.","subject":"Comparative Analysis, Well Being, College Students, Foreign Countries, Psychological Characteristics, Student Surveys, Questionnaires, Mental Health, Mental Disorders, Depression (Psychology), Anxiety, Anxiety Disorders, Research Methodology, Higher Education, Conflict Resolution, Stress Variables, Stress Management, Likert Scales, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary, Romania"},{"id":"EJ1121003","title":"Development of Walking and Self-Sufficiency Ability Related to Nutrition among People with Down Syndrome","author":"Brantmüller, Éva, Gyuró, Monika, Karácsony, Ilona","description":"Development of the walking ability and self-care of patients with Down syndrome is affected by their body weight determining their lifestyle to a great extent. Objectives: The study aimed at the determination of body mass index for persons living in residential institutions and families, exploration its impact on walking and self-care as two, objective factors of life quality. Method: Data collection of persons aged 3-35 with Down syndrome living in families covered seven counties, while those of living in residential institutions covered thirteen counties in Hungary. In the 183 cases studied 76 people in residential institutions, 107 people lived in families. The cross-sectional study was processed by non-random sample selection. The questionnaires were filled out by health visitors and care takers edited by their own. Results: 50.6% of adults and 26.1% of children belonged to the overweight or obese category. Their residence showed a significant correlation with the body mass index (p&lt; 0.001). Overweight and obese persons in families, while thin ones were more prevalent in institutions. Regarding the walking ability and self-care of the persons living in families a significantly higher level of development was achieved (p&lt; 0.001). Walking ability (p = 0.001) and self-care (p = 0,008) were worsened by less body weight significantly, while overweight or obesity influenced it less negatively. Discussion: The claim is not further acceptable whereas persons with Down syndrome are more prone to obesity than average people. However unfavourable weight gain in adults draws attention to the necessity to a healthy diet and regular exercise. The people living in residential institutions with significantly lower body mass index and the associated low development of walking ability and self-care envisages an urgent reform of residential institutions. Life in the institutions negatively affects the walking ability and self-care, and thus significantly reduces the quality of life of persons with Down's syndrome.","subject":"Personal Autonomy, Physical Activities, Nutrition, Down Syndrome, Questionnaires, Obesity, Body Weight, Life Style, Body Composition, Daily Living Skills, Residential Care, Family Environment, Case Studies, Caregiver Attitudes, Health Personnel, Correlation, Foreign Countries, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120999","title":"The Investigation of Mobbing Events Taking Place at Higher Education Institutions in Turkey Considering the Reflections on Media","author":"Çubukçu, Zühal, Girmen, Pinar, Dönmez, Ayse","description":"The business-life related competition established in modern communities has also brought about some other problems. The attacks and intimidation attempts have introduced the term of &quot;mobbing&quot; which is defined as regular and continuous psychological violence faced by people always trying to produce and win from those who they work with. The term of &quot;mobbing&quot; has recently become a popular academic issue which has been sophisticatedly handled in relevant literature. Mobbing is defined as the act of continuous and systematic intimidation purposefully performed by either some employees or employers on some employees through emotional violence. As mobbing is considered to be significant for both corporate and employee, the starting point of this study was to investigate how mobbing acts are reflected on newspapers as they are mass communication means. One of the most important means of media is print media. Print media is the first means of media when mentioned about media. Newspapers are means through which people are always kept up to date about the latest news in civilized societies. With this regard, the most basic purpose of this study is to investigate the news about the mobbing events experienced in higher education system under the light of national policy documents and reports. The study was carried out based on a qualitative approach. The news released in print media was chosen purposefully as print media means report news in a detailed way, have an evidential value and can be read again on demand. The research group in this study consists of the mobbing news released on Hurriyet, Sabah and Zaman which are newspapers published in Turkey between the years of 2009-2013. These newspapers were purposefully chosen based on criterion sampling method. The most basic understanding underlying this sampling method is to study on all cases which meet the standards set prior to the start of the study. The newspapers mentioned above were chosen considering that they are published nationally, reference newspapers and belong to different publication groups. The data used in this study was taken from the archive of the three newspapers. When the archives of the newspapers was scanned, the word &quot;mobbing&quot; was taken as key word for the search. In qualitative researches, newspapers are considered to be public archive and used as reference documents. The data obtained was grouped depending on the newspapers which it was taken from, on the year of publication, on where they took place, on the gender of the victims and on who the sufferers are.","subject":"Foreign Countries, Bullying, Newspapers, Higher Education, Qualitative Research, News Reporting, Violence","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1121034","title":"A Comparative Study of Breakfast Habits of Romanian and Spanish Adolescents Enrolled in Southern Spain Schools","author":"Soriano-Ayala, Encarnación, Cala, Verónica C.","description":"Introduction: Globalization has favored intra-European Commission (EC) and extra-EC migration to Spain. One of the most numerous cultural groups that have settled in the southern Spain is from Romania. Coexistence, especially in schools, has made us become interested in knowing the eating habits at breakfast of Romanian and Spanish populations. Numerous studies show that the food intake at breakfast, mostly made before leaving home, has an incidence on the physic wellbeing of adolescent throughout the day. The processes of acculturation are also inseparable from the eating habits, health and life, that maintain the migrant teenagers. Breakfast is analyzed as one of the habits more associated with diet quality; paradoxically, one of the findings of our study, many adolescents do not take a proper breakfast every day. Objectives: The study analyzes the characteristics and the main cultural and gender differences in the implementation of breakfast: its maintenance or omission in young autochthonous and immigrants of Romanian origin in the southeast Spanish schools. Design. This is a cross-sectional study with a cluster sampling in two Primary schools and seven Secondary schools. The instrument applied was an adaptation of the KIDSCREEN-27 questionnaire. Sample. It has been formed by 1472 students between 11 and 18 years old; nationality: 1315 were Spanish and 157 were Romanians. Data analysis. Descriptive and differential analyses using the chi-square and U of Mann-Whitney statistics. Results: In the study we identified 1.2% of Spaniards and 3.3% of Romanians who either skip breakfast or do not eat foods throughout the morning. The main breakfast foods of the Spanish students are dairy, bread and cereals, cookies, juice and olive oil; for the Romanian students the basic foods at breakfast are cereals, dairy products, juices, biscuits and jams. We have found significant differences between the two compared cultural groups. We also found significant differences between the food eaten by men of the two cultural groups (Spanish and Romanian) and by the food eaten by women (Spanish and Romanian) in the breakfast food. Conclusions: The results show the need to further promote and implement educational programs that encourage students to make breakfast before leaving home. Also, it is necessary, they take care of the intake of the right foods to start the day and contemplate this habit from a transcultural and gender approach. Significant differences were identified in the breakfast practice food by both genders and cultural groups.","subject":"Adolescents, Foreign Countries, Comparative Analysis, Eating Habits, Food, Immigrants, Statistical Analysis, Adolescent Attitudes","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Spain, Romania"}]