[{"id":"EJ1047664","title":"EFL Writing Revision with Blind Expert and Peer Review Using a CMC Open Forum","author":"Wu, Wen-Chi Vivian, Petit, Emily, Chen, Ching-Huei","description":"This exploratory computer assisted-language learning (CALL) study used a computer-mediated communication (CMC) interface to allow English as a foreign language (EFL) writing students in classes at two universities to give each other anonymous peer feedback about essay-writing assignments reacting to selected news stories. Experts also provided feedback review. Follow-up questions were facilitated by the interface. The students felt that they benefitted from the instructional design, but found that the peer review focused most on things like grammar whereas the experts focused on organization and structure, making the expert feedback more valuable. Researchers found that more complex issues discussed in the source news articles resulted in lower outcome scores, based on a rubric, than did source material simpler issues. The study also compared performance of students with higher and lower ability and evaluated the quality of the review comments. Conclusions and recommendations for practice are provided. This study is significant because it used CALL\/CMC technology to provide online interactivity between students and reviewers in an open forum that allowed students to seek follow-up clarification to the comments of reviewers. The review process, therefore, was not a one-way anonymous communication from reviewer to student but rather allowed interactive discussion of the points and suggestions made by the reviewers.","subject":"Computer Mediated Communication, Grammar, Scores, English (Second Language), Second Language Learning, Feedback (Response), Essays, Writing Assignments, Second Language Instruction, Instructional Design, Scoring Rubrics, College Students, Statistical Analysis, Qualitative Research, Focus Groups, Interviews, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059285","title":"Interactions between Text Chat and Audio Modalities for L2 Communication and Feedback in the Synthetic World &quot;Second Life&quot;","author":"Wigham, Ciara R., Chanier, Thierry","description":"This paper reports on a study of the interactions between text chat and audio modalities in L2 communication in a synthetic (virtual) world and observes whether the text chat modality was used for corrective feedback and the characteristics of the latter. This is examined within the context of a hybrid content and language integrated learning design workshop. This course involved 17 students of architecture whose L2 was either French or English and for which the synthetic world environment Second Life was employed for distance language sessions. Using multimodal transcriptions of the interaction data from these sessions, it was found that text chat was employed for content-based interaction concerning the task as well as for feedback concerning non-target-like errors in the audio modality. Feedback predominantly concerned lexical errors and was offered in the form of recasts. The multimodality of the environment did not appear to cognitively overload students who frequently responded in the audio modality to corrective feedback offered in the text chat. The study highlights the need to train language tutors who wish to exploit synthetic worlds to use the text chat in parallel with the audio to support learners' verbal production with respect to verbal participation and proficiency.","subject":"Computer Simulation, Social Systems, Internet, Computer Mediated Communication, Handheld Devices, Written Language, Telecommunications, Second Language Instruction, Auditory Stimuli, English, French, Nonverbal Communication, Feedback (Response), Discourse Analysis, Interaction, Interaction Process Analysis, Electronic Learning, Undergraduate Students, Architectural Education","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051437","title":"From Web-Based Readers to Voice Bloggers: EFL Learners' Perspectives","author":"Huang, Hsin-chou","description":"With the advancement of such Web 2.0 applications as weblogs, language learners have more opportunities to use a target language for communication purposes and to experience peer collaboration and interaction. In the search for ways to augment an EFL curriculum in which speaking practice is limited but the demand for improving oral proficiencies is high, this study explored the use of voice blogging to develop communication skills, analyzed the stages of students' blogging efforts, and investigated students' perceptions of this authentic language experience. Seventy-four intermediate EFL learners from two Freshman English classes at a national university in Taiwan participated in this study. During the semester-long experiment, students read online materials and used an instructional blogging site constructed by the teacher-researcher to post voice blog entries and comment on peers' blog posts. The recursive four stages of their blogging efforts were: reading to learn, planning and organizing, speaking, and sharing. In a post-task survey and in semi-structured interviews, students said they felt that the process of producing voice blog entries facilitated language learning, enhanced knowledge construction, and promoted social networking. Students also offered suggestions for ways to improve the project, such as teaching more online search skills, providing better online recording mechanisms, and setting up a combination of face-to-face and online interactions. This study's findings and suggestions for future voice blogging projects can serve as a template for integrating voice blogging into the EFL curriculum.","subject":"Web 2.0 Technologies, Semi Structured Interviews, Electronic Publishing, English (Second Language), Second Language Learning, Surveys, Foreign Countries, College Freshmen, Language Proficiency, Oral Language, Computer Mediated Communication, Language Processing, Student Attitudes, Social Networks, Search Strategies, Second Language Instruction, Teaching Methods, Computer Assisted Instruction, Web Sites, Feedback (Response)","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059266","title":"I Help, Therefore, I Learn: Service Learning on Web 2.0 in an EFL Speaking Class","author":"Sun, Yu-Chih, Yang, Fang-Ying","description":"The present study integrates service learning into English as a Foreign Language (EFL) speaking class using Web 2.0 tools--YouTube and Facebook--as platforms. Fourteen undergraduate students participated in the study. The purpose of the service-learning project was to link service learning with oral communication training in an EFL speaking class by having each student create two YouTube videos in which they made informative presentations about the university (e.g., transportation system) and the city (e.g., sightseeing spots) in English to international students on campus. A Facebook community was established as a forum for students to share their videos with the international students and peers. The results suggest that the project enhanced EFL students' public speaking-related skills (e.g., idea and content development, and pronunciation), built their confidence in speaking English, and allowed them to develop their own learning process and strategies. Moreover, Web 2.0 tools endow service learning with new possibilities of reaching a greater number of the target audience and provide the members of the community with alternative means of communication.","subject":"Service Learning, Web 2.0 Technologies, English (Second Language), Second Language Learning, Oral Language, Learning Processes, Learning Strategies, Video Technology, Pronunciation, Foreign Students, Peer Relationship, Teaching Methods, Self Efficacy, Computer Assisted Instruction, Case Studies, Undergraduate Students, Foreign Countries, Surveys, Likert Scales, Student Attitudes, Reflection, Essays, Interviews, Outcomes of Education, Learning Theories, Qualitative Research, Dialogs (Language), Privacy, Computer Mediated Communication, Learning Experience","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077721","title":"A Virtual Walk through London: Culture Learning through a Cultural Immersion Experience","author":"Shih, Ya-Chun","description":"Integrating Google Street View into a three-dimensional virtual environment in which users control personal avatars provides these said users with access to an innovative, interactive, and real-world context for communication and culture learning. We have selected London, a city famous for its rich historical, architectural, and artistic heritage, as the location of choice for culture learning. Using avatars, learners walk the virtual streets of London under the guidance of a native English-speaking instructor, and interact with each other using text and voice chat functions. The study examines the effects of this virtual environment on culture learning. Specifically, a qualitative case study combined with a time-series design is used to investigate the virtual context's impact on culture learning in terms of learner knowledge and attitudes, and to track associated change processes across the three research phases (baseline, treatment, and maintenance). The results show that all four English learners involved in the study benefitted from their cultural immersion, to varying extents, in the virtual environment. Four contributing learner factors, namely linguistic proficiency, motivation, character traits, and attitudes were found to correspond to the learners' levels of acquaintance with the target culture.","subject":"Geographic Information Systems, Case Studies, Qualitative Research, Language Proficiency, Computer Simulation, English (Second Language), Second Language Learning, Learning Motivation, Personality Traits, Student Attitudes, Second Language Instruction, Foreign Countries, Native Speakers, Computer Mediated Communication, Cultural Education, Teaching Methods, Graduate Students, Multiple Choice Tests, Identification, Pictorial Stimuli, Student Evaluation, Statistical Analysis, Test Validity, Observation","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom (London)"},{"id":"EJ1077717","title":"Applying Role-Playing Strategy to Enhance Learners' Writing and Speaking Skills in EFL Courses Using Facebook and Skype as Learning Tools: A Case Study in Taiwan","author":"Yen, Yen-Chen, Hou, Huei-Tse, Chang, Kuo En","description":"English as a foreign language (EFL) instruction faces many challenges in Asia because of many cultural and environmental factors, such as the lack of interactive speaking environments, emphasis placed on test scores, and foreign language anxiety. The purpose of this research is to conduct an EFL instructional course by integrating Facebook (asynchronous online discussion) and Skype (synchronous online discussion) as platforms through which students perform role-playing based learning activities and to observe the effects of the course on the challenges mentioned above. The study consists of 42 participants who are enrolled in an English conversation course in a business college in Taiwan. This study conducted a learning performance analysis, correlation analysis, and qualitative content analysis of the learning process. The results indicate that the learners improved their speaking and writing skills through the learning tools and role-playing activities. The content analysis also demonstrated that learners could improve their speaking and writing skills via peer-to-peer and self-correction behaviors. We also provide several recommendations for EFL educators and researchers.","subject":"Role Playing, English (Second Language), Second Language Learning, Content Analysis, Conversational Language Courses, Correlation, Business Schools, Foreign Countries, Asians, Second Language Instruction, Cultural Influences, Environmental Influences, Computer Mediated Communication, Synchronous Communication, Qualitative Research, Learning Processes, Writing Skills, Oral Language, Peer Relationship, Error Correction, Case Studies, College Students, Social Media, Language Tests, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"},{"id":"EJ1063476","title":"Investigating an Innovative Computer Application to Improve L2 Word Recognition from Speech","author":"Matthews, Joshua, O'Toole, John Mitchell","description":"The ability to recognise words from the aural modality is a critical aspect of successful second language (L2) listening comprehension. However, little research has been reported on computer-mediated development of L2 word recognition from speech in L2 learning contexts. This report describes the development of an innovative computer application to improve L2 word recognition from speech, and goes on to describe an exploratory study of its use by 33 English as a second language (ESL) students. The study detected significant differences between word recognition scores measured before and after participants used the application. The manner with which students engaged with the computer application in terms of word recognition, self-determined exposure to speech input (repetitions) and modified output productivity (revisions) are also described and analysed. Differences in engagement by learners with different word recognition capabilities are noted. The paper concludes with a discussion of some recommendations for the use of computer-assisted development of L2 word recognition from speech and also provides concrete suggestions for much needed further empirical research in this area.","subject":"Second Language Learning, Second Language Instruction, Word Recognition, Linguistic Input, Computer Assisted Instruction, Teaching Methods, Speech, Listening Comprehension, English (Second Language), Learner Engagement, Psycholinguistics, Asians, College Students, Foreign Countries, Word Lists, Pretests Posttests, Language Tests, Student Attitudes, Attitude Measures, Scores, Accuracy, Verbal Communication","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1051421","title":"Implementing Courseware as the Primary Mode of Task-Based ESP Instruction: A Case Study of EFL Students","author":"Tsai, Shu-Chiao","description":"The study reports on implementing self-developed English for specific purposes (ESP) courseware for technology industries in an elective course, &quot;English reading for technology,&quot; offered to junior students of English as a foreign language in a technical university in southern Taiwan. Courseware implementation was combined with a sustained-content language teaching (SCLT) approach and a task-based learning (TBL) approach was adopted. The course mainly focused on vocabulary, listening, and reading comprehension. Evaluation of implementing these information and communication technologies (ICTs) in ESP instruction was based upon data from a variety of pre-tests and post-tests including cloze, dictation, essay writing, and Q&amp;A tests. The courseware not only provided learning materials for the target ESP, but also offered content-based and linguistic learning activities with corresponding instant self-evaluation. These features offered by the courseware both corresponded to the duel focus of the SCLT approach, and provided a model for developing an ESP courseware. Also, a teacher-centered instruction of the same subject matter was conducted with a control group. Students self-studying with the ESP courseware made as much progress as those that elected teacher-centered instruction. Most students were satisfied with the courseware-implemented ESP instruction combined with the SCLT and TBL approaches.","subject":"Courseware, English for Special Purposes, Second Language Learning, Second Language Instruction, Task Analysis, Teaching Methods, Models, Computer Assisted Instruction, Elective Courses, Reading Comprehension, Pretests Posttests, Cloze Procedure, Course Descriptions, Foreign Countries, Technical Education, Universities, Essays, Self Evaluation (Individuals), Student Attitudes, Undergraduate Students, Questionnaires, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]