[{"id":"EJ1137356","title":"Adding Value: Online Student Engagement","author":"Everett, Donna R.","description":"This paper seeks to add to the emerging literature related to online student engagement with additional suggestions for instructional strategies. Student engagement is one of the tenets of effective online instruction; as such, particular attention to how it adds value to student learning is crucial and worth the time and effort to enhance learning outcomes. What strategies and technology enhance student engagement and add value to student learning? Continuing research into online student engagement strategies is needed to add value to student learning.","subject":"Learner Engagement, Educational Strategies, Web Based Instruction, Online Courses, Electronic Learning, Value Added Models, Outcomes of Education, Educational Technology, Computer Mediated Communication, Synchronous Communication, Asynchronous Communication","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077753","title":"Teaching Social Media Analytics: An Assessment Based on Natural Disaster Postings","author":"Goh, Tiong T., Sun, Pei-Chen","description":"Unstructured data in social media is as part of the &quot;big data&quot; spectrum. Unstructured data in Social media can provide useful insights into social phenomena and citizen opinions, both of which are critical to government policy and businesses decisions. Teachers of business intelligence and analytics commonly use quantitative data from sales, marketing, finance and manufacturing to demonstrate various analytics concepts in a business context. However, researchers have seldom used social media data to analyze social behavior and communication. In this study we aim to demonstrate an assessment structure for teaching social media analytics concepts with the goal of analyzing and interpreting social media content. We base this assessment on forum postings regarding two recent events: the Christchurch earthquake in New Zealand, and the Japanese earthquake and tsunami. The aim of the assessment is to discover social insights. We base the assessment structure on Cooper's Analytics Framework to cover such concepts as term frequency (TF), term frequency-inverse document frequency (TFIDF), data visualization, sentiments and opinions analysis, the Nearest Neighbor K-NN classification algorithm, and Information Diffusion theory. We review how the students performed on the assignment that used this assessment, and we make recommendations for future studies.","subject":"Foreign Countries, Social Media, Data Analysis, Natural Disasters, Visualization, Word Frequency, Content Analysis, Opinions, Information Theory, Social Behavior, Undergraduate Students, Educational Benefits, Business, Intelligence, Web Sites, Discourse Analysis, Altruism, Emotional Response, Computer Mediated Communication, Affective Behavior, Classification, Information Dissemination, Scores","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":"Japan, New Zealand"},{"id":"EJ1137358","title":"Assessing Cyberbullying in Higher Education","author":"Kamali, Ali","description":"This project aims to expose information educators to various aspects of cyberbullying for the purpose of policy development in an environment of higher education. The preponderance of nation-wide research on cyberbullying is concentrated on adolescents; such efforts in college campuses are limited to individual endeavors. Cyberbullying research on college campuses lacks a unified definition of the concept. Although the states mandated most school districts to develop and enact some sort of policy, the law is silent on the college level cyberbullying. According to the literature, &quot;cyberbullying&quot; is reserved for adolescents; however, &quot;cyber-harassment&quot; or &quot;cyberstalking&quot; are related to adults. While cyberbullying shares with conventional bullying intimidation, aggression, and harm, it is unique because (1) the encounter is not face-to-face; (2) the perpetrator can employ varied means (e.g., cellphones, texts, blogs, Internet, social media, etc.); and (3) the act can be undisclosed. The data was collected from a random sample of 511 students (out of a student population of approximately 6,000) in a Midwestern town by employing self-administered questionnaire. It was found that engagement with different social network groups and online communications with those with questionable identity are good predictor of increased vulnerability to the risks of being victimized. The data suggests being victimized leads to victimization. Although males differ from females in terms of the type and the extent of cyberbullying, no significant difference was found among the categories of student status or their class ranks.","subject":"Higher Education, College Students, Bullying, Computer Mediated Communication, Adolescents, Social Media, Telecommunications, Questionnaires, Predictor Variables, Victims, At Risk Persons, Gender Differences, Hypothesis Testing, Statistical Analysis, Student Characteristics","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137392","title":"Steganography and Cryptography Inspired Enhancement of Introductory Programming Courses","author":"Kortsarts, Yana, Kempner, Yulia","description":"Steganography is the art and science of concealing communication. The goal of steganography is to hide the very existence of information exchange by embedding messages into unsuspicious digital media covers. Cryptography, or secret writing, is the study of the methods of encryption, decryption and their use in communications protocols. Steganography manipulates data to ensure the security of information, but the concept of steganography differs from cryptography. Cryptography obscures the meaning of a message, but it does not conceal the fact that there &quot;is&quot; a message. The goal of cryptography is to make data unreadable by a third party, whereas the goal of steganography is to hide the data from a third party. We present a way to integrate steganography and cryptology examples into introductory programming courses. This enrichment promotes active involvement in the course and provides opportunity to engage students in experimental problem solving and collaborative learning to enhance critical thinking.","subject":"Introductory Courses, Programming, Computer Science Education, Technology, Learner Engagement, Problem Solving, Cooperative Learning, Critical Thinking, College Freshmen, Enrichment, Computer Security","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1137365","title":"A Project Management Approach to Applying Best Practices to Online CS\/MIS Experiential Learning Projects","author":"Schwieger, Dana, Surendran, Ken","description":"The value of experiential learning projects (which are usually major assessments in courses) in education has been touted since the early 1900s (Dewey, 1938). These projects have the potential to deepen students' understanding of course topics by allowing them to put concepts into practice and watch the results develop. However, experiential learning projects require significant guidance, communication between students and faculty, and direction. Coupled with the communication intricacies of an online learning environment, experiential learning projects become a little more difficult to manage. In this article, the authors examine some of the best practices for teaching online courses as they relate to experiential learning projects, the value of experiential learning projects and then apply a project management approach to addressing the challenges of assigning experiential learning projects in online courses looking at two courses taught at the authors' institution. The authors then describe some best practices that they have incorporated to better manage the application of experiential learning projects in their online classrooms.","subject":"Program Administration, Best Practices, Online Courses, Computer Science Education, Management Information Systems, Experiential Learning, Web Based Instruction, Educational Benefits, Graduate Study, Course Descriptions, Blended Learning, Student Projects, Cooperative Learning, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137397","title":"A Match in the Making: How Emergent Changes in the Marketing Discipline Present Opportunities for Information Systems Programs","author":"Carley, Maureen, Babb, Jeffry","description":"The digital revolution is upon us, bringing with it disruptive forces in every aspect of business and personal interactions. The business marketing function has become so technologically driven it is sometimes hard to tell where the boundaries between the Marketing and Information Systems disciplines lie. The new world of digital marketing has changed how both marketing and technology professionals approach their jobs. Digital has created new roles, and much of what we knew and taught in higher education is no longer viable. New hybrid education programs are required to equip the new generation of workers with the skills they need to be successful. While marketing and information systems and technology education programs will undoubtedly continue to exist as separate entities, there are opportunities for cross pollination between the two disciplines. Just as corporate enterprises will need to embrace this new way of doing business if they are to be successful, so too will academic enterprises need to incorporate new methods and new ideas into their offerings if they are to remain competitive with their peer institutions. This paper explores the concept of how this new digital world has transformed the marketing function, the impact it has on the consumerization of information technology, and how higher education will have to respond. Digital has arrived, and it is here to stay.","subject":"Marketing, Information Systems, Interdisciplinary Approach, Information Technology, Social Media, Influence of Technology, Higher Education, Business Administration Education, Computer Science Education, Communication (Thought Transfer), Access to Information, Handheld Devices, Data","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1084406","title":"Open Source Meets Virtual Reality--An Instructor's Journey Unearths New Opportunities for Learning, Community, and Academia","author":"O'Connor, Eileen A.","description":"Opening with the history, recent advances, and emerging ways to use avatar-based virtual reality, an instructor who has used virtual environments since 2007 shares how these environments bring more options to community building, teaching, and education. With the open-source movement, where the source code for virtual environments was made available to the public, greatly reduced prices and increased options are shifting dramatically the utility of virtual environments for developing student competencies as virtual creators; supporting faculty and organizational needs; enabling comprehensive curriculum, assessment, and design; and allowing for multipurpose virtual environments. Reporting changes to how she taught the development of virtual environments, the author explains the enhanced learning observed within a newly designed course and the improvements she will make in the future. Additional recommendations address how education, communication, and learning organizations can use improvements to implement multipurpose virtual environments and can support technology-facilitated design in general.","subject":"Electronic Learning, Virtual Classrooms, Simulated Environment, Open Source Technology, Teaching Methods, Educational Change, Computer Simulation, Internet, Educational Technology, Curriculum Design, Lifelong Learning, Communities of Practice, Scaffolding (Teaching Technique), Masters Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137201","title":"Internet Addiction Risk in the Academic Environment","author":"Ellis, William F., McAleer, Brenda, Szakas, Joseph S.","description":"The Internet's effect on society is growing exponentially. One only has to look at the growth of e-commerce, social media, wireless data access, and mobile devices to see how communication is changing. The need and desire for the Internet, especially in such disciplines as Computer Science or Computer Information Systems, pose a unique risk for dependencies to arise. These dependencies are identified under the broad terms of Internet Addiction and\/or Internet Abuse.","subject":"Internet, Addictive Behavior, Risk, Educational Environment, Social Media, Mass Media Effects, Mass Media Use, Change Strategies, Student Attitudes, Student Behavior","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1121040","title":"Eye-Tracking Analysis of the Figures of Anti-Smoking Health Promoting Periodical's Illustrations","author":"Maródi, Ágnes, Devosa, Iván, Steklács, János, Fáyné-Dombi, Alice, Buzas, Zsuzsanna, Vanya, Melinda","description":"Nowadays new education technologies and e-communication devices give new measuring and assessing tools for researchers. Eye-tracking is one of these new methods in education. In our study we assessed 4 figures from the anti-smoking heath issues of National Institute for Health Development. In the study 22 students were included from a 7th grade class of a Kecskemét primary school. Our results show that students concentrate on the text-part of the figures except if the picture is frightening. However if the text and the picture are not both frightening enough, the message will not be transferred to young students.","subject":"Foreign Countries, Educational Technology, Eye Movements, Smoking, Prevention, Health Promotion, Periodicals, Illustrations, Grade 7, Primary Education, Program Effectiveness, Textbook Content, Reader Text Relationship, Motivation, Fear","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"},{"id":"EJ1120999","title":"The Investigation of Mobbing Events Taking Place at Higher Education Institutions in Turkey Considering the Reflections on Media","author":"Çubukçu, Zühal, Girmen, Pinar, Dönmez, Ayse","description":"The business-life related competition established in modern communities has also brought about some other problems. The attacks and intimidation attempts have introduced the term of &quot;mobbing&quot; which is defined as regular and continuous psychological violence faced by people always trying to produce and win from those who they work with. The term of &quot;mobbing&quot; has recently become a popular academic issue which has been sophisticatedly handled in relevant literature. Mobbing is defined as the act of continuous and systematic intimidation purposefully performed by either some employees or employers on some employees through emotional violence. As mobbing is considered to be significant for both corporate and employee, the starting point of this study was to investigate how mobbing acts are reflected on newspapers as they are mass communication means. One of the most important means of media is print media. Print media is the first means of media when mentioned about media. Newspapers are means through which people are always kept up to date about the latest news in civilized societies. With this regard, the most basic purpose of this study is to investigate the news about the mobbing events experienced in higher education system under the light of national policy documents and reports. The study was carried out based on a qualitative approach. The news released in print media was chosen purposefully as print media means report news in a detailed way, have an evidential value and can be read again on demand. The research group in this study consists of the mobbing news released on Hurriyet, Sabah and Zaman which are newspapers published in Turkey between the years of 2009-2013. These newspapers were purposefully chosen based on criterion sampling method. The most basic understanding underlying this sampling method is to study on all cases which meet the standards set prior to the start of the study. The newspapers mentioned above were chosen considering that they are published nationally, reference newspapers and belong to different publication groups. The data used in this study was taken from the archive of the three newspapers. When the archives of the newspapers was scanned, the word &quot;mobbing&quot; was taken as key word for the search. In qualitative researches, newspapers are considered to be public archive and used as reference documents. The data obtained was grouped depending on the newspapers which it was taken from, on the year of publication, on where they took place, on the gender of the victims and on who the sufferers are.","subject":"Foreign Countries, Bullying, Newspapers, Higher Education, Qualitative Research, News Reporting, Violence","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Turkey"}]