[{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015}]