[{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1121021","title":"Credibility and Accountability in Academic Discourse: Increasing the Awareness of Ghanaian Graduate Students","author":"Adika, Gordon S. K.","description":"Drawing from a social constructionist perspective to written scholarly communication, this paper argues that training in academic writing for students in higher education especially in second language contexts should go beyond emphasis on grammatical correctness and paragraphing strategies, and also focus on the rhetorical character of academic discourse together with the mastery of its communicative protocols. Using the University of Ghana as a reference point, the paper reviews a selection of Ghanaian graduate students' awareness of the protocols that govern academic discourses in scholarly writing, and in consideration of their unique educational and socio-cultural circumstances, the paper proposes strategies, from the pedagogical and institutional standpoints, aimed at increasing students' awareness of the relevant communicative practices that engender credibility and accountability.","subject":"Foreign Countries, Credibility, Accountability, Academic Discourse, Discourse Analysis, Graduate Students, Scholarship, Constructivism (Learning), Discourse Communities, Second Language Learning, Grammar, Writing Strategies, Rhetoric, Communication Strategies, Writing Attitudes, Plagiarism, Literature Reviews, Verbs, Language Usage, Evaluation Methods, Citations (References), Documentation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Ghana"},{"id":"EJ1137402","title":"A Systems Analysis and Design Case Study for a Business Modeling Learning Experience for a Capstone CIS\/IS Systems Development Class","author":"Russell, Jack, Russell, Barbara","description":"The goal is to provide a robust and challenging problem statement for a capstone, advanced systems analysis and design course for CIS\/MIS\/CS majors. In addition to the problem narrative, a representative solution for much of the business modeling deliverables is presented using the UML paradigm. A structured analysis deliverable will be the topic of a second paper on this subject. The authors teach the systems analysis and design course(s) or the systems development course(s) at their university. The CIS senior capstone course that the primary author teaches requires that the student complete one or more business modeling case studies. The authors have used some cases\/problem statements from various systems analysis and design texts; however, the authors wanted a problem statement that would challenge a systems team at the senior undergraduate level to produce a complete static, functional and behavioral business model that could be designed and implemented. The authors believe that the narrative should include enough detail to enable the team to use either Unified Modeling Language (UML) or Structured Analysis.","subject":"Systems Analysis, Case Studies, College Curriculum, Systems Development, Information Systems, Computer Science Education, Advanced Courses, College Seniors, Group Activities, Student Projects, Business, Models, Learning Experience","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137190","title":"IT0: Discrete Math and Programming Logic Topics as a Hybrid Alternative to CS0","author":"Martin, Nancy L.","description":"This paper describes the development of a hybrid introductory course for students in their first or second year of an information systems technologies degree program at a large Midwestern university. The course combines topics from discrete mathematics and programming logic and design, a unique twist on most introductory courses. The objective of the new course is to better prepare students for more advanced computing courses. Two primary drivers motivated development of the new course: 1) faculty evidence of deficient foundation skills in advanced level courses, and 2) consideration of program accreditation criteria.","subject":"Mathematics Instruction, Programming, Introductory Courses, Information Systems, Information Technology, College Students, Accreditation (Institutions), Mathematical Logic, Thinking Skills, Problem Solving, Universities","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121037","title":"Compulsory Book Reading at School and within Leisure","author":"Pavlovic, Slavica","description":"This paper deals with attitudes of secondary school pupils towards compulsory book reading at school, being the integral part of the subject Croat language and literature teaching subject, and its possible impact on their book (not-)reading in their leisure time. It is based on the research carried out through five-point Likert-type scale in secondary schools in Mostar (Bosnia and Herzegovina), in the second half of 2014. The research was conducted on the convenience, stratified sample consisted of 260 secondary school pupils, attending the final class of grammar (130) and vocational (130) school. The results obtained could give an insight into the book reading culture of secondary school pupils within their leisure related to their experience of compulsory book reading at school. It results that compulsory book reading has still been an uninteresting school task for both the strata of the research sample. Moreover, it results that compulsory book reading at school has a certain influence on book reading decrease in both sample strata's leisure time. However, some guidelines how to increase the students' interest in compulsory book reading at (secondary) school as well as in book culture within their leisure time are given in this paper.","subject":"Books, Recreational Reading, Secondary School Students, Student Attitudes, Foreign Countries, Likert Scales, Reading Habits, Reading Interests, Student Surveys","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Bosnia and Herzegovina"},{"id":"EJ1137094","title":"Cybersecurity Curriculum Development: Introducing Specialties in a Graduate Program","author":"Bicak, Ali, Liu, Michelle, Murphy, Diane","description":"The cybersecurity curriculum has grown dramatically over the past decade: once it was just a couple of courses in a computer science graduate program. Today cybersecurity is introduced at the high school level, incorporated into undergraduate computer science and information systems programs, and has resulted in a variety of cybersecurity-specific graduate programs. However, is that even enough? Is cybersecurity so broad that education needs to be more specialized? Employers want graduates who can hit the ground running: not in the broad field of cybersecurity but in some very specific areas. This paper is structured as follows. First, we will provide a brief overview of the current approaches to cybersecurity education including government standards bodies such as the National Initiative for Cybersecurity Education (NICE) framework, the upcoming changes in the National Information Assurance (IA) Education and Training Programs (NIETP) Center of Academic Excellence (CAE) designation requirements, and the Department of Labor competency model. Second, we will present a framework for curriculum changes, which we use to determine the viability of information technology\/information systems (IS\/IT) curriculum changes to our departmental educational offerings. We examine relationships with other departments and how cybersecurity is enhanced by other domain knowledge. Then we discuss the three specialties we plan to introduce in the cybersecurity graduate curriculum: cybersecurity data analysis, cyber intelligence, and health care information security and privacy. Finally, the future cybersecurity curriculum directions are presented and discussed.","subject":"Information Security, Curriculum Design, Computer Science, Graduate Study, Information Science Education, Employers, Education Work Relationship, Standards, Guidelines, Teaching Methods, Educational Change, Excellence in Education, Models, Data Analysis, Health Services, Privacy, Records (Forms), Medical Evaluation, Program Descriptions, Private Colleges","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Virginia"},{"id":"EJ1109690","title":"Examining Learning Styles and Perceived Benefits of Analogical Problem Construction on SQL Knowledge Acquisition","author":"Mills, Robert J., Dupin-Bryant, Pamela A., Johnson, John D., Beaulieu, Tanya Y.","description":"The demand for Information Systems (IS) graduates with expertise in Structured Query Language (SQL) and database management is vast and projected to increase as &quot;big data&quot; becomes ubiquitous. To prepare students to solve complex problems in a data-driven world, educators must explore instructional strategies to help link prior knowledge to new knowledge. This study examined learning styles and the perceived benefits of analogical problem construction on SQL knowledge acquisition. The data collected from 80 participants suggests there is a perceived positive benefit to using analogical problem construction for learning introductory database concepts. The learning style of the majority of students in the sample is &quot;Active-Sensing-Visual-Sequential.&quot; However, learning styles were not related to student perceived impact of analogical problem construction to understand database concepts. Student analogies were collected for a variety of SQL concepts; noteworthy examples are highlighted. While results related to learning styles are intriguing, the most promising path for further exploration (for both research and practice) is the use of analogy problem construction in Information Systems educational environments.","subject":"Cognitive Style, Databases, Information Systems, Information Science, Problem Solving, Teaching Methods, Prior Learning, Student Attitudes, Concept Formation, Transfer of Training, Logical Thinking, College Students, Questionnaires, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121026","title":"The Impact of Pedagogical Agent on Learners' Motivation and Academic Success","author":"Dincer, Serkan, Doganay, Ahmet","description":"Pedagogical agent is generally described as educational programs that guide, motivate learners while encouraging them during learning by providing feedback. The tasks (informative, guiding, or friend, etc.) and types (human-like, cartoon character, audio, text, etc.) of these modules can be classified based on various variables. Although computer-assisted instruction software is commonly used as a teaching material, research on modules integrated on such programs is scarce. Studies in the field have revealed that such computer-assisted instruction programs increase motivation of learners. In order to keep motivation levels high, these programs need to be adopted depending on the individual needs. Therefore, it can be beneficial to integrate software designed that can be personalized. In this respect, the present study was conducted with secondary school students to identify the impact of pedagogical agent on learners' academic success and motivation. For the purpose of the study, four groups were formed. The first group received education via fixed pedagogical agent, the second group had the option to choose among several pedagogical agents, the third group received the education without pedagogical agent and finally the last group received the same education through traditional (non-computer) way. This four-week program was introduced to students via MS Excel program and the data was gathered as pre- and post-test method. The findings have revealed that interfaces impacted motivation and accordingly academic success in a positive way. As a result of the study, it is suggested that learners should be provided programs that can be personalized depending on learners' needs and preferences.","subject":"Student Motivation, Academic Achievement, Computer Assisted Instruction, Pretests Posttests, Pilot Projects, Experimental Groups, Control Groups, Statistical Analysis, Secondary School Students, Grade 5, Grade 8","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"}]