[{"id":"EJ1276559","title":"Prospective English Teachers Re-Examining Language Ideologies in Telecollaboration#","author":"Viáfara González, John Jairo","description":"Previous publications in applied linguistics concerning nonnative English speaker teachers have analyzed how native-speakerism associated ideologies engender discrimination and affect students' and teachers' sense of self-worth. This qualitative study examines how Colombian English pre-service teachers' telecollaboration with U.S. Spanish heritage language students (SHLSs) influences the Colombian future teachers' self-perceptions as (non) native speakers. This research joins the call scholars have made to expand telecollaboration into critical perspectives to challenge pervasive and harmful language beliefs and attitudes. Findings suggest that Colombian participants' cooperative relationships with U.S. peers provided them affective and knowledge-based resources to build more favorable views of themselves, attitudes to confront the detrimental effects of native-speakerism ideologies, and informed judgments to dismantle them.","subject":"Foreign Countries, Language Attitudes, Native Speakers, English (Second Language), Second Language Learning, Second Language Instruction, Peer Relationship, Language Teachers, Cooperative Learning, Self Concept, Spanish, Heritage Education, College Students, Attitude Change, Student Attitudes, Social Discrimination, Teacher Education Programs, Intercultural Communication, Computer Mediated Communication, International Educational Exchange, Student Teachers, Social Media, Videoconferencing","source":"Computer Assisted Language Learning","publicationdateyear":2020,"identifiersgeo":"Colombia, United States"},{"id":"EJ1251197","title":"The Impact of Using Machine Translation on EFL Students&apos; Writing","author":"Lee, Sangmin-Michelle","description":"Although it remains controversial, machine translation (MT) has gained popularity both inside and outside of the classroom. Despite the growing number of students using MT, little is known about its use as a pedagogical tool in the EFL classroom. The present study investigated the role of MT as a CALL tool in EFL writing. Most studies on MT as a tool for L2 learning have focused on student postediting of the translation that MT provides; however, the present study employed a different design with students translating their L1 writing into L2 without the help of MT and then correcting their L2 writing using the MT translation for comparison. Text analysis of students' writing outcomes revealed that MT helped to decrease lexico-grammatical errors and improve student revisions. Using MT for revisions also positively affected student writing strategies and helped them think of writing as a process. The interviews and reflection papers demonstrated that students viewed the use of MT during writing positively. This study found that MT can be a useful aid to language learning, but for it to benefit student learning, teachers must be aware of its limitations and provide adequate guidance to students.","subject":"Translation, Computational Linguistics, English (Second Language), Second Language Learning, Second Language Instruction, Computer Assisted Instruction, Student Attitudes, Teaching Methods, Writing (Composition), Editing, Native Language, Error Correction, Grammar, Vocabulary, Language Usage, Writing Strategies, Writing Processes, Revision (Written Composition), Multimedia Instruction, College Students, Foreign Countries, Korean, Language Proficiency, Instructional Effectiveness","source":"Computer Assisted Language Learning","publicationdateyear":2020,"identifiersgeo":"South Korea"},{"id":"EJ1254544","title":"Microfeatures Influencing Writing Quality: The Case of Chinese Students&apos; SAT Essays","author":"Goh, Tiong-Thye, Sun, Hui, Yang, Bing","description":"This study investigates the extent to which microfeatures -- such as basic text features, readability, cohesion, and lexical diversity based on specific word lists -- affect Chinese EFL writing quality. Data analysis was conducted using natural language processing, correlation analysis and stepwise multiple regression analysis on a corpus of 268 Chinese students' SAT writing in response to a single prompt. The results show that word count, the number of words per sentence, the connecting word frequency, the number of commas per sentence, the stop word frequency and the Coleman-Liau readability index (CLI) contribute significantly towards predicting SAT essay scores of Chinese EFL students. The regression model explains 62.6% of the variance in predicting the SAT essay's score where the number of commas per sentence acts as a suppressor. Surprisingly, none of the word lists were found to be a significant predictor. Consequently, EFL teachers can adopt these simple lexical features to formulate writing strategies for beginner level Chinese EFL students to improve their SAT writing quality. Moreover, developers can include these features as a personalized option in automated writing assistance systems targeted toward beginner level Chinese EFL students.","subject":"Essays, Writing Tests, English (Second Language), Second Language Learning, Second Language Instruction, College Entrance Examinations, Readability, Word Lists, Correlation, Asians, Connected Discourse, Writing Evaluation, Natural Language Processing, Word Frequency, Writing Strategies, Writing Instruction, Teaching Methods, Computational Linguistics, Computer Assisted Instruction, Writing Improvement, Readability Formulas, Punctuation, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2020,"identifiersgeo":"China"},{"id":"EJ1281564","title":"Intelligent Personal Assistants: Can They Understand and Be Understood by Accented L2 Learners?","author":"Moussalli, Souheila, Cardoso, Walcir","description":"Second\/foreign language (L2) classrooms do not always provide opportunities for input and output practice [Lightbown, P. M. (2000). Classroom SLA research and second language teaching. Applied Linguistics, 21(4), 431-462]. The use of smart speakers such as Amazon Echo and its associated voice-controlled intelligent personal assistant (IPA) Alexa can help address this limitation because of its ability to extend the reach of the classroom, motivate practice, and encourage self-learning. Our previous study on the pedagogical use of Echo revealed that its use gave L2 learners ample opportunities for stress-free input exposure and output practice [Moussalli, S., &amp; Cardoso, W. (2016). Are commercial 'personal robots' ready for language learning? Focus on second language speech. In S. Papadima-Sophocleous, L. Bradley, &amp; S. Thouësny (Eds.), CALL communities and culture -- short papers from EUROCALL 2016 (pp. 325-329). However, the results also suggested that beginner learners, depending on their levels of accentedness, experienced difficulties interacting with and being understood by Echo. Interestingly, this observation differs from findings involving human-to-human interactions, which suggest that a speaker's foreign accent does not impede intelligibility. In this article, we report the results of a study that investigated Echo's ability to recognize and process non-native accented speech at different levels of accentedness, based on the accuracy of its replies for a set of pre-established questions. Using a variety of analytical methods (i.e. judges' ratings of learners' pronunciation, learners' ratings of Echo's pronunciation, transcriptions of Echo's interactions, surveys and interviews) and via a multidimensional analysis of the data collected, our results indicate that L2 learners have no problems understanding Echo and that it adapts well to their accented speech (Echo is comparable to humans in terms of comprehensibility and intelligibility). Our results also show that L2 learners use a variety of strategies to mitigate the communication breakdown they experienced with Echo.","subject":"Artificial Intelligence, Pronunciation, Native Language, Listening Comprehension, Intelligibility, Audio Equipment, Artificial Speech, Communication Problems, Second Language Learning, Second Language Instruction, English Language Learners, Technology Integration, College Students, Young Adults, Evaluators, Foreign Countries, Natural Language Processing","source":"Computer Assisted Language Learning","publicationdateyear":2020,"identifiersgeo":"Canada (Montreal)"}]