[{"id":"EJ1143780","title":"Applying the Technology Acceptance Model (TAM) to Explore the Effects of a Course Management System (CMS)-Assisted EFL Writing Instruction","author":"Tsai, Yea-Ru","description":"This study illustrates a teaching model that utilizes a Blackboard (Bb) course management system (CMS) to support English writing instruction. It was implemented in a blended English research paper (RP) writing course, with specific learning resources and activities offered inside and outside the Bb CMS. A quasi-experimental study in which the results of two academic years were analysed is presented. The results showed that the experimental group significantly outperformed the control group in their final drafts. The research methodology included the Technology Acceptance Model (TAM) to evaluate the course. The results of the survey showed that most students displayed positive learning outcomes, indicating that the instruction model could contribute to the effectiveness of learning English writing. Major factors influencing the improvement of writing performance included technical support, perceived usefulness, perceived ease of use, and attitude; however, the influence of writing activities on the Bb was limited in comparison to the other variables.","subject":"Computer Assisted Instruction, Educational Technology, Writing Instruction, English (Second Language), Second Language Instruction, Integrated Learning Systems, Research Reports, Quasiexperimental Design, Technology Integration, Student Attitudes, Foreign Countries, Undergraduate Students, Experimental Groups, Control Groups, Comparative Analysis, Blended Learning, Questionnaires, Statistical Analysis","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1143739","title":"Sustaining Multimodal Language Learner Interactions Online","author":"Satar, H. Müge","description":"Social presence is considered an important quality in computer-mediated communication as it promotes willingness in learners to take risks through participation in interpersonal exchanges (Kehrwald, 2008) and makes communication more natural (Lowenthal, 2010). While social presence has mostly been investigated through questionnaire data and quantitative content analysis of online interactions based on a set of predefined indicators, in a smaller number of studies the concept has also been investigated through qualitative analysis of interviews (Kehrwald, 2008, 2010). Yet studies that bring together multiple sources of data collection and examine multimodal language learning contexts are almost non-existent. In this paper, the theory of social presence is employed to explicate language learners' online multimodal communication using a case study approach. Multiple sources of data were collected, including interviews, open-ended and closed post-task questionnaires, stimulated reflection and recordings of video interactions. The main findings of the study included an innovative social presence framework developed for the analysis of online multimodal language learner interactions (Satar, 2010), which can be used in further qualitative and exploratory research. It also has potential applicability for educators to develop strategies for language learners to guide them in creating and transmitting their social presence. The focus of this article is a cross-case analysis for one of the components of social presence, sustaining interaction, bringing together social presence theory, interactional sociolinguistics and multimodal interaction analysis. Finally, strategies are proposed for language learners on how to sustain their online multimodal interactions.","subject":"Learning Modalities, Online Courses, Computer Mediated Communication, Computer Assisted Instruction, Educational Technology, Interpersonal Communication, Interviews, Questionnaires, Reflection, Video Technology, Videoconferencing, Interaction, English (Second Language), Second Language Learning, Late Adolescents, Young Adults, Preservice Teachers, Foreign Countries, Case Studies, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1176699","title":"Input and Output Grammar Instruction in Tutorial CALL with a Complex Grammatical Structure","author":"Collentine, Joseph, Collentine, Karina","description":"Conceptual replication within a computer-assisted language learning (CALL) environment provides an understanding of the generalizability of second language acquisition (SLA) research (Porte, 2013; Smith &amp; Schulze, 2013). The present study replicates Collentine (1998a), a classroom-based experiment framed within a larger discussion on the relative benefits of input- and output-based instruction. Collentine (1998a) compared the benefits of Processing Instruction (VanPatten, 2004) and output-based instruction, both of which elevated the Spanish subjunctive's communicative value. The results showed that input- or output-oriented instruction informed by how learners process grammatical information can affect the acquisition of complex grammatical phenomena. This conceptual replication not only seeks to corroborate the original study's findings in a new learning context. It also tests the finding's generalizability to a tutorial CALL environment built on 3D simulations and emerging web-app technologies. The participants were foreign-language learners of Spanish in a classroom-based curriculum (N = 50). The results indicate that, in the classroom and in a CALL environment, both input- and output-oriented approaches can promote the acquisition of a complex grammatical structure if practice is meaningful (informed by psycholinguistic processing principles) and deliberate, and if feedback is provided.","subject":"Computer Assisted Instruction, Educational Technology, Grammar, Teaching Methods, Program Effectiveness, Spanish, Second Language Instruction, Computer Simulation, Feedback (Response), Statistical Analysis, Morphology (Languages), Language Proficiency, Cultural Awareness, Interdisciplinary Approach, Sentences, Verbs, Syntax, Regression (Statistics), Pretests Posttests","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143738","title":"Reflexive Photography, Attitudes, Behavior, and CALL: ITAs Improving Spoken English Intelligibility","author":"Wallace, Lara","description":"Research in the field of Computer-Assisted Language Learning (CALL) has frequently taken a top-down approach when investigating learners' attitudes and behavior, both in the course as well as for their personal use. Suggestions are given for use of technology, and future research (Beatty, 2010; Levy &amp; Stockwell, 2006). One perspective that has not been examined in CALL is Reflexive Photography, a method that lends itself to rigorous and focused analysis and can illuminate the participants' experiences and perceptions in a way that the above methods cannot. In reflexive photography, participants are asked to photograph their experience of the phenomenon in question. These photographs serve as the basis for the discussion with the researcher that follows, and help to define the scope of the particular phenomenon. Together, the participants and the researcher co-produce the information regarding the phenomenon (Jenkings, Woodward &amp; Winter, 2008). Reflexive photography has been used to explore issues of identity and experience in other fields, although in CALL, it has been underutilized. The present study identified current uses of technology among International Teaching Assistants (ITAs) taking a course to improve their spoken English intelligibility. Midway through the term, learners photographed what they deemed to be helpful and what they felt obstructed the improvement of their oral English production. They then shared seven to ten photographs in a focus group of peers. At the end of the term, the researcher interviewed the learners regarding these experiences. The photos and the interviews were coded and the researcher examined the emergent findings, using observations and electronic communication from throughout the term to triangulate and support the data. The findings revealed valuable insights through the eyes of the learners regarding what technology the learners found to be helpful and\/or obstructive, both in the course as well as for their personal use, and suggestions for improvements in use of technology are given. Finally, future research directions in CALL using reflexive photography are discussed.","subject":"Computer Assisted Instruction, English (Second Language), Second Language Instruction, Educational Technology, Photography, Reflection, Teaching Assistants, Foreign Students, Graduate Students, Phenomenology, Student Attitudes, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143730","title":"Using Netnography to Explore the Culture of Online Language Teaching Communities","author":"Kulavuz-Onal, Derya","description":"Netnography (Kozinets, 2010) is an ethnographic approach to study communities that exist primarily online. Engaging in online participant observation, the netnographer connects to the online community through a computer screen, and the field is located inside the screen. Although it has been used in marketing research extensively, netnography is a relatively new methodology in educational research. In this paper, I give an overview of netnography and its applicability in studying online language teaching communities. Drawing upon a netnography of a globally-distributed online community of practice of English language teachers, Webheads in Action, I provide detailed accounts of my experiences during data collection and particular methodological considerations in netnography in order to shed light on the often untold aspects of an ethnographic design in online research that involves participant observation. I conclude with a discussion of possible benefits of a participant observer approach in netnography in understanding the culture of online language teaching communities, and invite CALL researchers to consider netnography and online participant observation in their future studies.","subject":"Second Language Learning, Computer Assisted Instruction, Web Based Instruction, Ethnography, Communities of Practice, Participant Observation, Research Methodology, Educational Research, Language Teachers, English Language Learners, Data Collection, Research Design, Educational Benefits, Computer Mediated Communication, Web 2.0 Technologies, Field Studies, Notetaking, Interviews, Archives","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1176698","title":"Engaging in Mobile Phone-Based Activities for Learning Vocabulary: An Investigation in Japan and Taiwan","author":"Stockwell, Glenn, Liu, Yi Chun","description":"Studies investigating the use of mobile technologies when other options are available are still relatively rare in the literature, with the majority of studies requiring that learners use a particular technology, either using their own devices or devices provided by the institution. One exception to this was a study by Stockwell (2010) that examined how learners in Japan perceived the use of mobile phones for language learning and how willing they were to engage in the activities. This study, however, was conducted prior to the spread of smart phones and it focused exclusively on learners in Japan. Thus, the purpose of the current study was to replicate this study, but differed in two ways. First, although it was run in essentially the same environment as the original study, in the current study the majority of learners owned smart phones. Second, the same system was used not only in Japan but also with learners studying at a university in Taiwan. Data were collected through server logs, post-treatment surveys and semi-structured interviews. The results are discussed in terms of the ways in which learners engaged in the activities on their mobile phones, and the effect of the mobile platform on the time taken to complete the activities over the course of the semester. These results were correlated with those from the original 2010 study to identify the potential effect of the smart phone.","subject":"Foreign Countries, Telecommunications, Handheld Devices, Educational Technology, Technology Uses in Education, Surveys, Semi Structured Interviews, Second Language Instruction, English (Second Language), Cross Cultural Studies, College Students, Vocabulary Development, Scores, Learning Activities","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Taiwan, Japan"},{"id":"EJ1176697","title":"Quantitative Considerations for Improving Replicability in CALL and Applied Linguistics","author":"Plonsky, Luke","description":"There are a number of methodological practices commonly employed by CALL researchers that limit progress in the field. Some of these practices are particular to replication research, but most are more general and are found throughout the field. I describe in this paper two studies that are fabricated but that resemble much of what is found in published second language research. Each study corresponds to and contains a set of methodological issues. Following each study, I address the issues they illustrate, providing comments and suggestions for how the analyses could be modified to produce greater replicability and\/or replicational value. I conclude with a summary of suggestions for quantitative reforms related to improving replication research and quantitative practices more generally in CALL and applied linguistics.","subject":"Computer Assisted Instruction, Educational Technology, Second Language Instruction, Teaching Methods, Statistical Analysis, Spanish, Educational Games, English (Second Language), College Students, Questionnaires, Reading Comprehension","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143785","title":"Conversation Analysis in Computer-Assisted Language Learning","author":"González-Lloret, Marta","description":"The use of Conversation Analysis (CA) in the study of technology-mediated interactions is a recent methodological addition to qualitative research in the field of Computer-assisted Language Learning (CALL). The expansion of CA in Second Language Acquisition research, coupled with the need for qualitative techniques to explore how people interact in technology-mediated environments, has stimulated a small but growing body of research. This article reviews CALL research that employed a CA approach to the collection, microanalysis, and understanding of the data in a variety of technology-mediated fields (text, audio and video SCMC, email, forums and bulletin boards, social networks, and games), with participants from different contexts and languages, interacting in an L2 either among themselves or with native\/more expert speakers of the language. Most research up to now has been descriptive in nature, illustrating the sequential organization of interaction, interactional and linguistic resources employed by the participants, and affordances and challenges of the media to promote language learning. In addition, a few studies have directly explored &quot;learning&quot; through the microanalysis of longitudinal data for any changes in the learners' linguistic and interactional patterns of engagement. The review of studies is followed by those challenges that affect the implementation of CA in CALL research and a vision of the future of CA for CALL in the larger field of Applied Linguistics.","subject":"Discourse Analysis, Computer Mediated Communication, Computer Assisted Instruction, Second Language Instruction, Second Language Learning, Qualitative Research, Data Analysis, Program Implementation, Educational Research, Applied Linguistics, Sequential Approach, Affordances, Longitudinal Studies, Concept Formation","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143733","title":"Second Language Teacher Development through CALL Practice: The Emergence of Teachers&apos; Agency","author":"Kitade, Keiko","description":"A growing number of studies examining second language (L2) teacher education from the perspective of sociocultural theory, in particular the activity theory framework (Engeström, 1999), show that transformations in teachers' cognition and practice can be fostered through negotiation of sociocultural and cognitive dissonance in their teaching environments. This case study examines 16 years of cognitive development of two Japanese language teachers practicing computer-assisted language learning (CALL) and the challenges they experienced as a result of the evolution of information and communications technology (ICT). The focus is on the challenges faced by L2 teachers and their responses, and how these challenges relate to the development of teachers' agency as CALL practitioners. Narrative inquiry data for both participants were collected following the Trajectory Equifinality Approach (e.g., Valsiner &amp; Sato, 2006), in which each teacher's life trajectory is visualized to identify critical points based on social affordances and constraints. The critical points were further analyzed and interpreted within and between activity systems. The data suggests that the teachers became aware of the social nature of the technology through the challenges they encountered when coordinating their own and students' mismatched values attached to ICT. Such a change in perceptions not only impacted their pedagogical usage of the technology but in turn also constituted their agency.","subject":"Computer Assisted Instruction, Second Language Instruction, Language Teachers, Technology Uses in Education, Educational Technology, Technological Literacy, Empowerment, Japanese, Semi Structured Interviews, Teacher Attitudes, Social Influences, Faculty Development, Case Studies, Qualitative Research, Personal Narratives","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143742","title":"The Role of Qualitative Approaches to Research in CALL Contexts: Closing in on the Learner&apos;s Experience","author":"Levy, Mike","description":"The article considers the role of qualitative research methods in CALL through describing a series of examples. These examples are used to highlight the importance and value of qualitative data in relation to a specific research objective in CALL. The use of qualitative methods in conjunction with other approaches as in mixed method research designs are a particular focus. It is argued that qualitative methods are especially effective when used in this way. The discussion also aims to elaborate upon the role of qualitative approaches within CALL specifically, as a domain for research study with particular attributes that require a qualitative orientation. Here the use of electronic dictionaries is considered. Dictionary use is suited to such a discussion because it occurs frequently in everyday life, suggesting a qualitative approach, as well as in research studies that are strictly controlled, as in a quantitative approach. The contrast is instructive and helps demonstrate the respective strengths and limitations of each method. Also central to the discussion is the language learner. A number of the studies described emphasize the importance of listening to the students' voice in the qualitative component (e.g., Conole, 2008; Jones, 2003). It is in the unpacking of what students actually do moment-by-moment in CALL tasks and activities that best illustrate the strengths of qualitative methods in enhancing our understanding of mediated learning and thereby driving productive research agendas.","subject":"Computer Assisted Instruction, Second Language Learning, Educational Technology, Mixed Methods Research, Research Methodology, Educational Research, Dictionaries, Electronic Publishing, Foreign Countries, Student Surveys, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1143616","title":"An Analysis of Social Network Websites for Language Learning: Implications for Teaching and Learning English as a Second Language","author":"Liu, M., Abe, K., Cao, M. W., Liu, S., Ok, D. U., Park, J., Parrish, C., Sardegna, V. G.","description":"Although educators are excited about the potential of social network sites for language learning (SNSLL), there is a lack of understanding of how SNSLL can be used to facilitate teaching and learning for English as Second language (ESL) instructors and students. The purpose of this study was to examine the affordances of four selected SNSLL (LingQ, Lang-8, italki, and Polyglotclub) through site design and user experience from two perspectives: using the sites as a language teacher through site analyses; and using the sites as a language learner through usability testing. The findings showed that these sites have the potential to facilitate language learning. The learning tasks created using the social networking features of these sites are to provide examples of how to use these SNSLL as teaching tools under a socio-constructivist learning framework. In addition, the results of the usability testing highlighted the importance of considering the website's information, interface, and interaction designs. SNSLL should be as easy to use and as intuitive to navigate as possible. We hope the findings will provide valuable insights regarding how SNSLL can be used as teaching and learning tools, and how they should be designed to facilitate pedagogical goals.","subject":"Social Media, Second Language Instruction, English (Second Language), Technology Uses in Education, Educational Technology, Language Teachers, Usability, Web Sites, Teaching Methods, Web 2.0 Technologies, Teacher Attitudes, College Students, Questionnaires, Program Effectiveness, Use Studies, Video Technology, Student Attitudes","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1176700","title":"The More Things Change, the More They Stay the Same, or Do They? Revisiting Classroom Interaction Approaches and Their Effects on Quantity and Characteristics of Language Production","author":"Jones, Linda C., Murphy, Cheryl A., Holland, Amalie","description":"This study investigated the quantity and characteristics of student language production, discourse functions, and morphosyntactic features in three different discourse settings--face-to-face (F2F), lab-setting chatroom interactions (Lab), and any place\/any device chatroom interactions (APAD). Discourse was examined through the replication and extension of Richard Kern's (1995) study. Similarities in findings between the two studies included a continuation of incomplete, and short sentence lengths among F2F students, an absence of F2F greetings, and a higher rate of assertions, verb tenses, and simple sentences in the Lab setting. Differences included a higher rate of F2F turns in the current study, an absence of greetings in the lab setting, and a greater number of commands among F2F participants. Findings underscored what Kern previously asserted: that F2F and chatroom settings tend to encourage and support slightly different goals associated with language discourse. Kern stated that more sophisticated conversation occurred in the chatroom setting. Current findings concurred but furthered that more conversational interaction took place within the F2F discourse setting due to a greater number of commands, turns, and incomplete sentences. Similarly, F2F students experienced greater input due to the increase of words heard, questions asked, and commands made.","subject":"Interaction, Synchronous Communication, Statistical Analysis, Language Acquisition, Computer Mediated Communication, Comparative Analysis, Second Language Learning, Second Language Instruction, English (Second Language), Handheld Devices, French, Intervention, Student Surveys, College Students, Statistical Significance","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143614","title":"It Takes Research to Build a Community: Ongoing Challenges for Scholars in Digitally-Supported Communicative Language Teaching","author":"Dooly, Melinda","description":"This article provides an argument for closer multilateral alliances between the emergent and loosely-bound international community of educational researchers who are working in areas related to Digitally Supported Communicative Language Teaching and learning (herein DSCLT). By taking advantage of the communications revolution that is currently reshaping the world, internationally aligned investigators can foster new knowledge, technology, and practices that develop improved teaching strategies and policies appropriate to our rapidly changing times. Beginning with a brief overview of the impact that technology has had on education and post-2000 nascent research areas related to DSCLT, this article goes on to examine whether or not the impact of research is geographically bound, and if so, how transnational alliances can be useful in bridging gaps in the continuum of knowledge-building. Finally, the potential gains that could stem from an enhanced collaboration between international research communities are examined, although admittedly such endeavors are not without challenges.","subject":"Educational Technology, Technology Uses in Education, Communication Skills, Geographic Location, International Cooperation, Computer Mediated Communication, Educational Research, Second Language Instruction, Telecommunications, Handheld Devices, Internet, Social Media, Communities of Practice","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143782","title":"Enhancing L2 Reading Comprehension with Hypermedia Texts: Student Perceptions","author":"Garrett-Rucks, Paula, Howles, Les, Lake, William M.","description":"This study extends current research about L2 hypermedia texts by investigating the combined use of audiovisual features including: (a) Contextualized images, (b) rollover translations, (c) cultural information, (d) audio explanations and (e) comprehension check exercises. Specifically, student perceptions of hypermedia readings compared to traditional print texts are investigated in this study to address theoretical concerns that the combined use of multiple audiovisual annotations might split learners' attention from their reading comprehension. Additionally, student perceptions of the usefulness of the annotation features afforded by the hypermedia texts were investigated. Data were collected from 70 French language learners across four intermediate and advanced French courses at a large Midwestern research university. Participants in each course were assigned hypermedia readings, each of which being paired with an analogous traditional print reading of the same genre, with a similar word count and reading difficulty level, followed by a format preference survey. Results from data analysis of the format preference surveys showed statistically significant differences for user preference of the hypermedia texts and a user belief that the hypermedia format facilitated reading comprehension with less effort than print readings. Research findings about the reported usefulness of the annotation features are situated within Mayer's (2005) cognitive theory of multimedia learning. Directions for future research into the optimal design of hypermedia texts are discussed.","subject":"Hypermedia, Second Language Learning, Educational Technology, Technology Uses in Education, Audiovisual Instruction, Cultural Influences, Conventional Instruction, Student Attitudes, Reading Comprehension, Documentation, French, College Students, Reading Assignments, Printed Materials, Electronic Publishing, Student Surveys, Computer Software, Questionnaires","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143784","title":"Learning L2 Pronunciation with a Mobile Speech Recognizer: French \/y\/","author":"Liakin, Denis, Cardoso, Walcir, Liakina, Natallia","description":"This study investigates the acquisition of the L2 French vowel \/y\/ in a mobile-assisted learning environment, via the use of automatic speech recognition (ASR). Particularly, it addresses the question of whether ASR-based pronunciation instruction using a mobile device can improve the production and perception of French \/y\/. Forty-two elementary French students participated in an experimental study in which they were assigned to one of three groups: (1) the ASR Group, which used an ASR application on their mobile devices to complete weekly pronunciation activities, with immediate written visual (textual) feedback provided by the software and no human interaction; (2) the Non-ASR Group, which completed the same weekly pronunciation activities in individual weekly sessions but with a teacher who provided immediate oral feedback using recasts and repetitions; and finally, (3) the Control Group, which participated in weekly individual meetings 'to practice their conversation skills' with a teacher who provided no pronunciation feedback. The study followed a pretest\/posttest design. According to the results of the dependent samples t-tests, only the ASR group improved significantly from pretest to posttest (p &lt; 0.001), and none of the groups improved in perception. The overall success of the ASR group on the production measures suggests that this type of learning environment is propitious for the development of segmental features such as \/y\/ in L2 French.","subject":"French, Second Language Learning, Pronunciation, Telecommunications, Handheld Devices, Automation, Teaching Methods, Elementary School Students, Comparative Analysis, Feedback (Response), Computer Software, Educational Technology, Technology Uses in Education, Randomized Controlled Trials, Mixed Methods Research, Pretests Posttests, Surveys, Interviews, Foreign Countries","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Canada (Montreal)"}]