[{"id":"EJ1137149","title":"Including a Programming Course in General Education: Are We Doing Enough?","author":"Ferguson, Roger C., Leidig, Paul M., Reynolds, John H.","description":"General education is more than a list of required courses a student must take to complete their degree. For most universities, general education is the groundwork for the student's university experience. These courses span multiple disciplines and allow students to experience a wide range of topics on their path to graduation. Programming classes, e.g., Introduction to Programming, have not typically been an option as part of a general education course sequence at most universities. This study found that, only half of universities offer any kind of programming course in the General Education (GenEd) Program. The data also show that only two-thirds of institutions offer a computing class of any kind as a general education option. Institutions with ABET accredited Information Systems (IS) programs are significantly lower in both of these categories. This paper demonstrates the reasoning and process for including a programming class as an option in a GenEd Program, thereby showing how a programming class can be used to satisfy the requirements of a general education course. This results in two significant advantages to the computing department and university since the departments expand their reach to many more students, with a potential of increasing the number of majors or minors within the department; and non-computing majors have the opportunity to take courses that have not traditionally been offered in the GenEd Program. The latter results in students receiving a more comprehensive education and exposure to skills in high demand.","subject":"Programming, Programming Languages, General Education, Required Courses, College Students, Introductory Courses, Computer Science Education, Majors (Students), Nonmajors, Hypothesis Testing, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109645","title":"Teaching Tip: Active Learning via a Sample Database: The Case of Microsoft's Adventure Works","author":"Mitri, Michel","description":"This paper describes the use and benefits of Microsoft's Adventure Works (AW) database to teach advanced database skills in a hands-on, realistic environment. Database management and querying skills are a key element of a robust information systems curriculum, and active learning is an important way to develop these skills. To facilitate active learning and produce a compelling narrative, the data structure and content of a useful pedagogically-oriented database should be realistic and lifelike. It should contain data that accurately depicts the business processes, functions, and entities of a realistic organization, structured in a way that demonstrates best practices in database design. Most database textbooks include sample databases, but these are often small and sparse of data. By contrast, Microsoft's AW database presents a robust, realistic, and comprehensive framework for many important educational objectives in an IS curriculum. This paper introduces the AW business case and database, and illustrates several pedagogical uses in an undergraduate CIS program.","subject":"Active Learning, Databases, Computer Software, Educational Benefits, Case Method (Teaching Technique), Case Studies, Skill Development, Information Systems, Curriculum Development, Educational Technology, Business Education, Best Practices, Database Design, Problem Based Learning, Problem Solving, Database Management Systems, Educational Objectives, Undergraduate Study, Computer Science Education, Programming Languages, Information Retrieval, Student Attitudes","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137403","title":"Where Do Student Outcomes Begin? Developing Professional and Personal Management Skills as a Strategy for Student Success in the First Computing Course and Beyond","author":"Humpherys, Sean, Babb, Jeffry, Abdullat, Amjad","description":"Through the annual ABET assessment process, Computer Information Systems faculty in the College of Business at a regional institution were able to diagnose problems regarding students not satisfying our program's Student Outcomes. Often, the impediments to student success were not technical in nature and prompted faculty to consider non-technical solutions. A framework for the interaction and interdependency of the technical and non-technical skills, termed the &quot;Blue and Green Curve&quot; is presented that describes balancing emphasis on the technical curriculum (Blue Curve) and professional and personal management skills (Green Curve) that have the potential to accelerate students' acquisition of technical skills. The framework prescribes a foundation of effective habits to establish early in a student's academic career. Guided by this framework, changes to a freshman-level programming fundamentals course in the CIS program are described. Pedagogical tools with assignments and rubrics that support the curriculum changes are shared. These changes, among others factors, may have contributed to a 10% increase in the freshman persistence rate over a two semester period.","subject":"Computer Science Education, Outcomes of Education, Skill Development, Business Administration Education, Business Schools, Barriers, Introductory Courses, College Freshmen, Curriculum Development, College Curriculum, Assignments, Scoring Rubrics, Job Skills, Case Studies, Behavioral Objectives","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Texas"},{"id":"EJ1113940","title":"From Tech Skills to Life Skills: Google Online Marketing Challenge and Experiential Learning","author":"Croes, Jo-Anne V., Visser, Melina M.","description":"The Google Online Marketing Challenge (GOMC) is a global, online student competition sponsored by Google. It is a prime example of an experiential learning activity that includes using real money ($250 sponsored by Google) with a real client. The GOMC has yielded compelling results in student engagement and learning objectives related to the direct digital marketing skills addressed. However, few studies have systematically scrutinized the broader personal and life skills inherent in experience-based learning. The current study explores learning outcomes of the GOMC from a student perspective including both the direct technical skills as well as broader, multidisciplinary life skills that are developed or enhanced. The study takes an inductive approach to examine the life skills endorsed by a pilot group of GOMC participants and subsequently examines these learning outcomes in a preliminary quantitative survey of 15 GOMC participants from an undergraduate Information Systems course. Study findings yielded perceived learning outcomes in the following areas: interpersonal life skills, digital technical skills directly related to course and challenge content, intrapersonal life skills (self-awareness, reflection, and strategic planning), and adaptive applied skills. The students' overall perceptions, challenges experienced, and reported implementation preferences are also discussed.","subject":"Internet, Search Engines, Experiential Learning, Marketing, Competition, Learning Activities, Learner Engagement, Outcomes of Education, Skill Development, Daily Living Skills, Interdisciplinary Approach, Pilot Projects, Student Surveys, Undergraduate Students, Information Systems, Technological Literacy, Interpersonal Competence, Self Concept, Reflection, Strategic Planning, Student Attitudes, Preferences, Teamwork, Leadership, Problem Solving","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137143","title":"The Impact of Programming Experience on Successfully Learning Systems Analysis and Design","author":"Wong, Wang-chan","description":"In this paper, the author reports the results of an empirical study on the relationship between a student's programming experience and their success in a traditional Systems Analysis and Design (SA&amp;D) class where technical skills such as dataflow analysis and entity relationship data modeling are covered. While it is possible to teach these technical skills to students without programming experience, the results of the study strongly suggest that students with programming experience complete the course more successfully than those without.","subject":"Programming, Information Systems, Systems Analysis, Design, Problem Solving, Systems Development, Information Technology, Regression (Statistics), Hypothesis Testing, College Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137190","title":"IT0: Discrete Math and Programming Logic Topics as a Hybrid Alternative to CS0","author":"Martin, Nancy L.","description":"This paper describes the development of a hybrid introductory course for students in their first or second year of an information systems technologies degree program at a large Midwestern university. The course combines topics from discrete mathematics and programming logic and design, a unique twist on most introductory courses. The objective of the new course is to better prepare students for more advanced computing courses. Two primary drivers motivated development of the new course: 1) faculty evidence of deficient foundation skills in advanced level courses, and 2) consideration of program accreditation criteria.","subject":"Mathematics Instruction, Programming, Introductory Courses, Information Systems, Information Technology, College Students, Accreditation (Institutions), Mathematical Logic, Thinking Skills, Problem Solving, Universities","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137322","title":"A Proposed Concentration Curriculum Design for Big Data Analytics for Information Systems Students","author":"Molluzzo, John C., Lawler, James P.","description":"Big Data is becoming a critical component of the Information Systems curriculum. Educators are enhancing gradually the concentration curriculum for Big Data in schools of computer science and information systems. This paper proposes a creative curriculum design for Big Data Analytics for a program at a major metropolitan university. The design emphasizes expanded learning of business, mathematical and statistical, and presentation skills, in projects of teams, in addition to skills in technology. This paper will be beneficial to educators considering improvement of the curriculum for Big Data Analytics and to students desiring a more contemporary program.","subject":"Curriculum Design, Data Analysis, Data Collection, Information Systems, Computer Science Education, College Students, Information Security, Privacy, Student Educational Objectives, Core Curriculum, Prerequisites, Textbooks","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"New York (New York)"},{"id":"EJ1137388","title":"The Effectiveness of Data Science as a Means to Achieve Proficiency in Scientific Literacy","author":"Ceccucci, Wendy, Tamarkin, Dawn, Jones, Kiku","description":"Data Science courses are becoming more prevalent in recent years. Increasingly more universities are offering individual courses and majors in the field of Data Science. This study evaluates data science education as a means to become proficient in scientific literacy. The results demonstrate how the educational goals of a Data Science course meet the scientific literacy criteria in regards to the process of science. Based on the commonality between data science and scientific literacy courses, the paper concludes that a data science course can be used as an alternative way for students in any major to gain scientific literacy skills.","subject":"Information Science, Higher Education, Scientific Literacy, Data Analysis, Data Collection, Science Process Skills, Scientific Methodology","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077591","title":"A Job Announcement Analysis of Educational Technology Professional Positions: Knowledge, Skills, and Abilities","author":"Kang, YoungJu, Ritzhaupt, Albert D.","description":"The purpose of this research was to identify the competencies of an educational technologist via a job announcement analysis. Four hundred job announcements were collected from a variety of online job databases over a 5-month period. Following a systematic process of collection, documentation, and analysis, we derived over 150 knowledge, skill, and ability statements from the job announcements themselves based on a conceptual framework. We coded the frequency to which the competencies occurred in each announcement and summarized the results meaningfully in our article. Results suggest educational technologists must be competent in multiple areas, but especially in instructional design, project management, technical skills, and soft skills. Results provide compelling evidence that educational technology professionals must work with a wide variety of stakeholders in their work. The findings of our research are relevant to professionals, professional associations, and academic programs interested in competencies. A discussion for the results is provided.","subject":"Educational Technology, Competence, Occupational Information, Job Analysis, Coding, Instructional Design, Program Administration, Job Skills, Skill Analysis, Employment Qualifications, Educational Background, Ability Identification","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137147","title":"Empowering Freshmen with Technology Skills: Wireless Routers","author":"VanderClock, William","description":"Most freshmen taking required, introductory information systems courses do not understand why they are required to take such courses and can't imagine that they will learn anything they don't already know. This paper presents an exercise that will excite and enthuse students about their computers and Information Systems in general. Every freshman is familiar with wireless network connections having used them with both their computers and their phones. The setup of those wireless networks however is somewhat of a mystery and considered far too complex to deal with by most students. This paper outlines a strategy for demystifying the technology and involving students in hands-on learning. By actually setting up a wireless router students gain confidence in their computer skills and become interested in learning more about information systems. This paper describes the process used to gain their interest and includes a handbook that can be used with students everywhere.","subject":"College Freshmen, Computer Literacy, Information Systems, Technological Literacy, Skill Development, Introductory Courses, Computer Networks, Telecommunications, Experiential Learning, Computer Science Education, Hands on Science, Learner Engagement","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137339","title":"Why Phishing Works: Project for an Information Security Capstone Course","author":"Pollacia, Lissa, Ding, Yan Zong, Yang, Seung","description":"This paper presents a project which was conducted in a capstone course in Information Security. The project focused on conducting research concerning the various aspects of phishing, such as why phishing works and who is more likely to be deceived by phishing. Students were guided through the process of conducting research: finding background and related work on the topic, determining the hypothesis, development of the survey system, data collection, analysis of the results, and writing of the academic paper. This project was very successful in that students gained in-depth knowledge about phishing, developed an understanding of research and academic writing, and learned to statistically analyze data to support or refute their hypothesis. Educators who are teaching a capstone course in Information Security may be interested in this project because it is an appropriate level for undergraduate seniors, it can be accomplished in one semester, and the participants can be other students at the institution.","subject":"Information Security, College Seniors, Research Projects, Student Research, Research Methodology, Research Papers (Students), Research Skills, Writing Skills, Skill Development, Statistical Analysis, Hypothesis Testing, Library Research, Web Sites, Electronic Mail, Surveys, Test Construction, Student Developed Materials","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137387","title":"Live, Model, Learn: Experiencing Information Systems Requirements through Simulation","author":"Hartzel, Kathleen S., Pike, Jacqueline C.","description":"Information system professionals strive to determine requirements by interviewing clients, observing activities at the client's site, and studying existing system documentation. Still this often leads to vague and inaccurate requirements documentation. When teaching the skills needed to determine requirements, it is important to recreate a realistic environment to develop analytical thinking skills. To address this, we developed a simulation for students to learn requirements gathering and analysis where they experience the requirements by operating a fictitious manufacturing firm. The students manage and operate the company, taking on a variety of employee roles from the physical &quot;manufacturing&quot; to the order-taking to the purchasing of component parts. With this pedagogical approach, students deal with the messiness of the problem by drawing on their own experience working in the manufacturing firm, making assumptions, and having the opportunity to verify their assumptions and analyses by working with their classmates. The simulation was implemented across two courses in an undergraduate information systems program.","subject":"Information Systems, Simulation, Teaching Methods, Employees, Role, Manufacturing Industry, Administration, Experiential Learning, Undergraduate Study, Active Learning, Inquiry, Systems Analysis, Design, Information Management, Student Attitudes, Student Surveys, Likert Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1084380","title":"The Writer's Individualized Transfer Tool: A Freeware Innovation for Fostering and Researching Transfer of Writing Skills and Knowledge","author":"Khost, Peter H.","description":"Most higher education institutions lack a program that promotes students' transfer--that is, reapplication or repurposing--of writing skills and knowledge across the curriculum, a phenomenon that research shows does not tend to happen without deliberate sustained support. This article introduces an online instrument, the Writer's Individualized Transfer Tool, which the author invented to intervene in this area as a supplemental or provisional effort, using freeware to foster and research students' writing transfer from first-year composition to other courses and potentially beyond. The article reviews relevant scholarship on transfer in writing, describes and illustrates Writer's Individualized Transfer Tool's design, provides instructions for the tool's implementation and usage, reviews some results from a pilot study of an application of the tool in an first-year composition curriculum, and discusses related issues requiring further consideration.","subject":"Freshman Composition, Writing Skills, Computer Software, Writing Across the Curriculum, Transfer of Training, Metacognition, Program Implementation, Pilot Projects, Outcomes of Education, Writing Instruction, Student Surveys","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137155","title":"An IT Strategy Course: Why and How","author":"Woods, David M., Howard, Elizabeth V.","description":"With continuing changes in all aspects of the technology field, especially the emergence of cloud and &quot;as a service&quot; offerings, developing skills for strategic thinking about technology is of increasing importance to our students. However, the presence of formal IS\/IT strategy courses in programs of study trails that of more traditional courses. In addition, there is limited discussion on the teaching of strategy in the academic literature. This work offers reasons for the continued importance of teaching strategy and provides examples of how strategy is covered in a course on Global and Strategic Issues in IT.","subject":"Information Systems, Information Technology, Active Learning, Experiential Learning, Technology Uses in Education, College Students","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Ohio"},{"id":"EJ1137390","title":"Slushie World: An In-Class Access Database Tutorial","author":"Wynn, Donald E., Jr., Pratt, Renée M. E.","description":"The Slushie World case study is designed to teach the basics of Microsoft Access and database management over a series of three 75-minute class sessions. Students are asked to build a basic database to track sales and inventory for a small business. Skills to be learned include table creation, data entry and importing, form and report design, switchboards, and numerous single and multiple table query designs. The resulting application is sufficient for students to identify a number of basic functions available to the small business, including order entry, sales reports, customer information, and more. The case is designed to be used in a course where the students have little or no prior relational database experience, such as an Introduction to MIS course.","subject":"Case Studies, Teaching Methods, Databases, Computer Science Education, Database Design, Small Businesses, Skill Development, Information Systems, Case Method (Teaching Technique)","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137333","title":"Teaching Non-Beginner Programmers with App Inventor: Survey Results and Implications","author":"Soares, Andrey, Martin, Nancy L.","description":"This paper reports the results of a survey with 40 students enrolled in an Android Application Development course offered during the spring semester of 2013 and 2014. The course used App Inventor to build the apps and required students to have an introduction to programming course as a prerequisite. The survey asked for demographic information and students' opinions about prerequisites, App Inventor, previous programming skills, new concepts learned, teamwork, and more. The positive responses support the practice of using App Inventor to teach not only beginner programmers, but also more experienced programmers. The paper also shows that App Inventor can be used to support the teaching of more advanced computing concepts. [Note: The issue month (October) shown on this PDF is incorrect. The correct publication month is September 2015.]","subject":"Computer Science Education, Computer Oriented Programs, Programming, Advanced Courses, Advanced Students, Student Attitudes, Student Surveys, Likert Scales, Prior Learning, Prerequisites, Novices, Secondary Education, Higher Education","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137342","title":"Introducing Big Data Concepts in an Introductory Technology Course","author":"Frydenberg, Mark","description":"From their presence on social media sites to in-house application data files, the amount of data that companies, governments, individuals, and sensors generate is overwhelming. The growth of Big Data in both consumer and enterprise activities has caused educators to consider options for including Big Data in the Information Systems curriculum. Introducing Big Data concepts and technologies in the classroom often is reserved for advanced students in database or programming courses. This paper explores approaches for integrating Big Data into the Information Systems curriculum, and presents a sample lesson for presenting basic Big Data concepts to first year students in a general education Information Technology course. As the need for IT professionals with Big Data skills will continue to increase, including these topics in a general education technology curriculum is especially pertinent.","subject":"Data Analysis, Introductory Courses, Information Systems, Information Technology, College Freshmen, General Education, Business Schools, Student Evaluation, Knowledge Level, Pretests Posttests, Experiential Learning, Visualization, Social Media, Databases, Student Surveys","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Massachusetts"},{"id":"EJ1137385","title":"Experiential Learning Using QlikView Business Intelligence Software","author":"Podeschi, R. J.","description":"This paper reports on the use of QlikView business intelligence software for use in a Business Intelligence (BI) course within an undergraduate information systems program. The course provides students with concepts related to data warehousing, data mining, visualizations, and software tools to provide business intelligence solutions for decision making. The goal of the course is to balance both the technical and business skills students require when using business intelligence systems. Specific use of the software QlikView is outlined through an experiential project whereby students obtain, model, analyze, and interpret publicly accessible airline data. QlikView is a leading business intelligence software package that allows users to import data from a variety of sources to create visualization-based dashboards for reporting and analysis. The use of QlikView in this course addresses common challenges with using commercially available software in the classroom.","subject":"Experiential Learning, Business, Intelligence, Computer Software, Undergraduate Study, Business Administration Education, Information Systems, Course Objectives, Data Analysis, Data Interpretation, Models, Air Transportation, Visualization","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1109647","title":"Using Bloom's and Webb's Taxonomies to Integrate Emerging Cybersecurity Topics into a Computing Curriculum","author":"Harris, Mark A., Patten, Karen P.","description":"Recent high profile hackings have cost companies millions of dollars resulting in an increasing priority to protect government and business data. Universities are under increased pressure to produce graduates with better security knowledge and skills, particularly emerging cybersecurity skills. Although accredited undergraduate computing programs recognize the need to solve this problem, these computing programs are constrained by accreditation standards and have limited ability to modify their curricula. This paper discusses a case study on how one Accreditation Board for Engineering and Technology (ABET) accredited undergraduate IT program created a strategy to continue to teach existing security-related topics as well as emerging cybersecurity topics within its IT curriculum without increasing credit requirements. The faculty developed an &quot;IT Security-related and Cybersecurity Curriculum Taxonomy&quot; to identify strategies to move security-related topics taught in the higher level courses to lower and intermediate courses. Thus emerging cybersecurity topics could be added to high-level courses. The faculty also created the &quot;IT Student Learning (Security-related) Taxonomy&quot; by combining &quot;Bloom's Taxonomy's&quot; six levels of thinking with Webb's &quot;Depth of Knowledge Model.&quot; This student learning taxonomy enabled the faculty to review the student learning outcomes for each of the existing security-related core topics and develop new ones for the emerging cybersecurity topics. Challenges, benefits, and application of this strategy to other disciplines are discussed.","subject":"Taxonomy, Computer Security, Curriculum Development, Undergraduate Study, Computer Science Education, Case Studies, Accreditation (Institutions), Engineering Education, Technology Education, Information Technology, Educational Strategies, Educational Benefits, Curriculum Implementation","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137397","title":"A Match in the Making: How Emergent Changes in the Marketing Discipline Present Opportunities for Information Systems Programs","author":"Carley, Maureen, Babb, Jeffry","description":"The digital revolution is upon us, bringing with it disruptive forces in every aspect of business and personal interactions. The business marketing function has become so technologically driven it is sometimes hard to tell where the boundaries between the Marketing and Information Systems disciplines lie. The new world of digital marketing has changed how both marketing and technology professionals approach their jobs. Digital has created new roles, and much of what we knew and taught in higher education is no longer viable. New hybrid education programs are required to equip the new generation of workers with the skills they need to be successful. While marketing and information systems and technology education programs will undoubtedly continue to exist as separate entities, there are opportunities for cross pollination between the two disciplines. Just as corporate enterprises will need to embrace this new way of doing business if they are to be successful, so too will academic enterprises need to incorporate new methods and new ideas into their offerings if they are to remain competitive with their peer institutions. This paper explores the concept of how this new digital world has transformed the marketing function, the impact it has on the consumerization of information technology, and how higher education will have to respond. Digital has arrived, and it is here to stay.","subject":"Marketing, Information Systems, Interdisciplinary Approach, Information Technology, Social Media, Influence of Technology, Higher Education, Business Administration Education, Computer Science Education, Communication (Thought Transfer), Access to Information, Handheld Devices, Data","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084444","title":"Using Computer Simulations and Games to Prevent Student Plagiarism","author":"Bradley, Elizabeth G.","description":"In this increasingly digital age, student plagiarism is rampant. Roughly half of college students admit to plagiarizing using content found online, directly copying and pasting the work of others. Digital technology and social media have greatly changed the landscape of how knowledge is acquired and disseminated; thus, students must be explicitly taught digital literacy skills and how to correctly utilize information they find online. Computer simulations are an active, engaging, and efficient way of explicitly teaching students about plagiarism and how to avoid academic dishonesty. A number of colleges and universities provide free open source games and simulations, which can be utilized as course assignments or activities in order to explicitly teach students proper citation procedures. This article reviews 10 plagiarism prevention computer games and simulations, with details about each program, including access information.","subject":"Prevention, Plagiarism, Computer Simulation, Teaching Methods, Technological Literacy, College Students, Computer Games, Cheating, Open Source Technology, Assignments, Citations (References)","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137341","title":"Establishing the Basis for a CIS (Computer Information Systems) Undergraduate Program: On Seeking the Body of Knowledge","author":"Longenecker, Herbert E., Jr., Babb, Jeffry, Waguespack, Leslie J., Janicki, Thomas N., Feinstein, David","description":"The evolution of computing education spans a spectrum from &quot;computer science&quot; (&quot;CS&quot;) grounded in the theory of computing, to &quot;information systems&quot; (&quot;IS&quot;), grounded in the organizational application of data processing. This paper reports on a project focusing on a particular slice of that spectrum commonly labeled as &quot;computer information systems&quot; (&quot;CIS&quot;) and reflected in undergraduate academic programs designed to prepare graduates for professions as software developers building systems in government, commercial and not-for-profit enterprises. These programs with varying titles number in the hundreds. This project is an effort to determine if a common knowledge footprint characterizes CIS. If so, an eventual goal would be to describe the proportions of those essential knowledge components and propose guidelines specifically for effective undergraduate CIS curricula. Professional computing societies (ACM, IEEE, AITP (formerly DPMA), etc.) over the past fifty years have sponsored curriculum guidelines for various slices of education that in aggregate offer a compendium of knowledge areas in computing. This paper describes a project to determine the subset of that compendium pertinent to CIS. The project began by surveying experienced academic curriculum designers self-identified with the CIS perspective. The pilot survey results reported herein indicate that many essential knowledge areas of CIS are shared with published IS curricular guidelines but, design and implementation of database systems, software development and project management are distinctive in CIS. The next project phase launches a revised survey suitable for a general audience of computing academics. The intention is to triangulate the perspectives of a widely varied population of computing academics to further crystalize the distinctiveness of CIS as a well-formed closely related discipline of IS with a core of necessary knowledge and skills--then to develop curricular guidelines for undergraduate CIS education.","subject":"Computer Science Education, Information Systems, Undergraduate Study, College Programs, College Curriculum, Educational History, Accreditation (Institutions), Surveys","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084414","title":"Teaching Adult Learner Characteristics and Facilitation Strategies through Simulation-Based Practice","author":"Speed, Sally A., Bradley, Elizabeth, Garland, Krista Vince","description":"This article relates a project in which a curriculum module was developed to help graduate students more effectively manage behaviors of adults in facilitation sessions. The module was piloted in the project and later included in a graduate level course in the Creative Studies Department of SUNY Buffalo State. The curriculum identified characteristics of adult learners and behaviors that manifest from those characteristics and helped Creative Studies graduate students develop strategies to manage such behaviors in facilitation sessions. The module included practice sessions for facilitation using TeachLivE™, a mixed reality simulation that offers education students practice in classroom management with avatars to enhance their teaching skills. Results indicated that students felt they were more capable of managing adult learner behaviors and more confident and effective in facilitations as a result of the module and TeachLivE™ simulation.","subject":"Adult Learning, Graduate Students, Learning Modules, Computer Simulation, Classroom Techniques, Experiential Learning, Quasiexperimental Design, Pilot Projects, Curriculum Development, Student Educational Objectives, Feedback (Response), Longitudinal Studies, Pretests Posttests, Likert Scales, Student Surveys, Program Effectiveness, Data Analysis, Qualitative Research, Statistical Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1072620","title":"The Doctor Is In, but Is Academia? Re-Tooling II Education for a New Era in Healthcare","author":"Lee, Andre, Moy, Lawrence, Kruck, S. E., Rabang, Joshua","description":"Healthcare information technology is at a crossroads today. As legacy data systems converge with bleeding edge technologies, the technology environments of today's hospitals and clinics are evolving rapidly, producing new care delivery models. As a result, we need to reassess how information technology education is meeting the needs of healthcare practitioners and institutions. The recent push to adopt Health Information Technology (HIT) with financial incentives and penalties attached was a bold move, but establishing policies is easier to pen than implement. The challenge faced by many healthcare organizations is the lack of technical and organizational infrastructure, as well as skilled man power. This special issue seeks to bring new approaches to the IT classroom, particularly with HIT curriculum, training, and education. Students entering the workforce or completing professional programs will have more career options with an understanding of how to leverage enabling technologies. Those in a healthcare management and leadership capacities will also benefit from this special edition as each of the articles presented address strategic level issues and the need for IT leadership in the planning and implementation of enterprise level systems, to ensure the safety, privacy and security off all patients are protected. The authors of this special issue offer interdisciplinary perspectives on key topics shaping HIT around the world. As members of academia, curriculum is at the heart of the matter and our authors offer justification and case studies on areas where academia needs to continue its growth to serve the healthcare industry.","subject":"Health Education, Information Technology, Technological Advancement, Technological Literacy, Technology Integration, Technology Transfer, Information Science Education, Information Systems, Role of Education, Information Security, Information Networks, Educational Practices, Educational Needs, Job Skills, Higher Education","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121046","title":"Organization of Physical Activities as a Precondition of Quality Development of Motor Abilities of Pre-School and School Children","author":"Markovic, Živorad, Kopas-Vukašinovic, Emina","description":"In their work authors consider the significance of the organization of physical activities for the development of abilities of pre-school and school children. Led by theoretical basis that physical development of children represents the basis of their whole development, and that &quot;fine motor skills&quot; are determined by the development of its large motorics, the authors point to the significance of the content and structure of physical education programme in preschool institutions and younger age school classes. It is evident that the effects of cultivating of children development during preschool period can be seen in younger primary school classes. The goal of this research was to determine if and how much the different organization of preparatory part of physical education lesson for younger school children, determines the differences in the development of their motor abilities. By the use of experimental method, the effects of prolonged preparatory part of a lesson in younger school classes. This part was realized through complex of exercises which were supposed to have influence on transformation of motor abilities in relation to the structure with standard duration of certain parts of a lesson. It is determined that certain increase in body movement of students during physical activity can significantly contribute to better development of motor abilities. These abilities determine correct physical development and strengthening of health, which determines general aim of physical education.","subject":"Psychomotor Skills, Physical Activities, Preschool Children, Physical Activity Level, Physical Education, Foreign Countries, Experimental Groups, Control Groups, Statistical Analysis, Elementary School Students","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Serbia"},{"id":"EJ1121024","title":"Tutoring and Mentoring: An A.R.C. Model for Future Teachers: Affective, Reflexive and Cognitive Orientation to Self-Regulated Learning","author":"Remy, Philippe","description":"With a specific focus on tutoring among future teachers this article proposes a model of self-regulated learning. The focus on different mechanisms inherent to the tutoring relationship will consider Affective impacts or motivation, Reflexive or metacognitive and Cognitive resolutions. The ARC combination proposes that personal skills will be gained and beneficial transfers into the class will be possible. This approach with a model considers explicit learning as a part of tutoring relationship successes. A prospective study on a short scale provides a few indicators in this direction and will be followed by a mentoring study. As private companies also present services in the shadow of the official educational system some recommendations will illustrate the tutoring original pedagogical relation with specific limits and the potential for new understanding.","subject":"Tutoring, Mentors, Motivation, Preservice Teachers, Learning Processes, Qualitative Research, Interviews, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1121048","title":"Towards a Methodology to Identify a Talent by Using Psychological Cognitive Prototyping","author":"Hammer, Matthijs H. M.","description":"Since education became an important aspect of society, teachers have a prelove for highly talented students. Especially young talented people relish profound attention of universities, firms, music ensembles, sports societies and artist groups. In higher education, students are encouraged to develop their unique strong point, named as talents. Around the globe, universities, institutes of higher and professional education provide students with programs for talent development and exploitation. Practitioners and educators complain on a regular basis that students rarely aware of what their talents are. It is experienced as difficult to identify them. This paper explores the possibility for mechanisms to identify, or recognize, a talent. Scholars and consultants developed many instrument on the development and exploitation of talents. But how can talents be identified? In this paper the fuzzy front end of talent recognition will be fostered. It is advocated that the psychological cognitive prototyping principles can be applied to identify the prototype of a talent.","subject":"Talent Identification, Psychomotor Skills, Psychological Patterns, Individual Characteristics, Academically Gifted, Foreign Countries, Models, Cognitive Ability, Group Discussion, Undergraduate Students, Maturity (Individuals)","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1121028","title":"Communication and Reception in Teaching: The Age of Image &quot;versus&quot; the &quot;Weight&quot; of Words","author":"Bradea, Adela","description":"Contemporary culture is mainly a culture of image. We get our information seeing. Examination of images is free, while reading is impelled by the necessity of browsing the whole text. The image seems more appropriate than the text when trying to communicate easy and quickly. The speech calls for articulated language, expressed through a symbolic set of oral or written codes that we must master. Understanding an image requires less work and fewer skills than reading a text. This paper aims to highlight how messages are perceived and received within the educational activities, through the two types of communication, iconic and logical-linguistic. The instrument used in conducting the research was represented by a questionnaire consisting from objective and subjective items, applied to students from high schools in Oradea. Besides these questionnaires, a key role in the study was played by the knowledge gained while observing lessons held by students of the University of Oradea within their teaching placement, as well as while supervising teachers from secondary educational institutions in the process of obtaining teacher certification level 1. The obtained results prove that the majority of investigated students prefer the combination of two types of communication in teaching.","subject":"High School Students, Learning Modalities, Visual Learning, Questionnaires, Intermode Differences, Interpersonal Communication, Learning Activities, Teaching Methods, Preferences, Cognitive Style, Educational Practices, Foreign Countries","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Romania"},{"id":"EJ1121003","title":"Development of Walking and Self-Sufficiency Ability Related to Nutrition among People with Down Syndrome","author":"Brantmüller, Éva, Gyuró, Monika, Karácsony, Ilona","description":"Development of the walking ability and self-care of patients with Down syndrome is affected by their body weight determining their lifestyle to a great extent. Objectives: The study aimed at the determination of body mass index for persons living in residential institutions and families, exploration its impact on walking and self-care as two, objective factors of life quality. Method: Data collection of persons aged 3-35 with Down syndrome living in families covered seven counties, while those of living in residential institutions covered thirteen counties in Hungary. In the 183 cases studied 76 people in residential institutions, 107 people lived in families. The cross-sectional study was processed by non-random sample selection. The questionnaires were filled out by health visitors and care takers edited by their own. Results: 50.6% of adults and 26.1% of children belonged to the overweight or obese category. Their residence showed a significant correlation with the body mass index (p&lt; 0.001). Overweight and obese persons in families, while thin ones were more prevalent in institutions. Regarding the walking ability and self-care of the persons living in families a significantly higher level of development was achieved (p&lt; 0.001). Walking ability (p = 0.001) and self-care (p = 0,008) were worsened by less body weight significantly, while overweight or obesity influenced it less negatively. Discussion: The claim is not further acceptable whereas persons with Down syndrome are more prone to obesity than average people. However unfavourable weight gain in adults draws attention to the necessity to a healthy diet and regular exercise. The people living in residential institutions with significantly lower body mass index and the associated low development of walking ability and self-care envisages an urgent reform of residential institutions. Life in the institutions negatively affects the walking ability and self-care, and thus significantly reduces the quality of life of persons with Down's syndrome.","subject":"Personal Autonomy, Physical Activities, Nutrition, Down Syndrome, Questionnaires, Obesity, Body Weight, Life Style, Body Composition, Daily Living Skills, Residential Care, Family Environment, Case Studies, Caregiver Attitudes, Health Personnel, Correlation, Foreign Countries, Statistical Analysis","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"}]