[{"id":"EJ1137326","title":"Business Analytics in Practice and in Education: A Competency-Based Perspective","author":"Mamonov, Stanislav, Misra, Ram, Jain, Rashmi","description":"Business analytics is a fast-growing area in practice. The rapid growth of business analytics in practice in the recent years is mirrored by a corresponding fast evolution of new educational programs. While more than 130 graduate and undergraduate degree programs in business analytics have been launched in the past 5 years, no commonly accepted model of business analytics curriculum yet exists. Drawing on competency-based curriculum design literature, we take the first steps towards initiating a debate on the model curriculum in business analytics. We analyze a sample of business analytics job announcements from different industries and identify a preliminary set of business analytical competencies sought in practice. Further, we examine six existing graduate programs in business analytics, which reveal divergent approaches to business analytics curricula. These institutions were selected since they offered a graduate degree program in business analytics for at least two years. Our findings indicate that there are significant variations in the program structure in terms of program length (10 to 18 months) and flexibility (electives comprise 0 to 37% of the course work). We also found that the programs vary greatly in the coverage of both traditional analytics and the new emergent technologies and analytical methods. We conclude with a commentary on the emergent trends in business analytics in practice and the opportunities presented by these trends for the academia.","subject":"Business, Data Collection, Competence, Competency Based Education, Curriculum Design, Industry, Graduate Study, Program Content, Information Systems","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077591","title":"A Job Announcement Analysis of Educational Technology Professional Positions: Knowledge, Skills, and Abilities","author":"Kang, YoungJu, Ritzhaupt, Albert D.","description":"The purpose of this research was to identify the competencies of an educational technologist via a job announcement analysis. Four hundred job announcements were collected from a variety of online job databases over a 5-month period. Following a systematic process of collection, documentation, and analysis, we derived over 150 knowledge, skill, and ability statements from the job announcements themselves based on a conceptual framework. We coded the frequency to which the competencies occurred in each announcement and summarized the results meaningfully in our article. Results suggest educational technologists must be competent in multiple areas, but especially in instructional design, project management, technical skills, and soft skills. Results provide compelling evidence that educational technology professionals must work with a wide variety of stakeholders in their work. The findings of our research are relevant to professionals, professional associations, and academic programs interested in competencies. A discussion for the results is provided.","subject":"Educational Technology, Competence, Occupational Information, Job Analysis, Coding, Instructional Design, Program Administration, Job Skills, Skill Analysis, Employment Qualifications, Educational Background, Ability Identification","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077606","title":"Examining the Effect of External Factors and Context-Dependent Beliefs of Teachers in the Use of ICT in Teaching: Using an Elaborated Theory of Planned Behavior","author":"Salleh, Sallimah, Laxman, Kumar","description":"Research into teachers' attitudes, beliefs, competence, and inhibitions in relation to their use of technology may provide answers to a series of questions from administrators that relate to teachers' classroom implementation of Information and Communication Technology. The theory of planned behavior is a useful model for providing a framework for predicting and explaining behaviors and a guideline for intervention purposes that would produce effective behavioral change. In this study, the elaborated theory of planned behavior model, Information and Communication Technology Use Model was used as a specific theoretical framework for the purpose of identifying factors that can be used for designing intervention or mounting professional development workshops for Information and Communication Technology implementation that will effectively induce change in teachers' behavior.","subject":"Computer Uses in Education, Teacher Attitudes, Beliefs, Influences, Context Effect, Behavior Theories, Teacher Behavior, Models, Behavior Change, Secondary School Teachers, Teacher Surveys, Questionnaires, Intention, Foreign Countries, Multiple Regression Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Brunei"},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1077771","title":"Assessing the Efficacy of Incorporating Game Dynamics in a Learning Management System","author":"Frost, Raymond D., Matta, Vic, MacIvor, Erin","description":"The goal of the study was to see if gamification of a Learning Management System (LMS) would increase a number of desirable outcomes: student interest, motivation, satisfaction, student learning and perception of pedagogical affect. These constructs were measured in a survey, except for learning, which was measured by grades. Gamification of the LMS included the addition of all of the following: (1) An illustrated hero's adventure storyline with monsters to overcome by completing quests (assignments and assessments), (2) Olympic colored badges to represent individual grades as well as overall progress, (3) Points earned on a game-like scale--e.g., 100,000 points for the course, (4) A leaderboard with anonymous names and avatars, (5) Lives which allowed students to turn in a fixed number of late assignments without penalty. While open-ended responses suggested that students appreciated some gamification aspects, the quantitative data suggested that gamification has virtually no effect on the constructs measured. Only relatedness (a sub-construct of motivation) and student interest were found to be significant, although with small effect sizes. This study contributes to existing literature by exploring the impact of gamification of an LMS for a required introductory course in information systems.","subject":"Integrated Learning Systems, Games, Student Interests, Student Motivation, Student Satisfaction, Learning, Student Attitudes, Student Surveys, Grades (Scholastic), Self Determination, College Students, Business Administration Education, Personal Autonomy, Competence, Interpersonal Relationship, Pretests Posttests","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1113940","title":"From Tech Skills to Life Skills: Google Online Marketing Challenge and Experiential Learning","author":"Croes, Jo-Anne V., Visser, Melina M.","description":"The Google Online Marketing Challenge (GOMC) is a global, online student competition sponsored by Google. It is a prime example of an experiential learning activity that includes using real money ($250 sponsored by Google) with a real client. The GOMC has yielded compelling results in student engagement and learning objectives related to the direct digital marketing skills addressed. However, few studies have systematically scrutinized the broader personal and life skills inherent in experience-based learning. The current study explores learning outcomes of the GOMC from a student perspective including both the direct technical skills as well as broader, multidisciplinary life skills that are developed or enhanced. The study takes an inductive approach to examine the life skills endorsed by a pilot group of GOMC participants and subsequently examines these learning outcomes in a preliminary quantitative survey of 15 GOMC participants from an undergraduate Information Systems course. Study findings yielded perceived learning outcomes in the following areas: interpersonal life skills, digital technical skills directly related to course and challenge content, intrapersonal life skills (self-awareness, reflection, and strategic planning), and adaptive applied skills. The students' overall perceptions, challenges experienced, and reported implementation preferences are also discussed.","subject":"Internet, Search Engines, Experiential Learning, Marketing, Competition, Learning Activities, Learner Engagement, Outcomes of Education, Skill Development, Daily Living Skills, Interdisciplinary Approach, Pilot Projects, Student Surveys, Undergraduate Students, Information Systems, Technological Literacy, Interpersonal Competence, Self Concept, Reflection, Strategic Planning, Student Attitudes, Preferences, Teamwork, Leadership, Problem Solving","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1120922","title":"Pedagogical Aspects of Voluntary School Work","author":"Mária Jármai, Erzsébet, Palányi, Ildikó Zsupanekné","description":"The economic importance of voluntary work has been exceedingly appreciated in the last few decades. This is not surprising at all, because it is highly profitable according to the related estimated data. There are 115,9 million people doing voluntary work only in Europe, which means that they would create the world's 7th biggest economy with EUR 282 billion value creation if they formed an individual state. The organizations know that voluntary work has several advantages apart from the economic benefits. It is profitable both for the society and for the individuals as well. Several researches have proven that voluntary work positively influences the development of the personality, because the key-competencies--such as: co-operation, empathy, solidarity, conflict handling, problem solving, etc.--expected in the labor market can be improved.","subject":"Foreign Countries, Volunteers, Labor Market, Labor Force Development, Informal Education, Service Learning, Student Attitudes, High School Students, College Students, Competence, Social Capital, Student Motivation, Age Differences, Required Courses, Literature Reviews, Questionnaires, Student Participation, Incidence, Likert Scales, Scores, Work Experience","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Hungary"}]