[{"id":"EJ1109690","title":"Examining Learning Styles and Perceived Benefits of Analogical Problem Construction on SQL Knowledge Acquisition","author":"Mills, Robert J., Dupin-Bryant, Pamela A., Johnson, John D., Beaulieu, Tanya Y.","description":"The demand for Information Systems (IS) graduates with expertise in Structured Query Language (SQL) and database management is vast and projected to increase as &quot;big data&quot; becomes ubiquitous. To prepare students to solve complex problems in a data-driven world, educators must explore instructional strategies to help link prior knowledge to new knowledge. This study examined learning styles and the perceived benefits of analogical problem construction on SQL knowledge acquisition. The data collected from 80 participants suggests there is a perceived positive benefit to using analogical problem construction for learning introductory database concepts. The learning style of the majority of students in the sample is &quot;Active-Sensing-Visual-Sequential.&quot; However, learning styles were not related to student perceived impact of analogical problem construction to understand database concepts. Student analogies were collected for a variety of SQL concepts; noteworthy examples are highlighted. While results related to learning styles are intriguing, the most promising path for further exploration (for both research and practice) is the use of analogy problem construction in Information Systems educational environments.","subject":"Cognitive Style, Databases, Information Systems, Information Science, Problem Solving, Teaching Methods, Prior Learning, Student Attitudes, Concept Formation, Transfer of Training, Logical Thinking, College Students, Questionnaires, Statistical Analysis","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137337","title":"Teaching Business Intelligence through Case Studies","author":"Pomykalski, James J.","description":"In teaching business students about the application and implementation of technology, especially involving business intelligence, it is important to discover that project success in enterprise systems development efforts often depend on the non-technological problems or issues. The focus of this paper will be on the use of multiple case studies in an information systems strategy course, taught to business majors, which highlight the importance of non-technological factors. Each of the cases reinforces the need for senior management support, effective change management procedures, focus on data acquisition and quality, attention to key business process, and the integration into the existing organizational infrastructure as key drivers in project success. This approach utilizes the work system framework as a basis for case study analysis.","subject":"Computer Software, Case Studies, Information Systems, Business Administration Education, Majors (Students), Administrator Role, Data Collection, College Students, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137403","title":"Where Do Student Outcomes Begin? Developing Professional and Personal Management Skills as a Strategy for Student Success in the First Computing Course and Beyond","author":"Humpherys, Sean, Babb, Jeffry, Abdullat, Amjad","description":"Through the annual ABET assessment process, Computer Information Systems faculty in the College of Business at a regional institution were able to diagnose problems regarding students not satisfying our program's Student Outcomes. Often, the impediments to student success were not technical in nature and prompted faculty to consider non-technical solutions. A framework for the interaction and interdependency of the technical and non-technical skills, termed the &quot;Blue and Green Curve&quot; is presented that describes balancing emphasis on the technical curriculum (Blue Curve) and professional and personal management skills (Green Curve) that have the potential to accelerate students' acquisition of technical skills. The framework prescribes a foundation of effective habits to establish early in a student's academic career. Guided by this framework, changes to a freshman-level programming fundamentals course in the CIS program are described. Pedagogical tools with assignments and rubrics that support the curriculum changes are shared. These changes, among others factors, may have contributed to a 10% increase in the freshman persistence rate over a two semester period.","subject":"Computer Science Education, Outcomes of Education, Skill Development, Business Administration Education, Business Schools, Barriers, Introductory Courses, College Freshmen, Curriculum Development, College Curriculum, Assignments, Scoring Rubrics, Job Skills, Case Studies, Behavioral Objectives","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Texas"}]