[{"id":"EJ1143733","title":"Second Language Teacher Development through CALL Practice: The Emergence of Teachers&apos; Agency","author":"Kitade, Keiko","description":"A growing number of studies examining second language (L2) teacher education from the perspective of sociocultural theory, in particular the activity theory framework (Engeström, 1999), show that transformations in teachers' cognition and practice can be fostered through negotiation of sociocultural and cognitive dissonance in their teaching environments. This case study examines 16 years of cognitive development of two Japanese language teachers practicing computer-assisted language learning (CALL) and the challenges they experienced as a result of the evolution of information and communications technology (ICT). The focus is on the challenges faced by L2 teachers and their responses, and how these challenges relate to the development of teachers' agency as CALL practitioners. Narrative inquiry data for both participants were collected following the Trajectory Equifinality Approach (e.g., Valsiner &amp; Sato, 2006), in which each teacher's life trajectory is visualized to identify critical points based on social affordances and constraints. The critical points were further analyzed and interpreted within and between activity systems. The data suggests that the teachers became aware of the social nature of the technology through the challenges they encountered when coordinating their own and students' mismatched values attached to ICT. Such a change in perceptions not only impacted their pedagogical usage of the technology but in turn also constituted their agency.","subject":"Computer Assisted Instruction, Second Language Instruction, Language Teachers, Technology Uses in Education, Educational Technology, Technological Literacy, Empowerment, Japanese, Semi Structured Interviews, Teacher Attitudes, Social Influences, Faculty Development, Case Studies, Qualitative Research, Personal Narratives","source":"CALICO Journal","publicationdateyear":2015}]