[{"id":"EJ1074888","title":"Mobile Technology in Second Language Classrooms: Insights into Its Uses, Pedagogical Implications, and Teacher Beliefs","author":"Van Praag, Benjamin, Sanchez, Hugo Santiago","description":"Adopting a multiple-case, multiple-method design, this study investigates mobile technology use in the practices of three experienced second language teachers. The findings, based on an analysis of the teachers' rationales, stated beliefs and classroom actions, show that the teachers tend to prohibit or reluctantly tolerate mobile device usage, while they recognise some of its potential benefits to support their teaching and student learning. They also highlight the incentives and barriers which respectively facilitate and hinder the integration of mobile technology, including factors which are internal (e.g. beliefs) and external (e.g. contextual constraints) to the teachers. Implications for classroom practice and teacher education are drawn.","subject":"Teaching Methods, Educational Technology, Technology Uses in Education, Case Studies, Mixed Methods Research, Telecommunications, Handheld Devices, Teacher Attitudes, Barriers, Incentives, Technology Integration, Second Language Instruction","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048414","title":"Twenty Years of MALL Project Implementation: A Meta-Analysis of Learning Outcomes","author":"Burston, Jack","description":"Despite the hundreds of Mobile-Assisted Language Learning (MALL) publications over the past twenty years, statistically reliable measures of learning outcomes are few and far between. In part, this is due to the fact that well over half of all MALL-related studies report no objectively quantifiable learning outcomes, either because they did not involve MALL implementation projects, or if they did, learning gains were only based on subjective teacher assessments and\/or student self-evaluations. Even more so, the paucity of statistically reliable learning outcome data stems from the short duration of projects and small numbers of students involved. Of the 291 distinct studies examined in this review only 35 meet minimal conditions of duration and sample size, i.e., ten experimental subjects over a period of at least a month. Sixteen of these suffer from serious design shortcomings, leaving only nineteen MALL studies that can reliably serve as a basis for determining the learning outcomes of mobile-based language applications. Of these studies, fifteen can be considered to report unequivocal positive results, with those focusing on reading, listening and speaking without exception evidencing a MALL application advantage. Four studies, all focusing on vocabulary, reported no significant differences.","subject":"Educational Technology, Technology Uses in Education, Second Language Instruction, Second Language Learning, Research Methodology, Instructional Effectiveness, Meta Analysis, Telecommunications, Grammar, Vocabulary Development, Reading Skills, Listening Skills, Speech Skills","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048411","title":"Affect and Willingness to Communicate in Digital Game-Based Learning","author":"Reinders, Hayo, Wattana, Sorada","description":"The possible benefits of digital games for language learning and teaching have received increasing interest in recent years. Games are said, amongst others, to be motivating, to lower affective barriers in learning, and to encourage foreign or second language (L2) interaction. But how do learners actually experience the use of games? What impact does gameplay have on students' perceptions of themselves as learners, and how does this affect their learning practice? These questions are important as they are likely to influence the success of digital gamebased language learning, and as a result the way teachers might integrate games into the curriculum. In this study we investigated the experiences of five students who had participated in a fifteen-week game-based learning program at a university in Thailand. We conducted six interviews with each of them (for a total of 30 interviews) to identify what impact gameplay had in particular on their willingness to communicate in English (MacIntyre, Dörnyei, Clément &amp; Noels, 1998). The results showed that gameplay had a number of benefits for the participants in this study, in particular in terms of lowering their affective barriers to learning and increasing their willingness to communicate. We discuss the implications of these results in terms of further research and classroom practice.","subject":"Educational Games, Educational Technology, Teaching Methods, Student Attitudes, Interviews, College Students, English (Second Language), Barriers, Foreign Countries, Second Language Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Thailand"},{"id":"EJ1059680","title":"Research Trends in Mobile Assisted Language Learning from 2000 to 2012","author":"Duman, Guler, Orhon, Gunseli, Gedik, Nuray","description":"In order to trace how mobile assisted language learning (MALL) has evolved in recent years, we analysed studies published from 2000 to 2012 to examine their characteristics and research trends. These studies were published in international journals listed in the Social Sciences Citation Index (SSCI). Sixty-nine studies that fit the time frame and study parameters were examined using a classification form. The results indicate that research in the field increased at a fast pace from 2008 and reached a peak in 2012. Teaching vocabulary with the use of cell phones and PDAs has remained popular over this period. A significant number of studies did not base their research on any theoretical framework. Applied and design-based research dominated the field, and these studies generally adopted quantitative research methods. Reflecting on these results, we suggest directions for future research and practices in the field.","subject":"Educational Research, Trend Analysis, Statistical Analysis, Telecommunications, Vocabulary Development, Classification, Futures (of Society), Teaching Methods, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048372","title":"The Story in the Mind: The Effect of 3D Gameplay on the Structuring of Written L2 Narratives","author":"Neville, David O.","description":"The article reports on a mixed-methods study evaluating the use of a three-dimensional digital game-based language learning (3D-DGBLL) environment to teach German two-way prepositions and specialized vocabulary within a simulated real-world context of German recycling and waste management systems. The study assumed that goal-directed player activity in this environment would configure digital narratives, which in turn would help study participants in the experimental group to co-configure story maps for ordering and making sense of the problem spaces encountered in the environment. The study further assumed that these participants would subsequently rely on the story maps to help them structure written L2 narratives describing an imagined personal experience closely resembling the gameplay of the 3D-DGBLL environment. The study found that immersion in the 3D-DGBLL environment influenced the manner in which the second language was invoked in these written narratives: Participants in the experimental group produced narratives containing more textual indicators describing the activity associated with the recycling and waste management systems and the spaces in which these systems are located. Increased usage of these indicators suggest that participants in the experimental group did indeed rely on story maps generated during 3D gameplay to structure their narratives, although stylistic and grammatical features of the narratives suggest, however, that changes could be made to the curricular implementation of the 3D-DGBLL environment. The study also puts forward ideas for instructional best practices based on research findings and suggests future areas of development and investigation.","subject":"Mixed Methods Research, Educational Games, Video Games, Computer Games, German, Second Language Instruction, Grammar, Vocabulary, Simulation, Recycling, Sanitation, Experimental Groups, Maps, Teaching Methods, Educational Technology","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048374","title":"Learning Motivation and Adaptive Video Caption Filtering for EFL Learners Using Handheld Devices","author":"Hsu, Ching-Kun","description":"The aim of this study was to provide adaptive assistance to improve the listening comprehension of eleventh grade students. This study developed a video-based language learning system for handheld devices, using three levels of caption filtering adapted to student needs. Elementary level captioning excluded 220 English sight words (see Section 1 for definition), but provided captions and Chinese translations for the remaining words. Intermediate level excluded 1000 high frequency English words, but provided captions for the remaining words, and 2200 high frequency English words were excluded at the high intermediate caption filtering level. The result was that the viewers were provided with captions for words that were likely to be unfamiliar to them. Participants in the experimental group were assigned bilingual caption modes according to their pre-test results, while those in the control group were assigned standard caption modes. Our results indicate that students in the experimental group preferred adaptive captions, enjoyed the exercises more, and gained greater intrinsic motivation compared to those in the control group. The results confirm that different students require different quantities of information to balance listening comprehension and indicate that the proposed adaptive caption filtering approach may be an effective way to improve the skills required for listening proficiency.","subject":"Learning Motivation, English (Second Language), Second Language Learning, Second Language Instruction, Video Technology, Experimental Groups, Bilingualism, Control Groups, Pretests Posttests, Handheld Devices, Listening Comprehension, High School Students, Teaching Methods, Word Frequency, Chinese, Translation","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059679","title":"Website Analysis in an EFL Context: Content Comprehension, Perceptions on Web Usability and Awareness of Reading Strategies","author":"Roy, Debopriyo, Crabbe, Stephen","description":"Website analysis is an interdisciplinary field of inquiry that focuses on both digital literacy and language competence (Brugger, 2009). Website analysis in an EFL learning context has the potential to facilitate logical thinking and in the process develop functional language proficiency. This study reported on an English language website (http:\/\/www.travelbelize.org\/) analysis experiment carried out for three weeks as an in-class and homework activity in a third year (junior) level English as a Foreign Language (EFL) course at a Japanese technical university. The purpose was to explore EFL learners' ability to analyze an English language website and produce concrete design responses in English. During the first week of the analysis (involving sixteen students selected due to performing the best during earlier in-class website analysis activities on the course), participants produced their own responses to eight open-ended design questions about the website. The second week of the analysis (involving all 59 students on the course) tested the students' ability to search for information from the website, and recorded their impressions about the website design based on standard usability questionnaires (&quot;CSUQ,&quot; &quot;QUIS,&quot; and &quot;MPRC&quot;). The third week of the analysis had the 59 students self-report on their use of meta-cognitive reading strategies (&quot;MARSI 1.0 Questionnaire&quot;) during the website analysis. The results of the questionnaires showed that, overall, the EFL students had a basic understanding of major design questions related to information organization, screen interface design, audience, technology used, etc. However, there was statistically significant variability between responses in different groups (comprehensive evaluation, webpage design, terminology and website information and website capabilities) and the respondents were not unanimous in their impressions about the website. The result of the student self-reports on metacognitive reading strategies showed wide acceptability and use of problem-solving strategies.","subject":"Web Sites, Second Language Learning, English (Second Language), Reading Strategies, Logical Thinking, Language Proficiency, Student Attitudes, Questionnaires, Usability, Metacognition, Problem Solving, Technological Literacy, Audiences, Computer Assisted Instruction, Foreign Countries","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Japan"}]