[{"id":"EJ1143782","title":"Enhancing L2 Reading Comprehension with Hypermedia Texts: Student Perceptions","author":"Garrett-Rucks, Paula, Howles, Les, Lake, William M.","description":"This study extends current research about L2 hypermedia texts by investigating the combined use of audiovisual features including: (a) Contextualized images, (b) rollover translations, (c) cultural information, (d) audio explanations and (e) comprehension check exercises. Specifically, student perceptions of hypermedia readings compared to traditional print texts are investigated in this study to address theoretical concerns that the combined use of multiple audiovisual annotations might split learners' attention from their reading comprehension. Additionally, student perceptions of the usefulness of the annotation features afforded by the hypermedia texts were investigated. Data were collected from 70 French language learners across four intermediate and advanced French courses at a large Midwestern research university. Participants in each course were assigned hypermedia readings, each of which being paired with an analogous traditional print reading of the same genre, with a similar word count and reading difficulty level, followed by a format preference survey. Results from data analysis of the format preference surveys showed statistically significant differences for user preference of the hypermedia texts and a user belief that the hypermedia format facilitated reading comprehension with less effort than print readings. Research findings about the reported usefulness of the annotation features are situated within Mayer's (2005) cognitive theory of multimedia learning. Directions for future research into the optimal design of hypermedia texts are discussed.","subject":"Hypermedia, Second Language Learning, Educational Technology, Technology Uses in Education, Audiovisual Instruction, Cultural Influences, Conventional Instruction, Student Attitudes, Reading Comprehension, Documentation, French, College Students, Reading Assignments, Printed Materials, Electronic Publishing, Student Surveys, Computer Software, Questionnaires","source":"CALICO Journal","publicationdateyear":2015}]