[{"id":"EJ1063815","title":"Contextual EFL Learning in a 3D Virtual Environment","author":"Lan, Yu-Ju","description":"The purposes of the current study are to develop virtually immersive EFL learning contexts for EFL learners in Taiwan to pre- and review English materials beyond the regular English class schedule. A 2-iteration action research lasting for one semester was conducted to evaluate the effects of virtual contexts on learners' EFL learning. 132 elementary school students participated in this study. Both qualitative and quantitative data, including observation and English learning performances, were collected and analyzed. The positive results obtained from the study approved that the usage of virtual contexts in EFL learning could (1) provide students with learning opportunities without the time and space limits, (2) provide students with a game-liked scenario for English learning, and (3) enhance learners' EFL performances. The learning mode proposed and experiences gained in the current study not only serve as a practical reference to diverse foreign language educational occasions but also add to the knowledge pool of foreign language learning and teaching in virtual worlds.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Second Language Instruction, Computer Simulation, Computer Assisted Instruction, Action Research, Observation, Elementary School Students, Language Tests, Teaching Methods, Problem Solving","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1075808","title":"Commenting to Learn: Evidence of Language and Intercultural Learning in Comments on YouTube Videos","author":"Benson, Phil","description":"It is often observed that the globalization of social media has opened up new opportunities for informal intercultural communication and foreign language learning. This study aims to go beyond this general observation through a case study that explores how discourse analysis tools might be used to uncover evidence of language and intercultural learning in comments on YouTube videos involving Chinese-English translanguaging. Analysis of exchange structure--interactional acts involving information exchange and stance marking--suggests that translanguaging triggers interactionally-rich comments that are oriented towards information exchange and negotiation for meaning on topics of language and culture. It is argued that the methodologies used have good potential for use in studies that aim to investigate learning in online settings, both at the environmental level, in macroanalysis of large data sets, and at the individual\/situational level, in microanalysis of shorter interactional sequences.","subject":"Social Networks, Internet, Video Technology, Electronic Publishing, Web Sites, Intercultural Communication, Discourse Analysis, Second Language Learning, Chinese, English, Bilingualism, Code Switching (Language), Translation, Computer Mediated Communication, Language Usage, Interaction Process Analysis, Persuasive Discourse, Cognitive Processes","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1075815","title":"&quot;I Am What I Am&quot;: Multilingual Identity and Digital Translanguaging","author":"Schreiber, Brooke Ricker","description":"This paper presents a case study of the multilingual writing practices of a Serbian university student on Facebook, examining how he uses multiple varieties of English and Serbian images and video to shape his online identity and establish membership in local and global communities. Drawing on data from stimulated-recall interviews, online participant observation, and rhetorical analysis, this study shows how Aleksandar, a hip-hop artist, appropriates hip-hop codes and employs the &quot;gate-keeping&quot; function of posting links (Baek, Holton, Harp, &amp; Yaschur, 2011) by embedding links to music videos in his own highly personal code-mixed text in order to establish himself as a distinctly Serbian member of the global hip-hop community. The findings suggest that Aleksandar's language practices and attitudes might be better understood as translingual (Canagarajah, 2011), as the student integrates diverse linguistic and semiotic resources into a unified expression of identity, relying on the multimodal affordances of digital writing to accomplish his communicative goals. However, these sophisticated textual practices go undervalued in his EFL writing courses, where formal, monolingual, non-digital literacy remains primary (Saxena, 2011). These findings suggest a need to re-evaluate what it means to have a second language-mediated identity, and to expand the focus of EFL writing pedagogy.","subject":"Multilingualism, Code Switching (Language), Music, Language Usage, Language Attitudes, Video Technology, Case Studies, Participant Observation, Writing (Composition), Recall (Psychology), Semiotics, English (Second Language), Writing Instruction, Technological Literacy, Second Language Learning, Self Concept, Teaching Methods, Social Networks, Foreign Countries, Serbocroatian, College Students, Semi Structured Interviews, Qualitative Research","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Serbia"}]