[{"id":"EJ1074890","title":"Computer-Mediated Communication (CMC) in L2 Oral Proficiency Development: A Meta-Analysis","author":"Lin, Huifen","description":"The ever growing interest in the development of foreign or second (L2) oral proficiency in a computer-mediated communication (CMC) classroom has resulted in a large body of studies looking at both the direct and indirect effects of CMC interventions on the acquisition of oral competences. The present study employed a quantitative meta-analytic approach to investigate such effects by synthesizing (quasi)experimental studies that provide empirical quantitative data for effect size calculation. A literature search located 25 relevant studies for the final analysis. Each study was independently coded for learner, design and publication characteristics. The averaged effect size was estimated from the included studies. The results of the meta-analysis reveal that communication mediated by computer\/technologies produced a moderate positive effect on L2 learners' oral proficiency compared to face-to-face (F2F) communication or no interaction. Furthermore, CMC has roughly similar effect on pronunciation, lexical and syntactic level of oral production; however, it might have a negative impact on fluency and accuracy. This meta-analysis also found that the effect of CMC on oral proficiency depends on several methodological factors such as task type, outcome measurement, treatment length, and assessment task. Major findings of the current meta-analysis include: (1) studies relying on elicited data are superior to those utilizing naturalistic data; (2) reading aloud seems to be the task that could elicit the best oral performance from students; (3) surprisingly, CMC appeared to be harmful for accuracy and fluency; (4) studies that employed decision-making generated the largest effect size, followed by studies that used more than one task type; (5) among the four tasks, jigsaw actually generated a negative effect on oral performance; and (6) as the most popular task employed by primary researchers, opinion-exchange studies produced the smallest effect size. These findings need to be interpreted as exploratory rather than confirmatory since each of them became less trustworthy after taking into consideration numerous other factors such as CMC task and the particular CMC tool used, etc. Future research suggestions are provided and the limitations of this meta-analysis are addressed.","subject":"Computer Mediated Communication, Second Language Learning, Oral Language, Language Proficiency, Intervention, Meta Analysis, Quasiexperimental Design, Effect Size, Literature Reviews, Achievement Gains, Data, Reading Aloud to Others, Accuracy, Reading Fluency, Decision Making, Task Analysis, Competence, Statistical Analysis","source":"ReCALL","publicationdateyear":2015}]