[{"id":"EJ1143740","title":"A Taxonomy of Vocabulary Learning Strategies Used in Massively Multiplayer Online Role-Playing Games","author":"Bytheway, Julie","description":"Initiated in response to informal reports of vocabulary gains from gamers at universities in New Zealand and the Netherlands, this qualitative study explored how English language learners autonomously learn vocabulary while playing massively multiplayer online role-playing games (MMORPGs). Using research processes inherent in Grounded Theory, data was collected from a criterion sample of six experienced English-as-a-second-language players of World of Warcraft. Data included semi-structured interviews, observations, elicited email texts and extant texts. Data was transcribed, coded, and refined through a cyclic process of constant comparative analysis until patterns emerged. The results revealed 15 vocabulary learning strategies, including noticing frequency of words, recognizing knowledge gaps, selecting words for attention, equating images and actions to words, giving and receiving explanations and feedback, observing players, using words to learn words, reading in-game information, and using Google. This taxonomy of 15 vocabulary learning strategies provides a framework for further research into vocabulary learning strategy taxonomies and autonomous learning in informal digital contexts.","subject":"Teaching Methods, Vocabulary Development, English (Second Language), Second Language Learning, Computer Games, Computer Simulation, Educational Technology, Semi Structured Interviews, Observation, Coding, Comparative Analysis, Learning Strategies, College Students, Foreign Countries, Qualitative Research, Grounded Theory","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"New Zealand, Netherlands"},{"id":"EJ1143780","title":"Applying the Technology Acceptance Model (TAM) to Explore the Effects of a Course Management System (CMS)-Assisted EFL Writing Instruction","author":"Tsai, Yea-Ru","description":"This study illustrates a teaching model that utilizes a Blackboard (Bb) course management system (CMS) to support English writing instruction. It was implemented in a blended English research paper (RP) writing course, with specific learning resources and activities offered inside and outside the Bb CMS. A quasi-experimental study in which the results of two academic years were analysed is presented. The results showed that the experimental group significantly outperformed the control group in their final drafts. The research methodology included the Technology Acceptance Model (TAM) to evaluate the course. The results of the survey showed that most students displayed positive learning outcomes, indicating that the instruction model could contribute to the effectiveness of learning English writing. Major factors influencing the improvement of writing performance included technical support, perceived usefulness, perceived ease of use, and attitude; however, the influence of writing activities on the Bb was limited in comparison to the other variables.","subject":"Computer Assisted Instruction, Educational Technology, Writing Instruction, English (Second Language), Second Language Instruction, Integrated Learning Systems, Research Reports, Quasiexperimental Design, Technology Integration, Student Attitudes, Foreign Countries, Undergraduate Students, Experimental Groups, Control Groups, Comparative Analysis, Blended Learning, Questionnaires, Statistical Analysis","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1176699","title":"Input and Output Grammar Instruction in Tutorial CALL with a Complex Grammatical Structure","author":"Collentine, Joseph, Collentine, Karina","description":"Conceptual replication within a computer-assisted language learning (CALL) environment provides an understanding of the generalizability of second language acquisition (SLA) research (Porte, 2013; Smith &amp; Schulze, 2013). The present study replicates Collentine (1998a), a classroom-based experiment framed within a larger discussion on the relative benefits of input- and output-based instruction. Collentine (1998a) compared the benefits of Processing Instruction (VanPatten, 2004) and output-based instruction, both of which elevated the Spanish subjunctive's communicative value. The results showed that input- or output-oriented instruction informed by how learners process grammatical information can affect the acquisition of complex grammatical phenomena. This conceptual replication not only seeks to corroborate the original study's findings in a new learning context. It also tests the finding's generalizability to a tutorial CALL environment built on 3D simulations and emerging web-app technologies. The participants were foreign-language learners of Spanish in a classroom-based curriculum (N = 50). The results indicate that, in the classroom and in a CALL environment, both input- and output-oriented approaches can promote the acquisition of a complex grammatical structure if practice is meaningful (informed by psycholinguistic processing principles) and deliberate, and if feedback is provided.","subject":"Computer Assisted Instruction, Educational Technology, Grammar, Teaching Methods, Program Effectiveness, Spanish, Second Language Instruction, Computer Simulation, Feedback (Response), Statistical Analysis, Morphology (Languages), Language Proficiency, Cultural Awareness, Interdisciplinary Approach, Sentences, Verbs, Syntax, Regression (Statistics), Pretests Posttests","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143615","title":"Eye Movements of Online Chinese Learners","author":"Stickler, Ursula, Shi, Lijing","description":"Although online tutorials are becoming commonplace for language teaching, very few studies to date have provided insights into learners' behaviours in synchronous online interactions from their own perspective. This study employs eyetracking technology to investigate ten learners' attention during synchronous online language learning in a multimodal environment. The participants were learners of Chinese as a Foreign Language at beginner's or lower-intermediate level. While learners took part in two different online activities, one focusing on reading, the other on interaction with others, their gaze focus was tracked, and in subsequent stimulated recall interviews the learners reflected on their engagement with the screen and their intentions while reading or speaking online. Our findings show that during reading tasks, when Pinyin transcriptions as well as Chinese characters were presented, all beginner and lower intermediate participants focused to some degree on the Pinyin. In the interactive task learners' gaze was drawn to elements of the screen that were not immediately necessary for technical or linguistic reasons but that could be interpreted as containing social presence information, e.g. names listed and emoticons employed by other users.","subject":"Eye Movements, Attention, Online Courses, Educational Technology, Technology Uses in Education, Interaction, Learning Activities, Interviews, Recall (Psychology), Learner Engagement, Intention, Reading, Chinese, Second Language Learning, Computer Mediated Communication, Synchronous Communication, Adult Learning, Teleconferencing, Questionnaires, Measurement Equipment, Foreign Countries","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"United Kingdom"},{"id":"EJ1176698","title":"Engaging in Mobile Phone-Based Activities for Learning Vocabulary: An Investigation in Japan and Taiwan","author":"Stockwell, Glenn, Liu, Yi Chun","description":"Studies investigating the use of mobile technologies when other options are available are still relatively rare in the literature, with the majority of studies requiring that learners use a particular technology, either using their own devices or devices provided by the institution. One exception to this was a study by Stockwell (2010) that examined how learners in Japan perceived the use of mobile phones for language learning and how willing they were to engage in the activities. This study, however, was conducted prior to the spread of smart phones and it focused exclusively on learners in Japan. Thus, the purpose of the current study was to replicate this study, but differed in two ways. First, although it was run in essentially the same environment as the original study, in the current study the majority of learners owned smart phones. Second, the same system was used not only in Japan but also with learners studying at a university in Taiwan. Data were collected through server logs, post-treatment surveys and semi-structured interviews. The results are discussed in terms of the ways in which learners engaged in the activities on their mobile phones, and the effect of the mobile platform on the time taken to complete the activities over the course of the semester. These results were correlated with those from the original 2010 study to identify the potential effect of the smart phone.","subject":"Foreign Countries, Telecommunications, Handheld Devices, Educational Technology, Technology Uses in Education, Surveys, Semi Structured Interviews, Second Language Instruction, English (Second Language), Cross Cultural Studies, College Students, Vocabulary Development, Scores, Learning Activities","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Taiwan, Japan"},{"id":"EJ1143739","title":"Sustaining Multimodal Language Learner Interactions Online","author":"Satar, H. Müge","description":"Social presence is considered an important quality in computer-mediated communication as it promotes willingness in learners to take risks through participation in interpersonal exchanges (Kehrwald, 2008) and makes communication more natural (Lowenthal, 2010). While social presence has mostly been investigated through questionnaire data and quantitative content analysis of online interactions based on a set of predefined indicators, in a smaller number of studies the concept has also been investigated through qualitative analysis of interviews (Kehrwald, 2008, 2010). Yet studies that bring together multiple sources of data collection and examine multimodal language learning contexts are almost non-existent. In this paper, the theory of social presence is employed to explicate language learners' online multimodal communication using a case study approach. Multiple sources of data were collected, including interviews, open-ended and closed post-task questionnaires, stimulated reflection and recordings of video interactions. The main findings of the study included an innovative social presence framework developed for the analysis of online multimodal language learner interactions (Satar, 2010), which can be used in further qualitative and exploratory research. It also has potential applicability for educators to develop strategies for language learners to guide them in creating and transmitting their social presence. The focus of this article is a cross-case analysis for one of the components of social presence, sustaining interaction, bringing together social presence theory, interactional sociolinguistics and multimodal interaction analysis. Finally, strategies are proposed for language learners on how to sustain their online multimodal interactions.","subject":"Learning Modalities, Online Courses, Computer Mediated Communication, Computer Assisted Instruction, Educational Technology, Interpersonal Communication, Interviews, Questionnaires, Reflection, Video Technology, Videoconferencing, Interaction, English (Second Language), Second Language Learning, Late Adolescents, Young Adults, Preservice Teachers, Foreign Countries, Case Studies, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1143738","title":"Reflexive Photography, Attitudes, Behavior, and CALL: ITAs Improving Spoken English Intelligibility","author":"Wallace, Lara","description":"Research in the field of Computer-Assisted Language Learning (CALL) has frequently taken a top-down approach when investigating learners' attitudes and behavior, both in the course as well as for their personal use. Suggestions are given for use of technology, and future research (Beatty, 2010; Levy &amp; Stockwell, 2006). One perspective that has not been examined in CALL is Reflexive Photography, a method that lends itself to rigorous and focused analysis and can illuminate the participants' experiences and perceptions in a way that the above methods cannot. In reflexive photography, participants are asked to photograph their experience of the phenomenon in question. These photographs serve as the basis for the discussion with the researcher that follows, and help to define the scope of the particular phenomenon. Together, the participants and the researcher co-produce the information regarding the phenomenon (Jenkings, Woodward &amp; Winter, 2008). Reflexive photography has been used to explore issues of identity and experience in other fields, although in CALL, it has been underutilized. The present study identified current uses of technology among International Teaching Assistants (ITAs) taking a course to improve their spoken English intelligibility. Midway through the term, learners photographed what they deemed to be helpful and what they felt obstructed the improvement of their oral English production. They then shared seven to ten photographs in a focus group of peers. At the end of the term, the researcher interviewed the learners regarding these experiences. The photos and the interviews were coded and the researcher examined the emergent findings, using observations and electronic communication from throughout the term to triangulate and support the data. The findings revealed valuable insights through the eyes of the learners regarding what technology the learners found to be helpful and\/or obstructive, both in the course as well as for their personal use, and suggestions for improvements in use of technology are given. Finally, future research directions in CALL using reflexive photography are discussed.","subject":"Computer Assisted Instruction, English (Second Language), Second Language Instruction, Educational Technology, Photography, Reflection, Teaching Assistants, Foreign Students, Graduate Students, Phenomenology, Student Attitudes, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143742","title":"The Role of Qualitative Approaches to Research in CALL Contexts: Closing in on the Learner&apos;s Experience","author":"Levy, Mike","description":"The article considers the role of qualitative research methods in CALL through describing a series of examples. These examples are used to highlight the importance and value of qualitative data in relation to a specific research objective in CALL. The use of qualitative methods in conjunction with other approaches as in mixed method research designs are a particular focus. It is argued that qualitative methods are especially effective when used in this way. The discussion also aims to elaborate upon the role of qualitative approaches within CALL specifically, as a domain for research study with particular attributes that require a qualitative orientation. Here the use of electronic dictionaries is considered. Dictionary use is suited to such a discussion because it occurs frequently in everyday life, suggesting a qualitative approach, as well as in research studies that are strictly controlled, as in a quantitative approach. The contrast is instructive and helps demonstrate the respective strengths and limitations of each method. Also central to the discussion is the language learner. A number of the studies described emphasize the importance of listening to the students' voice in the qualitative component (e.g., Conole, 2008; Jones, 2003). It is in the unpacking of what students actually do moment-by-moment in CALL tasks and activities that best illustrate the strengths of qualitative methods in enhancing our understanding of mediated learning and thereby driving productive research agendas.","subject":"Computer Assisted Instruction, Second Language Learning, Educational Technology, Mixed Methods Research, Research Methodology, Educational Research, Dictionaries, Electronic Publishing, Foreign Countries, Student Surveys, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1143784","title":"Learning L2 Pronunciation with a Mobile Speech Recognizer: French \/y\/","author":"Liakin, Denis, Cardoso, Walcir, Liakina, Natallia","description":"This study investigates the acquisition of the L2 French vowel \/y\/ in a mobile-assisted learning environment, via the use of automatic speech recognition (ASR). Particularly, it addresses the question of whether ASR-based pronunciation instruction using a mobile device can improve the production and perception of French \/y\/. Forty-two elementary French students participated in an experimental study in which they were assigned to one of three groups: (1) the ASR Group, which used an ASR application on their mobile devices to complete weekly pronunciation activities, with immediate written visual (textual) feedback provided by the software and no human interaction; (2) the Non-ASR Group, which completed the same weekly pronunciation activities in individual weekly sessions but with a teacher who provided immediate oral feedback using recasts and repetitions; and finally, (3) the Control Group, which participated in weekly individual meetings 'to practice their conversation skills' with a teacher who provided no pronunciation feedback. The study followed a pretest\/posttest design. According to the results of the dependent samples t-tests, only the ASR group improved significantly from pretest to posttest (p &lt; 0.001), and none of the groups improved in perception. The overall success of the ASR group on the production measures suggests that this type of learning environment is propitious for the development of segmental features such as \/y\/ in L2 French.","subject":"French, Second Language Learning, Pronunciation, Telecommunications, Handheld Devices, Automation, Teaching Methods, Elementary School Students, Comparative Analysis, Feedback (Response), Computer Software, Educational Technology, Technology Uses in Education, Randomized Controlled Trials, Mixed Methods Research, Pretests Posttests, Surveys, Interviews, Foreign Countries","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Canada (Montreal)"}]