[{"id":"EJ1143740","title":"A Taxonomy of Vocabulary Learning Strategies Used in Massively Multiplayer Online Role-Playing Games","author":"Bytheway, Julie","description":"Initiated in response to informal reports of vocabulary gains from gamers at universities in New Zealand and the Netherlands, this qualitative study explored how English language learners autonomously learn vocabulary while playing massively multiplayer online role-playing games (MMORPGs). Using research processes inherent in Grounded Theory, data was collected from a criterion sample of six experienced English-as-a-second-language players of World of Warcraft. Data included semi-structured interviews, observations, elicited email texts and extant texts. Data was transcribed, coded, and refined through a cyclic process of constant comparative analysis until patterns emerged. The results revealed 15 vocabulary learning strategies, including noticing frequency of words, recognizing knowledge gaps, selecting words for attention, equating images and actions to words, giving and receiving explanations and feedback, observing players, using words to learn words, reading in-game information, and using Google. This taxonomy of 15 vocabulary learning strategies provides a framework for further research into vocabulary learning strategy taxonomies and autonomous learning in informal digital contexts.","subject":"Teaching Methods, Vocabulary Development, English (Second Language), Second Language Learning, Computer Games, Computer Simulation, Educational Technology, Semi Structured Interviews, Observation, Coding, Comparative Analysis, Learning Strategies, College Students, Foreign Countries, Qualitative Research, Grounded Theory","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"New Zealand, Netherlands"},{"id":"EJ1176699","title":"Input and Output Grammar Instruction in Tutorial CALL with a Complex Grammatical Structure","author":"Collentine, Joseph, Collentine, Karina","description":"Conceptual replication within a computer-assisted language learning (CALL) environment provides an understanding of the generalizability of second language acquisition (SLA) research (Porte, 2013; Smith &amp; Schulze, 2013). The present study replicates Collentine (1998a), a classroom-based experiment framed within a larger discussion on the relative benefits of input- and output-based instruction. Collentine (1998a) compared the benefits of Processing Instruction (VanPatten, 2004) and output-based instruction, both of which elevated the Spanish subjunctive's communicative value. The results showed that input- or output-oriented instruction informed by how learners process grammatical information can affect the acquisition of complex grammatical phenomena. This conceptual replication not only seeks to corroborate the original study's findings in a new learning context. It also tests the finding's generalizability to a tutorial CALL environment built on 3D simulations and emerging web-app technologies. The participants were foreign-language learners of Spanish in a classroom-based curriculum (N = 50). The results indicate that, in the classroom and in a CALL environment, both input- and output-oriented approaches can promote the acquisition of a complex grammatical structure if practice is meaningful (informed by psycholinguistic processing principles) and deliberate, and if feedback is provided.","subject":"Computer Assisted Instruction, Educational Technology, Grammar, Teaching Methods, Program Effectiveness, Spanish, Second Language Instruction, Computer Simulation, Feedback (Response), Statistical Analysis, Morphology (Languages), Language Proficiency, Cultural Awareness, Interdisciplinary Approach, Sentences, Verbs, Syntax, Regression (Statistics), Pretests Posttests","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null}]