[{"id":"EJ1120967","title":"Do Young Learners Exploit the Same Learning Strategies as Adults?","author":"Hrozková, Ivana","description":"Learning strategies are considered to be one of the key factors affecting the learning process, its effectiveness and study results. They are important for lifelong learning of foreign languages and as a learning skill they represent a priority in the process of European globalization and integration. Moreover, learning strategies as a foreign language didactical concept constitute the core of the competence to learn and thus creating enough opportunities for primary pupils to acquire learning strategies is crucial as they acquire steps towards an effective process of learning through planning their work and self-evaluation.","subject":"Learning Strategies, Learning Processes, Second Language Learning, Primary Education, Self Evaluation (Individuals), Foreign Countries, English (Second Language), Qualitative Research, Semi Structured Interviews, Cognitive Development, Emotional Development","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1077603","title":"Interactive Whiteboards and Digital Teaching Book to Secondary School Teachers and Contextual Affordances: Hybrid or Substitute?","author":"Pacurar, Ecaterina, Clad, Nicolas","description":"The objective of our study is to analyze the utility and the integration of the interactive whiteboard (IWB) and interactive textbook into the teaching skills. This project concerns middle and high school teachers with professional career guidance in France. The research had as objectives the appropriation in the use of IWB features and the analysis of potential affordances and used by teachers in teaching-learning situations. The five hypotheses were tested from the research design type mixed-method. The results related to our initial hypotheses show that the use of functionalities of an IWB and a digital teaching book depend on teaching disciplines. Thus, history-geography teachers and those in languages frequently use simple features of an IWB. Teachers in science and mathematics perceive and use the affordances in a more complex level of an IWB, which means they add items to the device to enrich the list of functions.","subject":"Electronic Publishing, Textbooks, Middle School Teachers, High Schools, Secondary School Teachers, Teaching Skills, Educational Technology, Technology Uses in Education, Hypothesis Testing, Mixed Methods Research, Foreign Countries, Intellectual Disciplines, Structural Equation Models, Visual Aids, Interactive Video, Technology Integration, Teacher Attitudes, Regression (Statistics), Interviews","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1137144","title":"First Database Course--Keeping It All Organized","author":"Baugh, Jeanne M.","description":"All Computer Information Systems programs require a database course for their majors. This paper describes an approach to such a course in which real world examples, both design projects and actual database application projects are incorporated throughout the semester. Students are expected to apply the traditional database concepts to actual database storage problems. The design of the database is emphasized and students evaluate each other's design as well as their final database project. The details of a database written by the Author to organize all information surrounding the student's project are also presented. In this database course, the students are able to follow the progress of their fellow students during the course. Student's evaluations of each other's work during the semester is shown to be beneficial in the learning process.","subject":"Undergraduate Students, Computer Science Education, Information Systems, Databases, Introductory Courses, Required Courses, Majors (Students), Information Storage, Database Design, Student Projects, Peer Evaluation, Outcomes of Education, Programming Languages, Programming, Student Attitudes, Student Surveys, Rating Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137093","title":"A Design Quality Learning Unit in OO Modeling Bridging the Engineer and the Artist","author":"Waguespack, Leslie J.","description":"Recent IS curriculum guidelines compress software development pedagogy into smaller and smaller pockets of course syllabi. Where undergraduate IS students once may have practiced modeling in analysis, design, and implementation across six or more courses in a curriculum using a variety of languages and tools they commonly now experience modeling in four or fewer courses in at most a couple of paradigms. And in most of these courses their modeling decisions focus on acceptable syntax rather than principles representing and communicating concepts of quality in information systems. Where learning design quality may once have been an osmotic side effect of development practice it must now be a conscious goal in pedagogy if it is to be taught at all. This paper presents a learning unit that teaches design quality in object-oriented models. The focus on object-oriented models allows the learning to permeate analysis, design, and implementation enriching pedagogy across the systems development life cycle. The quality perspective presented is more expansive than that usually found in software engineering, the traditional &quot;objective&quot; notion of metrics, and integrates aspects of aesthetics, the more subjective phenomena of satisfaction. This learning unit is intended as an adaptable framework to be tailored to the coursework and the overall objectives of specific IS programs.","subject":"Units of Study, Design, Computer Software, Models, Systems Development, Satisfaction, Aesthetics, College Curriculum, Information Systems, Computer Science Education","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137149","title":"Including a Programming Course in General Education: Are We Doing Enough?","author":"Ferguson, Roger C., Leidig, Paul M., Reynolds, John H.","description":"General education is more than a list of required courses a student must take to complete their degree. For most universities, general education is the groundwork for the student's university experience. These courses span multiple disciplines and allow students to experience a wide range of topics on their path to graduation. Programming classes, e.g., Introduction to Programming, have not typically been an option as part of a general education course sequence at most universities. This study found that, only half of universities offer any kind of programming course in the General Education (GenEd) Program. The data also show that only two-thirds of institutions offer a computing class of any kind as a general education option. Institutions with ABET accredited Information Systems (IS) programs are significantly lower in both of these categories. This paper demonstrates the reasoning and process for including a programming class as an option in a GenEd Program, thereby showing how a programming class can be used to satisfy the requirements of a general education course. This results in two significant advantages to the computing department and university since the departments expand their reach to many more students, with a potential of increasing the number of majors or minors within the department; and non-computing majors have the opportunity to take courses that have not traditionally been offered in the GenEd Program. The latter results in students receiving a more comprehensive education and exposure to skills in high demand.","subject":"Programming, Programming Languages, General Education, Required Courses, College Students, Introductory Courses, Computer Science Education, Majors (Students), Nonmajors, Hypothesis Testing, Statistical Analysis","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1109645","title":"Teaching Tip: Active Learning via a Sample Database: The Case of Microsoft's Adventure Works","author":"Mitri, Michel","description":"This paper describes the use and benefits of Microsoft's Adventure Works (AW) database to teach advanced database skills in a hands-on, realistic environment. Database management and querying skills are a key element of a robust information systems curriculum, and active learning is an important way to develop these skills. To facilitate active learning and produce a compelling narrative, the data structure and content of a useful pedagogically-oriented database should be realistic and lifelike. It should contain data that accurately depicts the business processes, functions, and entities of a realistic organization, structured in a way that demonstrates best practices in database design. Most database textbooks include sample databases, but these are often small and sparse of data. By contrast, Microsoft's AW database presents a robust, realistic, and comprehensive framework for many important educational objectives in an IS curriculum. This paper introduces the AW business case and database, and illustrates several pedagogical uses in an undergraduate CIS program.","subject":"Active Learning, Databases, Computer Software, Educational Benefits, Case Method (Teaching Technique), Case Studies, Skill Development, Information Systems, Curriculum Development, Educational Technology, Business Education, Best Practices, Database Design, Problem Based Learning, Problem Solving, Database Management Systems, Educational Objectives, Undergraduate Study, Computer Science Education, Programming Languages, Information Retrieval, Student Attitudes","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null}]