[{"id":"EJ1063813","title":"A Corpus Approach for Autonomous Teachers and Learners: Implementing an On-Line Concordancer on Teachers' Laptops","author":"Lee, Jang Ho, Lee, Hansol, Sert, Cetin","description":"The present article deals with the issue of how to create and operate a customizable on-line concordancer from viewpoints of language teachers and with their own laptops. It aims to introduce how to use and manage this application without relying on computer engineers for various pedagogical purposes, focusing on the four beneficial dimensions of its interface and technical features: accessibility, simplicity, functionality, and manageability. In addition, the carefully written directions illustrate how to implement this open-source application on laptops using pre-established or customized corpora. For those in the field of language teaching and learning, this application is designed to allow teachers to operate different types or levels of corpora in separate spaces on one server and to enable multiple simultaneous connections in classroom contexts. Ultimately, the authors believe that this application will not only allow students to actively experience data-driven learning anywhere and anytime, but also will help teachers manage their own version of this online concordancer by autonomously uploading any kinds of source texts for corpus analysis at their pedagogical discretion.","subject":"Indexes, Second Language Learning, Second Language Instruction, Computational Linguistics, Language Teachers, Internet, Teaching Methods, Laptop Computers, Vocabulary Development, Educational Benefits","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051678","title":"New Software to Help EFL Students Self-Correct Their Writing","author":"Lawley, Jim","description":"This paper describes the development of web-based software at a university in Spain to help students of EFL self-correct their free-form writing. The software makes use of an eighty-million-word corpus of English known to be correct as a normative corpus for error correction purposes. It was discovered that bigrams (two-word combinations of words) present in a student's writing but which are not found, or which are suspiciously rare, in the normative corpus are likely to contain errors. The program highlights such bigrams in compositions, and guidance is provided to help students decide if they have indeed made a mistake, and if so, how to correct it. A cohort of students who volunteered to trial the software for a month reported positively on their experience; it had helped them find mistakes in their own and their peers' writing and had greatly accelerated the self-correction process.","subject":"Computer Software, Second Language Learning, English (Second Language), Error Correction, Foreign Countries, College Students, Writing (Composition), Computational Linguistics, Student Attitudes, Action Research, Distance Education, Online Courses, Interviews, Grammar","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Spain"}]