[{"id":"EJ1176699","title":"Input and Output Grammar Instruction in Tutorial CALL with a Complex Grammatical Structure","author":"Collentine, Joseph, Collentine, Karina","description":"Conceptual replication within a computer-assisted language learning (CALL) environment provides an understanding of the generalizability of second language acquisition (SLA) research (Porte, 2013; Smith &amp; Schulze, 2013). The present study replicates Collentine (1998a), a classroom-based experiment framed within a larger discussion on the relative benefits of input- and output-based instruction. Collentine (1998a) compared the benefits of Processing Instruction (VanPatten, 2004) and output-based instruction, both of which elevated the Spanish subjunctive's communicative value. The results showed that input- or output-oriented instruction informed by how learners process grammatical information can affect the acquisition of complex grammatical phenomena. This conceptual replication not only seeks to corroborate the original study's findings in a new learning context. It also tests the finding's generalizability to a tutorial CALL environment built on 3D simulations and emerging web-app technologies. The participants were foreign-language learners of Spanish in a classroom-based curriculum (N = 50). The results indicate that, in the classroom and in a CALL environment, both input- and output-oriented approaches can promote the acquisition of a complex grammatical structure if practice is meaningful (informed by psycholinguistic processing principles) and deliberate, and if feedback is provided.","subject":"Computer Assisted Instruction, Educational Technology, Grammar, Teaching Methods, Program Effectiveness, Spanish, Second Language Instruction, Computer Simulation, Feedback (Response), Statistical Analysis, Morphology (Languages), Language Proficiency, Cultural Awareness, Interdisciplinary Approach, Sentences, Verbs, Syntax, Regression (Statistics), Pretests Posttests","source":"CALICO Journal","publicationdateyear":2015},{"id":"EJ1176700","title":"The More Things Change, the More They Stay the Same, or Do They? Revisiting Classroom Interaction Approaches and Their Effects on Quantity and Characteristics of Language Production","author":"Jones, Linda C., Murphy, Cheryl A., Holland, Amalie","description":"This study investigated the quantity and characteristics of student language production, discourse functions, and morphosyntactic features in three different discourse settings--face-to-face (F2F), lab-setting chatroom interactions (Lab), and any place\/any device chatroom interactions (APAD). Discourse was examined through the replication and extension of Richard Kern's (1995) study. Similarities in findings between the two studies included a continuation of incomplete, and short sentence lengths among F2F students, an absence of F2F greetings, and a higher rate of assertions, verb tenses, and simple sentences in the Lab setting. Differences included a higher rate of F2F turns in the current study, an absence of greetings in the lab setting, and a greater number of commands among F2F participants. Findings underscored what Kern previously asserted: that F2F and chatroom settings tend to encourage and support slightly different goals associated with language discourse. Kern stated that more sophisticated conversation occurred in the chatroom setting. Current findings concurred but furthered that more conversational interaction took place within the F2F discourse setting due to a greater number of commands, turns, and incomplete sentences. Similarly, F2F students experienced greater input due to the increase of words heard, questions asked, and commands made.","subject":"Interaction, Synchronous Communication, Statistical Analysis, Language Acquisition, Computer Mediated Communication, Comparative Analysis, Second Language Learning, Second Language Instruction, English (Second Language), Handheld Devices, French, Intervention, Student Surveys, College Students, Statistical Significance","source":"CALICO Journal","publicationdateyear":2015}]