[{"id":"EJ1084414","title":"Teaching Adult Learner Characteristics and Facilitation Strategies through Simulation-Based Practice","author":"Speed, Sally A., Bradley, Elizabeth, Garland, Krista Vince","description":"This article relates a project in which a curriculum module was developed to help graduate students more effectively manage behaviors of adults in facilitation sessions. The module was piloted in the project and later included in a graduate level course in the Creative Studies Department of SUNY Buffalo State. The curriculum identified characteristics of adult learners and behaviors that manifest from those characteristics and helped Creative Studies graduate students develop strategies to manage such behaviors in facilitation sessions. The module included practice sessions for facilitation using TeachLivE™, a mixed reality simulation that offers education students practice in classroom management with avatars to enhance their teaching skills. Results indicated that students felt they were more capable of managing adult learner behaviors and more confident and effective in facilitations as a result of the module and TeachLivE™ simulation.","subject":"Adult Learning, Graduate Students, Learning Modules, Computer Simulation, Classroom Techniques, Experiential Learning, Quasiexperimental Design, Pilot Projects, Curriculum Development, Student Educational Objectives, Feedback (Response), Longitudinal Studies, Pretests Posttests, Likert Scales, Student Surveys, Program Effectiveness, Data Analysis, Qualitative Research, Statistical Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1098514","title":"How Does ERPsim Influence Students' Perceived Learning Outcomes in an Information Systems Course? An Empirical Study","author":"Chen, Liqiang, Keys, Anthony, Gaber, Donald","description":"It is a challenge for business students or even employees to understand business processes and enterprise software usage without involvement in real-world practices. Many business schools are using ERP software in their curriculum, aiming to expose students to real-world business practices. ERPsim is an Enterprise Resource Planning (ERP) teaching-learning tool for business students to learn actual SAP and business processes. This study empirically examines how ERPsim enhances student learning outcomes in an IS course. The findings reveal the antecedent effects of two important IS constructs (enjoyment and cognitive appraisal) on learning behavior and learning outcomes during students' involvement with ERPsim. The study provides empirical evidence that some major IS constructs (i.e., enjoyment and cognitive appraisal of using information systems) play important roles in shaping the effectiveness of using simulation game software to learn business processes and ERP software.","subject":"Business Administration Education, Strategic Planning, Computer Software, Information Systems, Outcomes of Education, Learning Processes, Computer Simulation, Hypothesis Testing, College Students, Student Surveys, Introductory Courses, Educational Experiments, Statistical Analysis, Path Analysis, Measurement, Reliability, Validity, Program Effectiveness","source":"Journal of Information Systems Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084444","title":"Using Computer Simulations and Games to Prevent Student Plagiarism","author":"Bradley, Elizabeth G.","description":"In this increasingly digital age, student plagiarism is rampant. Roughly half of college students admit to plagiarizing using content found online, directly copying and pasting the work of others. Digital technology and social media have greatly changed the landscape of how knowledge is acquired and disseminated; thus, students must be explicitly taught digital literacy skills and how to correctly utilize information they find online. Computer simulations are an active, engaging, and efficient way of explicitly teaching students about plagiarism and how to avoid academic dishonesty. A number of colleges and universities provide free open source games and simulations, which can be utilized as course assignments or activities in order to explicitly teach students proper citation procedures. This article reviews 10 plagiarism prevention computer games and simulations, with details about each program, including access information.","subject":"Prevention, Plagiarism, Computer Simulation, Teaching Methods, Technological Literacy, College Students, Computer Games, Cheating, Open Source Technology, Assignments, Citations (References)","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137387","title":"Live, Model, Learn: Experiencing Information Systems Requirements through Simulation","author":"Hartzel, Kathleen S., Pike, Jacqueline C.","description":"Information system professionals strive to determine requirements by interviewing clients, observing activities at the client's site, and studying existing system documentation. Still this often leads to vague and inaccurate requirements documentation. When teaching the skills needed to determine requirements, it is important to recreate a realistic environment to develop analytical thinking skills. To address this, we developed a simulation for students to learn requirements gathering and analysis where they experience the requirements by operating a fictitious manufacturing firm. The students manage and operate the company, taking on a variety of employee roles from the physical &quot;manufacturing&quot; to the order-taking to the purchasing of component parts. With this pedagogical approach, students deal with the messiness of the problem by drawing on their own experience working in the manufacturing firm, making assumptions, and having the opportunity to verify their assumptions and analyses by working with their classmates. The simulation was implemented across two courses in an undergraduate information systems program.","subject":"Information Systems, Simulation, Teaching Methods, Employees, Role, Manufacturing Industry, Administration, Experiential Learning, Undergraduate Study, Active Learning, Inquiry, Systems Analysis, Design, Information Management, Student Attitudes, Student Surveys, Likert Scales","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":"Pennsylvania"},{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1084406","title":"Open Source Meets Virtual Reality--An Instructor's Journey Unearths New Opportunities for Learning, Community, and Academia","author":"O'Connor, Eileen A.","description":"Opening with the history, recent advances, and emerging ways to use avatar-based virtual reality, an instructor who has used virtual environments since 2007 shares how these environments bring more options to community building, teaching, and education. With the open-source movement, where the source code for virtual environments was made available to the public, greatly reduced prices and increased options are shifting dramatically the utility of virtual environments for developing student competencies as virtual creators; supporting faculty and organizational needs; enabling comprehensive curriculum, assessment, and design; and allowing for multipurpose virtual environments. Reporting changes to how she taught the development of virtual environments, the author explains the enhanced learning observed within a newly designed course and the improvements she will make in the future. Additional recommendations address how education, communication, and learning organizations can use improvements to implement multipurpose virtual environments and can support technology-facilitated design in general.","subject":"Electronic Learning, Virtual Classrooms, Simulated Environment, Open Source Technology, Teaching Methods, Educational Change, Computer Simulation, Internet, Educational Technology, Curriculum Design, Lifelong Learning, Communities of Practice, Scaffolding (Teaching Technique), Masters Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"}]