[{"id":"EJ1074878","title":"Using Key Part-of-Speech Analysis to Examine Spoken Discourse by Taiwanese EFL Learners","author":"Lin, Yen-Liang","description":"This study reports on a corpus analysis of samples of spoken discourse between a group of British and Taiwanese adolescents, with the aim of exploring the statistically significant differences in the use of grammatical categories between the two groups of participants. The key word method extended to a part-of-speech level using the web-based corpus analytical tool, &quot;Wmatrix,&quot; highlights those linguistic domains which deserve particular attention. Specifically, it reveals the lexical and grammatical categories that occur unusually frequently or unusually infrequently in the English learners' discourse when compared with the language used by the native speakers of English in the sample. The research findings delineate the pedagogical merit of key domain analysis and thus help to inform English as a foreign language teachers and materials developers in the design of courses emphasising spoken interaction.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Discourse Analysis, Computational Linguistics, Grammar, Second Language Instruction, Teaching Methods, Material Development, Language Teachers, English, Native Speakers, Cross Cultural Studies","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom"},{"id":"EJ1048413","title":"A Statistical Method of Evaluating the Pronunciation Proficiency\/Intelligibility of English Presentations by Japanese Speakers","author":"Kibishi, Hiroshi, Hirabayashi, Kuniaki, Nakagawa, Seiichi","description":"In this paper, we propose a statistical evaluation method of pronunciation proficiency and intelligibility for presentations made in English by native Japanese speakers. We statistically analyzed the actual utterances of speakers to find combinations of acoustic and linguistic features with high correlation between the scores estimated by the system and native English teachers. Our results showed that the best combination of acoustic features produced correlation coefficients of 0.929 and 0.753 for pronunciation and intelligibility scores, respectively, using open data for speakers at the 10-sentence level. In an offline test, we evaluated possibly-confusing pairs of phonemes that are often mispronounced by Japanese speakers of English. In addition, we developed an online real-time score estimation system for Japanese learners of English using offline techniques to evaluate the pronunciation and intelligibility scores in real-time with almost the same ability as English teachers. Finally, we show that both the objective and subjective evaluations improved after learning with our system.","subject":"Pronunciation, English (Second Language), Second Language Learning, Japanese, Native Speakers, Statistical Analysis, Scores, Language Teachers, Correlation, Phonemes, Acoustics","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048411","title":"Affect and Willingness to Communicate in Digital Game-Based Learning","author":"Reinders, Hayo, Wattana, Sorada","description":"The possible benefits of digital games for language learning and teaching have received increasing interest in recent years. Games are said, amongst others, to be motivating, to lower affective barriers in learning, and to encourage foreign or second language (L2) interaction. But how do learners actually experience the use of games? What impact does gameplay have on students' perceptions of themselves as learners, and how does this affect their learning practice? These questions are important as they are likely to influence the success of digital gamebased language learning, and as a result the way teachers might integrate games into the curriculum. In this study we investigated the experiences of five students who had participated in a fifteen-week game-based learning program at a university in Thailand. We conducted six interviews with each of them (for a total of 30 interviews) to identify what impact gameplay had in particular on their willingness to communicate in English (MacIntyre, Dörnyei, Clément &amp; Noels, 1998). The results showed that gameplay had a number of benefits for the participants in this study, in particular in terms of lowering their affective barriers to learning and increasing their willingness to communicate. We discuss the implications of these results in terms of further research and classroom practice.","subject":"Educational Games, Educational Technology, Teaching Methods, Student Attitudes, Interviews, College Students, English (Second Language), Barriers, Foreign Countries, Second Language Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Thailand"},{"id":"EJ1059672","title":"English Learning Websites and Digital Resources from the Perspective of Chinese University EFL Practitioners","author":"Shen, Huizhong, Yuan, Yifeng, Ewing, Robyn","description":"English language learning (ELL) websites and digital resources have been recognized as an important source of linguistic and cultural knowledge for English as a foreign language (EFL) learners to explore. The up-to-date information carried by authentic materials is invaluable for learners to develop an understanding of the target language\/culture. However, there appears to be a gap between what the designer intends and what the user wants. This paper investigates Chinese university EFL teachers' perceptions of online English language websites and resources. The study focuses on a number of components of major language areas and skills in ELL websites, website materials, language users' preferences, and website usability. A total of 1519 English academics from 139 universities across China completed the online survey, and 164 of them voluntarily participated in focus group interviews anonymously. The empirical evidence of this study has highlighted that a pedagogically-oriented ELL website, targeting audiences with a variety of language proficiencies, was much liked by the Chinese EFL teachers. A preference was observed to see more current authentic language, examination-oriented English learning materials and tasks, and Eastern\/non-Anglophone topics in the websites. In addition, it is found that website usability is another key factor that would impact ELL website popularity. A well-designed ELL website can effectively assist Chinese EFL learners to enhance their language competence and achieve optimal learning outcomes. This study provides a context-specific empirical base for innovative web-based EFL learning and teaching as well as website design and materials development in China. The proposed key features of a preferred ELL website may help better inform website designers, content writers and evaluators in their ELL website design\/evaluation.","subject":"Asians, Second Language Learning, English (Second Language), Web Sites, College Faculty, Teacher Attitudes, Usability, Online Surveys, Focus Groups, Interviews, Cultural Awareness, Educational Resources, Universities, Foreign Countries, Language Proficiency, Outcomes of Education, Second Language Instruction, Innovation, Material Development, Evaluators","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1074888","title":"Mobile Technology in Second Language Classrooms: Insights into Its Uses, Pedagogical Implications, and Teacher Beliefs","author":"Van Praag, Benjamin, Sanchez, Hugo Santiago","description":"Adopting a multiple-case, multiple-method design, this study investigates mobile technology use in the practices of three experienced second language teachers. The findings, based on an analysis of the teachers' rationales, stated beliefs and classroom actions, show that the teachers tend to prohibit or reluctantly tolerate mobile device usage, while they recognise some of its potential benefits to support their teaching and student learning. They also highlight the incentives and barriers which respectively facilitate and hinder the integration of mobile technology, including factors which are internal (e.g. beliefs) and external (e.g. contextual constraints) to the teachers. Implications for classroom practice and teacher education are drawn.","subject":"Teaching Methods, Educational Technology, Technology Uses in Education, Case Studies, Mixed Methods Research, Telecommunications, Handheld Devices, Teacher Attitudes, Barriers, Incentives, Technology Integration, Second Language Instruction","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059663","title":"The Impact of Mode of Instructional Delivery on Second Language Teacher Self-Efficacy","author":"Kissau, Scott, Algozzine, Bob","description":"Research has called into question the suitability of fully-online instruction for certain teacher preparation courses. Methodology coursework, in particular, has been singled out in research as ill-suited to online instruction. Recent research, for example, involving second language (L2) teacher candidates has demonstrated that aspiring teachers who completed online methodology instruction were less confident in their abilities to teach L2 learners than their counterparts who completed the same instruction in a face-to-face (F2F) setting. To address the limitations of online instruction, while still incorporating its associated strengths, the development and implementation of hybridized methodology coursework have been proposed. Following this recommendation, the researchers developed and implemented hybridized L2 methodology courses that mirrored their pre-existing online and F2F equivalents. Using a mixed methodology, the researchers then conducted a three-way comparison of instructional delivery modes (online, F2F, hybrid) to investigate their impact on L2 teacher candidate self-efficacy. Although the results demonstrated that all three modes of instruction can be equally effective at increasing candidate confidence, they also highlighted the potential of hybridized instruction to address the limitations of online and F2F instruction, while still including their strengths. The findings also emphasized that simply viewing or participating in live demonstrations of teaching strategies in post-secondary methodology courses is not sufficient. To feel confident in their teaching abilities, teacher candidates need opportunities in their coursework to apply what they have learned in K-12 classrooms. Offering numerous research-based suggestions to improve the design of hybridized methodology courses, the study also serves to inform the development of future hybridized methodology coursework.","subject":"Self Efficacy, Teacher Effectiveness, Online Courses, Teaching Methods, Second Language Learning, Second Language Instruction, Teacher Education Programs, Mixed Methods Research, Methods Courses, Comparative Analysis, Preservice Teachers, Instructional Design, Language Teachers, Student Attitudes, Intermode Differences","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"North Carolina"},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]