[{"id":"EJ1059672","title":"English Learning Websites and Digital Resources from the Perspective of Chinese University EFL Practitioners","author":"Shen, Huizhong, Yuan, Yifeng, Ewing, Robyn","description":"English language learning (ELL) websites and digital resources have been recognized as an important source of linguistic and cultural knowledge for English as a foreign language (EFL) learners to explore. The up-to-date information carried by authentic materials is invaluable for learners to develop an understanding of the target language\/culture. However, there appears to be a gap between what the designer intends and what the user wants. This paper investigates Chinese university EFL teachers' perceptions of online English language websites and resources. The study focuses on a number of components of major language areas and skills in ELL websites, website materials, language users' preferences, and website usability. A total of 1519 English academics from 139 universities across China completed the online survey, and 164 of them voluntarily participated in focus group interviews anonymously. The empirical evidence of this study has highlighted that a pedagogically-oriented ELL website, targeting audiences with a variety of language proficiencies, was much liked by the Chinese EFL teachers. A preference was observed to see more current authentic language, examination-oriented English learning materials and tasks, and Eastern\/non-Anglophone topics in the websites. In addition, it is found that website usability is another key factor that would impact ELL website popularity. A well-designed ELL website can effectively assist Chinese EFL learners to enhance their language competence and achieve optimal learning outcomes. This study provides a context-specific empirical base for innovative web-based EFL learning and teaching as well as website design and materials development in China. The proposed key features of a preferred ELL website may help better inform website designers, content writers and evaluators in their ELL website design\/evaluation.","subject":"Asians, Second Language Learning, English (Second Language), Web Sites, College Faculty, Teacher Attitudes, Usability, Online Surveys, Focus Groups, Interviews, Cultural Awareness, Educational Resources, Universities, Foreign Countries, Language Proficiency, Outcomes of Education, Second Language Instruction, Innovation, Material Development, Evaluators","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1059679","title":"Website Analysis in an EFL Context: Content Comprehension, Perceptions on Web Usability and Awareness of Reading Strategies","author":"Roy, Debopriyo, Crabbe, Stephen","description":"Website analysis is an interdisciplinary field of inquiry that focuses on both digital literacy and language competence (Brugger, 2009). Website analysis in an EFL learning context has the potential to facilitate logical thinking and in the process develop functional language proficiency. This study reported on an English language website (http:\/\/www.travelbelize.org\/) analysis experiment carried out for three weeks as an in-class and homework activity in a third year (junior) level English as a Foreign Language (EFL) course at a Japanese technical university. The purpose was to explore EFL learners' ability to analyze an English language website and produce concrete design responses in English. During the first week of the analysis (involving sixteen students selected due to performing the best during earlier in-class website analysis activities on the course), participants produced their own responses to eight open-ended design questions about the website. The second week of the analysis (involving all 59 students on the course) tested the students' ability to search for information from the website, and recorded their impressions about the website design based on standard usability questionnaires (&quot;CSUQ,&quot; &quot;QUIS,&quot; and &quot;MPRC&quot;). The third week of the analysis had the 59 students self-report on their use of meta-cognitive reading strategies (&quot;MARSI 1.0 Questionnaire&quot;) during the website analysis. The results of the questionnaires showed that, overall, the EFL students had a basic understanding of major design questions related to information organization, screen interface design, audience, technology used, etc. However, there was statistically significant variability between responses in different groups (comprehensive evaluation, webpage design, terminology and website information and website capabilities) and the respondents were not unanimous in their impressions about the website. The result of the student self-reports on metacognitive reading strategies showed wide acceptability and use of problem-solving strategies.","subject":"Web Sites, Second Language Learning, English (Second Language), Reading Strategies, Logical Thinking, Language Proficiency, Student Attitudes, Questionnaires, Usability, Metacognition, Problem Solving, Technological Literacy, Audiences, Computer Assisted Instruction, Foreign Countries","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Japan"},{"id":"EJ1074890","title":"Computer-Mediated Communication (CMC) in L2 Oral Proficiency Development: A Meta-Analysis","author":"Lin, Huifen","description":"The ever growing interest in the development of foreign or second (L2) oral proficiency in a computer-mediated communication (CMC) classroom has resulted in a large body of studies looking at both the direct and indirect effects of CMC interventions on the acquisition of oral competences. The present study employed a quantitative meta-analytic approach to investigate such effects by synthesizing (quasi)experimental studies that provide empirical quantitative data for effect size calculation. A literature search located 25 relevant studies for the final analysis. Each study was independently coded for learner, design and publication characteristics. The averaged effect size was estimated from the included studies. The results of the meta-analysis reveal that communication mediated by computer\/technologies produced a moderate positive effect on L2 learners' oral proficiency compared to face-to-face (F2F) communication or no interaction. Furthermore, CMC has roughly similar effect on pronunciation, lexical and syntactic level of oral production; however, it might have a negative impact on fluency and accuracy. This meta-analysis also found that the effect of CMC on oral proficiency depends on several methodological factors such as task type, outcome measurement, treatment length, and assessment task. Major findings of the current meta-analysis include: (1) studies relying on elicited data are superior to those utilizing naturalistic data; (2) reading aloud seems to be the task that could elicit the best oral performance from students; (3) surprisingly, CMC appeared to be harmful for accuracy and fluency; (4) studies that employed decision-making generated the largest effect size, followed by studies that used more than one task type; (5) among the four tasks, jigsaw actually generated a negative effect on oral performance; and (6) as the most popular task employed by primary researchers, opinion-exchange studies produced the smallest effect size. These findings need to be interpreted as exploratory rather than confirmatory since each of them became less trustworthy after taking into consideration numerous other factors such as CMC task and the particular CMC tool used, etc. Future research suggestions are provided and the limitations of this meta-analysis are addressed.","subject":"Computer Mediated Communication, Second Language Learning, Oral Language, Language Proficiency, Intervention, Meta Analysis, Quasiexperimental Design, Effect Size, Literature Reviews, Achievement Gains, Data, Reading Aloud to Others, Accuracy, Reading Fluency, Decision Making, Task Analysis, Competence, Statistical Analysis","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]