[{"id":"EJ1121026","title":"The Impact of Pedagogical Agent on Learners' Motivation and Academic Success","author":"Dincer, Serkan, Doganay, Ahmet","description":"Pedagogical agent is generally described as educational programs that guide, motivate learners while encouraging them during learning by providing feedback. The tasks (informative, guiding, or friend, etc.) and types (human-like, cartoon character, audio, text, etc.) of these modules can be classified based on various variables. Although computer-assisted instruction software is commonly used as a teaching material, research on modules integrated on such programs is scarce. Studies in the field have revealed that such computer-assisted instruction programs increase motivation of learners. In order to keep motivation levels high, these programs need to be adopted depending on the individual needs. Therefore, it can be beneficial to integrate software designed that can be personalized. In this respect, the present study was conducted with secondary school students to identify the impact of pedagogical agent on learners' academic success and motivation. For the purpose of the study, four groups were formed. The first group received education via fixed pedagogical agent, the second group had the option to choose among several pedagogical agents, the third group received the education without pedagogical agent and finally the last group received the same education through traditional (non-computer) way. This four-week program was introduced to students via MS Excel program and the data was gathered as pre- and post-test method. The findings have revealed that interfaces impacted motivation and accordingly academic success in a positive way. As a result of the study, it is suggested that learners should be provided programs that can be personalized depending on learners' needs and preferences.","subject":"Student Motivation, Academic Achievement, Computer Assisted Instruction, Pretests Posttests, Pilot Projects, Experimental Groups, Control Groups, Statistical Analysis, Secondary School Students, Grade 5, Grade 8","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137356","title":"Adding Value: Online Student Engagement","author":"Everett, Donna R.","description":"This paper seeks to add to the emerging literature related to online student engagement with additional suggestions for instructional strategies. Student engagement is one of the tenets of effective online instruction; as such, particular attention to how it adds value to student learning is crucial and worth the time and effort to enhance learning outcomes. What strategies and technology enhance student engagement and add value to student learning? Continuing research into online student engagement strategies is needed to add value to student learning.","subject":"Learner Engagement, Educational Strategies, Web Based Instruction, Online Courses, Electronic Learning, Value Added Models, Outcomes of Education, Educational Technology, Computer Mediated Communication, Synchronous Communication, Asynchronous Communication","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137398","title":"Course Redesign Based on the Quality Matters Program: Examples of Before and After","author":"Kreie, Jennifer, Bussmann, Susan","description":"Most universities continue to expand their online course offerings because there is strong demand for such educational opportunities. However, the quality of instruction for online courses continues to be a concern. The Quality Matters (QM) Program provides a set of research-based standards that can guide the redesign of a course and can be used as a rubric to evaluate a course. This paper shows the transition of one course as it was redesigned based on the QM standards. Specific examples of &quot;before&quot; and &quot;after&quot; content are shown along with discussion of the changes made and some design issues encountered. Feedback from students midway through the first semester using the redesigned course is presented.","subject":"Online Courses, Educational Quality, Curriculum Design, Standards, Course Content, Information Systems, Business Administration Education, Computer Science Education, College Curriculum, Behavioral Objectives, College Students, Feedback (Response), Student Surveys","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1137365","title":"A Project Management Approach to Applying Best Practices to Online CS\/MIS Experiential Learning Projects","author":"Schwieger, Dana, Surendran, Ken","description":"The value of experiential learning projects (which are usually major assessments in courses) in education has been touted since the early 1900s (Dewey, 1938). These projects have the potential to deepen students' understanding of course topics by allowing them to put concepts into practice and watch the results develop. However, experiential learning projects require significant guidance, communication between students and faculty, and direction. Coupled with the communication intricacies of an online learning environment, experiential learning projects become a little more difficult to manage. In this article, the authors examine some of the best practices for teaching online courses as they relate to experiential learning projects, the value of experiential learning projects and then apply a project management approach to addressing the challenges of assigning experiential learning projects in online courses looking at two courses taught at the authors' institution. The authors then describe some best practices that they have incorporated to better manage the application of experiential learning projects in their online classrooms.","subject":"Program Administration, Best Practices, Online Courses, Computer Science Education, Management Information Systems, Experiential Learning, Web Based Instruction, Educational Benefits, Graduate Study, Course Descriptions, Blended Learning, Student Projects, Cooperative Learning, Teaching Methods","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077597","title":"Pedagogical Applications of Social Media in Business Education: Student and Faculty Perspectives","author":"Piotrowski, Chris","description":"There has been wide academic and research interest in the application of social media modalities, as pedagogical tools, in higher education. Recent research indicates that business-related topics are a major focus of study on this emerging educational issue. Yet a systematic review of outcome studies regarding instructional Web 2.0 adaptations in business education has not appeared. To chart, the contemporary landscape of scholarly research in this area, the current study (a) identified, based on a keyword search in the &quot;ProQuest&quot; database, the key empirically based studies on the business education-social media nexus and (b) summarized the major findings of a subset of these studies (n?=?11) with a focus on views of business students and faculty. The main social media tools used in instruction were Facebook, blogs, Twitter, and YouTube. Although a majority of studies reported positive attitudes by students regarding academic applications of Web 2.0 technologies, faculty views were more tepid and reserved. Transgression of &quot;socializing&quot; during academic interactivity, privacy issues, and data overload were the major drawbacks noted by students. Faculty were most concerned about the vast breadth of social media modalities and the lack of training support in emerging interactive-mobile technology. Future research needs to address the views of business school administrators on educational adaptation of Web 2.0 tools.","subject":"Social Media, Business Administration Education, Student Attitudes, Teacher Attitudes, Higher Education, Web 2.0 Technologies, College Students, Online Searching, Computer Oriented Programs","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1084380","title":"The Writer's Individualized Transfer Tool: A Freeware Innovation for Fostering and Researching Transfer of Writing Skills and Knowledge","author":"Khost, Peter H.","description":"Most higher education institutions lack a program that promotes students' transfer--that is, reapplication or repurposing--of writing skills and knowledge across the curriculum, a phenomenon that research shows does not tend to happen without deliberate sustained support. This article introduces an online instrument, the Writer's Individualized Transfer Tool, which the author invented to intervene in this area as a supplemental or provisional effort, using freeware to foster and research students' writing transfer from first-year composition to other courses and potentially beyond. The article reviews relevant scholarship on transfer in writing, describes and illustrates Writer's Individualized Transfer Tool's design, provides instructions for the tool's implementation and usage, reviews some results from a pilot study of an application of the tool in an first-year composition curriculum, and discusses related issues requiring further consideration.","subject":"Freshman Composition, Writing Skills, Computer Software, Writing Across the Curriculum, Transfer of Training, Metacognition, Program Implementation, Pilot Projects, Outcomes of Education, Writing Instruction, Student Surveys","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1077665","title":"Berlin Kompass: Multimodal Gameful Empowerment for Foreign Language Learning","author":"Kallioniemi, Pekka, Posti, Laura-Pihkala, Hakulinen, Jaakko, Turunen, Markku, Keskinen, Tuuli, Raisamo, Roope","description":"This article presents an innovative, gameful, multimodal, and authentic learning environment for training of oral communication in a foreign language--a virtual adventure called Berlin Kompass. After a brief presentation of the pedagogical and technological backgrounds, the system is described. Central results of a series of pilots in autumn 2013 with around 100 upper secondary pupils are described and further steps are discussed. The results are highly promising, and the concept was highly appreciated by the pupils regardless of some technical problems that the prototype had during the pilots. The researcher observations and the questionnaire results show that the concept manages to create a new motivating collaborative learning context with clear added value compared with equal tasks realized in a typical classroom approach.","subject":"Second Language Learning, Questionnaires, Secondary School Students, Cooperative Learning, Teaching Methods, Oral Language, Second Language Instruction, Computer Simulation, Instructional Innovation, Educational Games, German, Foreign Countries, Feedback (Response), Multivariate Analysis, Observation","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Finland"},{"id":"EJ1084413","title":"Building Innovative Online Korean and Japanese Courses: A Pilot on Technology-Enhanced Curriculum Development","author":"Sato, Eriko, Sohn, Heejeong, Chen, Julian ChengChiang, Adebowale, Kayode C. V., Jourdain, Sarah","description":"Our pilot project created blended\/online courses to accommodate the growing needs of precollegiate and collegiate students interested in learning Korean and Japanese. In the initial phase, we conducted a survey of students' experiences with and perceptions about blended\/online Asian language learning. We found a general lack of familiarity with, and moderate resistance toward, online language learning modes. With learner attitudes in mind, we developed online modules for beginning Korean and Japanese courses. In this article, we report the survey results and the process of developing these innovative blended and online modalities of content delivery, focusing on the strengths of the modules and the unforeseen development challenges. The impacts that these technology-enhanced environments may have on student perceptions of transactional distance and tele-\/copresence are explored. We suggest that transforming conventional East Asian language courses into blended\/online modes is not only feasible but also beneficial for foreign language teaching and learning.","subject":"Online Courses, Second Language Learning, Second Language Instruction, Korean, Japanese, Blended Learning, Student Attitudes, Pilot Projects, Program Descriptions, Student Surveys, Teaching Methods, Instructional Innovation, Familiarity, Distance Education, Curriculum Design, Action Research, Comparative Analysis, Interactive Video, Educational Technology, Standards, Computer Mediated Communication, Cultural Awareness, Program Effectiveness, Factor Analysis","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"New York"},{"id":"EJ1137190","title":"IT0: Discrete Math and Programming Logic Topics as a Hybrid Alternative to CS0","author":"Martin, Nancy L.","description":"This paper describes the development of a hybrid introductory course for students in their first or second year of an information systems technologies degree program at a large Midwestern university. The course combines topics from discrete mathematics and programming logic and design, a unique twist on most introductory courses. The objective of the new course is to better prepare students for more advanced computing courses. Two primary drivers motivated development of the new course: 1) faculty evidence of deficient foundation skills in advanced level courses, and 2) consideration of program accreditation criteria.","subject":"Mathematics Instruction, Programming, Introductory Courses, Information Systems, Information Technology, College Students, Accreditation (Institutions), Mathematical Logic, Thinking Skills, Problem Solving, Universities","source":"Information Systems Education Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077607","title":"Regression from Game-Oriented to Traditional School","author":"Westin, Thomas, Wiklund, Mats, Mozelius, Peter, Norberg, Lena","description":"Pupils in Sweden are socialized in commercial off-the-shelf games, and, therefore, game-oriented formal education can constitute a foundation for further socialization of pupils excluded in school. However, digital illiteracy and traditional views among school staff forced a regression from the game-oriented formal trial education in this study back to the traditional education form. Research questions were as follows: How did the pupils act upon the consequences of the regression? How can these acts inform the design of education in digital culture? These questions were addressed using ethnography over 3 years. The pupils' acts differed depending on their socialization in school and in games. While the game-oriented formal education included all in the socialization process, the regression caused half of the pupils to drop out. The pupils' acts are discussed with a conceptual framework. Conclusions show the need for digital literacy and understanding pupils' perspectives on education among school staff.","subject":"Foreign Countries, Secondary School Students, Games, Conventional Instruction, Socialization, Educational Change, Ethnography, Dropouts, Longitudinal Studies","source":"Journal of Educational Technology Systems","publicationdateyear":2015,"identifiersgeo":"Sweden"},{"id":"EJ1120921","title":"Using Interactive Board and Communication in Teaching English at Lower-Secondary Stage of Elementary School","author":"Dobrovolná, Alena","description":"The contribution brings part of the research results on using interactive boards in teaching English at lower-secondary stage of elementary schools in the Czech Republic. The whole research focused on ways of using this modern device, on types of interaction and mainly tried to find out whether there is sufficient space for developing communicative competence through oral interaction. Here mainly the part about forms of interaction is described.","subject":"Foreign Countries, English (Second Language), Second Language Instruction, Second Language Learning, Elementary School Students, Interactive Video, Educational Technology, Interaction, Teacher Student Relationship, Interpersonal Communication, Classroom Communication, Observation","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":"Czech Republic"},{"id":"EJ1120920","title":"Analysing ESP Texts, but How?","author":"Borza, Natalia","description":"English as a second language (ESL) teachers instructing general English and English for specific purposes (ESP) in bilingual secondary schools face various challenges when it comes to choosing the main linguistic foci of language preparatory courses enabling non-native students to study academic subjects in English. ESL teachers intending to analyse English language subject textbooks written for secondary school students with the aim of gaining information about what bilingual secondary school students need to know in terms of language to process academic textbooks cannot avoiding deal with a dilemma. It needs to be decided which way it is most appropriate to analyse the texts in question. Handbooks of English applied linguistics are not immensely helpful with regard to this problem as they tend not to give recommendation as to which major text analytical approaches are advisable to follow in a pre-college setting. The present theoretical research aims to address this lacuna. Respectively, the purpose of this pedagogically motivated theoretical paper is to investigate two major approaches of ESP text analysis, the register and the genre analysis, in order to find the more suitable one for exploring the language use of secondary school subject texts from the point of view of an English as a second language teacher. Comparing and contrasting the merits and limitations of the two contrastive approaches allows for a better understanding of the nature of the two different perspectives of text analysis. The study examines the goals, the scope of analysis, and the achievements of the register perspective and those of the genre approach alike. The paper also investigates and reviews in detail the starkly different methods of ESP text analysis applied by the two perspectives. Discovering text analysis from a theoretical and methodological angle supports a practical aspect of English teaching, namely making an informed choice when setting out to analyse texts in English. It can be concluded from the literature that the register perspective yields more readily applicable data of text analysis for ESL teachers instructing in a pre-college environment. Besides teachers working in bilingual secondary school, the pedagogical conclusions of the study are also useful for teachers instructing in international secondary schools where the language of education is English and the alumni comprise non-native students.","subject":"English for Special Purposes, Content Analysis, Textbook Evaluation, Textbook Content, Language Usage, Secondary Education, Second Language Instruction, English (Second Language), Language of Instruction, Discourse Analysis, Literary Genres","source":"Practice and Theory in Systems of Education","publicationdateyear":2015,"identifiersgeo":null}]