[{"id":"EJ1077835","title":"Technology Use and Self-Perceptions of English Language Skills among Urban Adolescents","author":"Li, Jia, Snow, Catherine, Jiang, Jingjing, Edwards, Nicholas","description":"Technology including social media and other technology applications enabled by different technology devices offer many possibilities for second language learners to improve their learning, if they are interested in doing so. We investigated purposes for using technology among urban adolescents, including both English language learners (ELLs) and native English speakers (NESs). Data were collected through a survey of 531 students in an urban public middle school in the USA. The results showed that students used technology for diverse purposes regardless of their first language background. Although overall technology students' access was comparable to national averages, the use of technology for many specific purposes was markedly lower, lending support to the notion of a new digital divide between students from high- and low-income families based on technology knowledge and meaningful application of such knowledge rather than mere access. Student reports of their own English skills were related to various specific uses of technology, e.g., blogging and email. These relationships were stronger for ELLs, particularly those in grade 6, than for NESs. The results suggest that younger ELL adolescents may be more aware of their language constraints and prone to use technology in certain ways than their NES peers. These findings provide some preliminary insights into the complex relationships between language skills and student preferences for technology use and can ultimately provide guidance for the integration of technology into language and literacy instruction for linguistically diverse urban adolescents.","subject":"Self Concept, English (Second Language), Second Language Learning, Low Income, Social Differences, Urban Areas, Adolescents, Technological Literacy, English Language Learners, Surveys, Middle School Students, Correlation, Literacy Education, Language Skills, Student Attitudes, Social Networks, Socioeconomic Status, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Massachusetts"},{"id":"EJ1080885","title":"Spoken Grammar Practice and Feedback in an ASR-Based CALL System","author":"de Vries, Bart Penning, Cucchiarini, Catia, Bodnar, Stephen, Strik, Helmer, van Hout, Roeland","description":"Speaking practice is important for learners of a second language. Computer assisted language learning (CALL) systems can provide attractive opportunities for speaking practice when combined with automatic speech recognition (ASR) technology. In this paper, we present a CALL system that offers spoken practice of word order, an important aspect of Dutch grammar. The system uses ASR technology to process the learner's responses and to detect errors so that immediate corrective feedback (CF) can be provided on learner errors. We evaluate the system as a learning environment by analyzing proficiency gains in pre- and post-tests, the logs of the practice sessions, and the learners' appreciation of the system. In this paper, we present two learning conditions: (1) the learners received oral practice and immediate CF on spoken performance and (2) learners received oral practice and NO CF on spoken performance. We found that our system was successful in providing L2 speaking practice. Results show that both groups improve their proficiency on the target feature as a result of treatment. Between the groups there is no significant difference in learning, but the groups proceeded differently through the sessions, and the learners in the group that received automatic CF evaluated the system more positively than the NO CF group. We discuss the performance of the system as an environment for language learning and the obtained proficiency test results, and relate them to current views on second language acquisition.","subject":"Grammar, Computer Assisted Instruction, Feedback (Response), Error Correction, Language Proficiency, Pretests Posttests, Oral Language, Second Language Learning, Indo European Languages, Second Language Instruction, Language Tests, Task Analysis, Adult Students, Video Technology, Foreign Countries, Likert Scales, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1051421","title":"Implementing Courseware as the Primary Mode of Task-Based ESP Instruction: A Case Study of EFL Students","author":"Tsai, Shu-Chiao","description":"The study reports on implementing self-developed English for specific purposes (ESP) courseware for technology industries in an elective course, &quot;English reading for technology,&quot; offered to junior students of English as a foreign language in a technical university in southern Taiwan. Courseware implementation was combined with a sustained-content language teaching (SCLT) approach and a task-based learning (TBL) approach was adopted. The course mainly focused on vocabulary, listening, and reading comprehension. Evaluation of implementing these information and communication technologies (ICTs) in ESP instruction was based upon data from a variety of pre-tests and post-tests including cloze, dictation, essay writing, and Q&amp;A tests. The courseware not only provided learning materials for the target ESP, but also offered content-based and linguistic learning activities with corresponding instant self-evaluation. These features offered by the courseware both corresponded to the duel focus of the SCLT approach, and provided a model for developing an ESP courseware. Also, a teacher-centered instruction of the same subject matter was conducted with a control group. Students self-studying with the ESP courseware made as much progress as those that elected teacher-centered instruction. Most students were satisfied with the courseware-implemented ESP instruction combined with the SCLT and TBL approaches.","subject":"Courseware, English for Special Purposes, Second Language Learning, Second Language Instruction, Task Analysis, Teaching Methods, Models, Computer Assisted Instruction, Elective Courses, Reading Comprehension, Pretests Posttests, Cloze Procedure, Course Descriptions, Foreign Countries, Technical Education, Universities, Essays, Self Evaluation (Individuals), Student Attitudes, Undergraduate Students, Questionnaires, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051461","title":"Developing a Multimedia Instrument for Technical Vocabulary Learning: A Case of EFL Undergraduate Physics Education","author":"Rusanganwa, Joseph Appolinary","description":"The aim of the present study is to investigate the process of constructing a Multimedia Assisted Vocabulary Learning (MAVL) instrument at a university in Rwanda in 2009. The instrument is used in a one-computer classroom where students were taught in a foreign language and had little access to books. It consists of video clips featuring images, sound and text intended to facilitate learning and retention of technical vocabulary in a first-year electricity course. The construction takes theories of social constructivism and learning with multimedia as its point of departure. In response to the need for knowledge of scientific vocabulary, the researcher collaborated with a group of 82 students and their two teachers to select and encode 81 video clips of technical terminology. The gains from the process of constructing the instrument enabled collaborative and interdisciplinary learning and showed the potential to facilitate technical vocabulary acquisition.","subject":"Vocabulary Development, Second Language Learning, Multimedia Materials, Video Technology, Interdisciplinary Approach, Foreign Countries, Physics, English (Second Language), Energy, Introductory Courses, Cooperative Learning, Constructivism (Learning), Learning Theories, Undergraduate Students, Computer Assisted Instruction","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Rwanda"},{"id":"EJ1059236","title":"Factors Affecting the Normalization of CALL in Chinese Senior High Schools","author":"He, Bi, Puakpong, Nattaya, Lian, Andrew","description":"With the development of Information Technology, increasing attention has been paid to Computer Assisted Language Learning (CALL). Meanwhile, increasing enthusiasm is seen for English learning and teaching in China. Yet, few research studies have focused on the normalization of CALL in ethnically diverse areas. In response to this research gap, this study aims to identify major factors affecting the normalization of CALL in Chinese senior high schools in the Qian Xi'nan Buyi and Miao Autonomous Prefecture (QBMP). A questionnaire was administered to 340 English teachers and a semi-structured oral interview was conducted as a follow-up. The study produced the following four findings: (a) most teachers were in favor of using computers in English teaching although they had to be cautious in guiding students; (b) institutional support was seen as instrumental; (c) teachers' computer competency and relevant training were considered to be important; and (d) teaching methodology and learner factors were identified as crucial.","subject":"Foreign Countries, Computer Assisted Instruction, Second Language Instruction, English (Second Language), High Schools, English Teachers, Secondary School Teachers, Questionnaires, Semi Structured Interviews, Teacher Attitudes, Computer Attitudes, Computer Literacy, Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"},{"id":"EJ1059266","title":"I Help, Therefore, I Learn: Service Learning on Web 2.0 in an EFL Speaking Class","author":"Sun, Yu-Chih, Yang, Fang-Ying","description":"The present study integrates service learning into English as a Foreign Language (EFL) speaking class using Web 2.0 tools--YouTube and Facebook--as platforms. Fourteen undergraduate students participated in the study. The purpose of the service-learning project was to link service learning with oral communication training in an EFL speaking class by having each student create two YouTube videos in which they made informative presentations about the university (e.g., transportation system) and the city (e.g., sightseeing spots) in English to international students on campus. A Facebook community was established as a forum for students to share their videos with the international students and peers. The results suggest that the project enhanced EFL students' public speaking-related skills (e.g., idea and content development, and pronunciation), built their confidence in speaking English, and allowed them to develop their own learning process and strategies. Moreover, Web 2.0 tools endow service learning with new possibilities of reaching a greater number of the target audience and provide the members of the community with alternative means of communication.","subject":"Service Learning, Web 2.0 Technologies, English (Second Language), Second Language Learning, Oral Language, Learning Processes, Learning Strategies, Video Technology, Pronunciation, Foreign Students, Peer Relationship, Teaching Methods, Self Efficacy, Computer Assisted Instruction, Case Studies, Undergraduate Students, Foreign Countries, Surveys, Likert Scales, Student Attitudes, Reflection, Essays, Interviews, Outcomes of Education, Learning Theories, Qualitative Research, Dialogs (Language), Privacy, Computer Mediated Communication, Learning Experience","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1047664","title":"EFL Writing Revision with Blind Expert and Peer Review Using a CMC Open Forum","author":"Wu, Wen-Chi Vivian, Petit, Emily, Chen, Ching-Huei","description":"This exploratory computer assisted-language learning (CALL) study used a computer-mediated communication (CMC) interface to allow English as a foreign language (EFL) writing students in classes at two universities to give each other anonymous peer feedback about essay-writing assignments reacting to selected news stories. Experts also provided feedback review. Follow-up questions were facilitated by the interface. The students felt that they benefitted from the instructional design, but found that the peer review focused most on things like grammar whereas the experts focused on organization and structure, making the expert feedback more valuable. Researchers found that more complex issues discussed in the source news articles resulted in lower outcome scores, based on a rubric, than did source material simpler issues. The study also compared performance of students with higher and lower ability and evaluated the quality of the review comments. Conclusions and recommendations for practice are provided. This study is significant because it used CALL\/CMC technology to provide online interactivity between students and reviewers in an open forum that allowed students to seek follow-up clarification to the comments of reviewers. The review process, therefore, was not a one-way anonymous communication from reviewer to student but rather allowed interactive discussion of the points and suggestions made by the reviewers.","subject":"Computer Mediated Communication, Grammar, Scores, English (Second Language), Second Language Learning, Feedback (Response), Essays, Writing Assignments, Second Language Instruction, Instructional Design, Scoring Rubrics, College Students, Statistical Analysis, Qualitative Research, Focus Groups, Interviews, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063481","title":"Dictionaries vs Concordancers: Actual Practice of the Two Different Tools in EFL Writing","author":"Lai, Shu-Li, Chen, Hao-Jan Howard","description":"A number of studies have suggested the possible benefits of using concordancers in English as a Foreign Language (EFL) writing. To date, however, there is still limited understanding of how EFL writers may make use of such tools along with dictionaries when engaging in a writing task. To better understand the question, this study investigated a class of non-English-major college students (N = 14) over a semester. Four online corpus tools, including monolingual and bilingual concordancers and collocation retrieval systems, were provided, along with two online dictionaries. After two tool-training sessions, students performed three timed-writing tasks online during three consecutive months and received individual stimulus recall interviews after each writing task. The recall interviews served as the main source of data; other data included the video clips of the writing process, student writing samples, and the researchers' notes. The result showed that students used corpus tools and the bilingual dictionary for different purposes. They tended to use a bilingual dictionary when information on word form and word meaning was needed. When searching for information related to word usage, collocation information, and grammar patterns, they chose corpus tools more often than a bilingual dictionary. However, they also turned to corpus tools for meaning and form when the bilingual dictionary failed to provide clear word meanings, when they needed to search for word strings, and when they needed to just confirm an intuition regarding either word form or word meaning. This study provides empirical data that help to better understand how corpus tools contribute to EFL writing.","subject":"Dictionaries, Indexes, English (Second Language), Second Language Learning, Second Language Instruction, Computational Linguistics, Nonmajors, Writing (Composition), Phrase Structure, Recall (Psychology), Bilingualism, Monolingualism, Video Technology, Grammar, Definitions, Intuition, Writing Processes, College Students, Writing Instruction, Teaching Methods, Qualitative Research, Statistical Analysis, Semi Structured Interviews, Observation, Foreign Countries, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]