[{"id":"EJ1143785","title":"Conversation Analysis in Computer-Assisted Language Learning","author":"González-Lloret, Marta","description":"The use of Conversation Analysis (CA) in the study of technology-mediated interactions is a recent methodological addition to qualitative research in the field of Computer-assisted Language Learning (CALL). The expansion of CA in Second Language Acquisition research, coupled with the need for qualitative techniques to explore how people interact in technology-mediated environments, has stimulated a small but growing body of research. This article reviews CALL research that employed a CA approach to the collection, microanalysis, and understanding of the data in a variety of technology-mediated fields (text, audio and video SCMC, email, forums and bulletin boards, social networks, and games), with participants from different contexts and languages, interacting in an L2 either among themselves or with native\/more expert speakers of the language. Most research up to now has been descriptive in nature, illustrating the sequential organization of interaction, interactional and linguistic resources employed by the participants, and affordances and challenges of the media to promote language learning. In addition, a few studies have directly explored &quot;learning&quot; through the microanalysis of longitudinal data for any changes in the learners' linguistic and interactional patterns of engagement. The review of studies is followed by those challenges that affect the implementation of CA in CALL research and a vision of the future of CA for CALL in the larger field of Applied Linguistics.","subject":"Discourse Analysis, Computer Mediated Communication, Computer Assisted Instruction, Second Language Instruction, Second Language Learning, Qualitative Research, Data Analysis, Program Implementation, Educational Research, Applied Linguistics, Sequential Approach, Affordances, Longitudinal Studies, Concept Formation","source":"CALICO Journal","publicationdateyear":2015}]