[{"id":"EJ1318422","title":"Thirty Years of Data-Driven Learning: Taking Stock and Charting New Directions over Time","author":"Boulton, Alex, Vyatkina, Nina","description":"The tools and techniques of corpus linguistics have many uses in language pedagogy, most directly with language teachers and learners searching and using corpora themselves. This is often associated with work by Tim Johns who used the term Data-Driven Learning (DDL) back in 1990. This paper examines the growing body of empirical research in DDL over three decades (1989-2019), with rigorous trawls uncovering 489 separate publications, including 117 in internationally ranked journals, all divided into five time periods. Following a brief overview of previous syntheses, the study introduces our collection, outlining the coding procedures and conversion into a corpus of over 2.5 million words. The main part of the analysis focuses on the concluding sections of the papers to see what recommendations and future avenues of research are proposed in each time period. We use manual coding and semi-automated corpus keyword analysis to explore whether those points are in fact addressed in later publications as an indication of the evolution of the field.","subject":"Data Use, Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Educational Trends, Educational Research, Information Retrieval, Language Proficiency, Computational Linguistics, Synthesis, Sample Size, Foreign Countries, Technology Integration","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":null},{"id":"EJ1295135","title":"Big Data and Language Learning: Opportunities and Challenges","author":"Godwin-Jones, Robert","description":"Data collection and analysis is nothing new in computer-assisted language learning, but with the phenomenon of massive sets of human language collected into corpora, and especially integrated into systems driven by artificial intelligence, new opportunities have arisen for language teaching and learning. We are now seeing powerful artificial neural networks with impressive language capabilities. In education, data provides means to track learner performance and improve learning, especially through the application of data mining to expose hidden patterns of learner behavior. Massive data collection also raises issues of transparency and fairness. Human monitoring is essential in applying data analysis equitably. Big data may have as powerful an impact in language learning as it is having in society generally; it is an important resource to have available, but one to use with care and caution.","subject":"Data Collection, Academic Achievement, Learning Analytics, Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Teaching Methods, Artificial Intelligence, Behavior Patterns, Ethics, Networks, Social Media, Integrated Learning Systems, Computational Linguistics, Learning Processes, Educational Improvement","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":null},{"id":"EJ1318314","title":"L2 Pragmatics and CALL","author":"González-Lloret, Marta","description":"In order to develop pragmatic competence in a language other than our own (L2), it is important to have enough knowledge of the cultural norms of the target language and enough opportunities to interact with a wide range of speakers to deploy different speech acts, registers, levels of politeness, conversational moves, and the like. The limitations common in traditional face-to-face classrooms have brought researchers in the field of Computer-Assisted Language Learning (CALL) to recognize that technology can provide environments to expose language learners to a larger variety of sociopragmatic situations and contexts to test and develop their L2 pragmatic competence. This article presents a historical overview of the tools and digital spaces that have been explored for the teaching and the research of L2 pragmatics. Pedagogical practices that have evolved from presentational to more interactive are then briefly discussed. The article ends with a look into what the future may bring for the field of technology mediated L2 pragmatics.","subject":"Pragmatics, Second Language Learning, Second Language Instruction, Computer Assisted Instruction, Cultural Awareness, Speech Acts, Native Speakers, Teaching Methods, Communicative Competence (Languages), Educational History, Computer Mediated Communication, Computer Simulation, Computer Games, Computational Linguistics, Dialogs (Language), Social Networks","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":null},{"id":"EJ1295140","title":"Lexical Complexity, Writing Proficiency, and Task Effects in Spanish Dual Language Immersion","author":"Schnur, Erin, Rubio, Fernando","description":"Using the 2.4-million-word written Spanish subsection of the Corpus of Utah Dual Language Immersion, collected from a large-scale standardized writing assessment of K-12 Spanish second language (L2) students, this study focuses on lexical complexity as operationalized by three measures: lexical diversity, lexical density, and lexical sophistication. The study goes beyond most previous work on lexical complexity by investigating the effect of task type on all three measures of lexical complexity. Patterns in variation are identified across proficiency levels and between task types. Results show that all three measures increase at each proficiency score between Novice High and Advanced, except at Intermediate Mid where scores dip or flatten. Diversity and sophistication are both shown to increase rapidly after this mid-point, indicating that a broad and deep lexical repertoire is a key feature of more advanced proficiency levels. Results for the effect of task indicate that text genre impacts learners' lexical density, while tasks that are more complex elicit higher lexical sophistication.","subject":"Spanish, Immersion Programs, Computational Linguistics, Bilingual Education Programs, Writing Tests, Kindergarten, Elementary Secondary Education, Task Analysis, Second Language Learning, Second Language Instruction, Standardized Tests, Language Usage, Vocabulary Skills, Language Variation, Scores, Language Proficiency, Literary Genres, Databases, Guidelines, Rating Scales","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":"Utah"},{"id":"EJ1318403","title":"The Evolution of Identity Research in CALL: From Scripted Chatrooms to Engaged Construction of the Digital Self","author":"Klimnova, Liudmila","description":"Drawing on past and current scholarship on digitally mediated communication in language learning, this review article examines the evolution of identity research in computer-assisted language learning (CALL) from the 1990s to the present day. The article offers an in-depth overview of critical issues and topics associated with language learner identification in educational digital settings and non-institutionally situated online cultures. A chronological approach is followed, addressing three main historical periods broadly related to the major conceptual shifts in applied linguistics: early developments and the communicative turn (1995-2000), the social and intercultural turns (2000-2010), and the critical and multilingual turns (2010-2020). Thus, this paper seeks to link the research on digital identity in CALL to second language acquisition (SLA) theories and highlight key studies and their importance for the field and the shifting paradigm. The article concludes with a summary of newly emerging themes in digital identity studies and outlines new directions for research on language learner identity in digital spaces. Singling out identity research within the discipline of CALL as a historically evolving topic that reflects the ever-changing realms of the digital world contributes to strengthening interdisciplinary ties between broadly conceptualized digital humanities, digital humanistic pedagogies, and computer-assisted language learning sciences.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Self Concept, Educational History, Multilingualism, Research Reports, Online Courses, Humanities, Humanism, Computer Mediated Communication, Teaching Methods, Interdisciplinary Approach, Social Networks, Independent Study, Personal Autonomy, Social Media, Communities of Practice, Intercultural Communication","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":null},{"id":"EJ1303789","title":"Discovering Collocations via Data-Driven Learning in L2 Writing","author":"Wu, Yi-ju","description":"Adopting the approaches of &quot;pattern hunting&quot; and &quot;pattern refining&quot; (Kennedy &amp; Miceli, 2001, 2010, 2017), this study investigates how seven freshman English students from Taiwan used the Corpus of Contemporary American English to discover collocation patterns for 30 near-synonymous change-of-state verbs and new ideas about the topic of &quot;change&quot; in the drafting stage of their essay writing. The study used a mixed-methods approach to examine the learning outcomes, learners' corpus use, and their perceptions of the process. Results were drawn by analyzing writings in three time frames (pre-test, post-test, delayed posttest), video files of corpus consultation, questionnaires, and stimulus recall-session interviews. The results showed that the learners successfully discovered and incorporated collocation patterns in change-of-state verbs and ideas about the topic of change into their essays, although some difficulties emerged. Their performance on change-of-state verbs improved, and this improvement remained three months after the treatment. The study also demonstrated learners' different perceptions and actualizations of the affordances offered by the corpus. While all learners used the corpus to correct collocation errors, they had diverse attitudes and uses of the corpus to address content ideas or collocation complexities in their writing. The study concludes by discussing the theoretical and pedagogical implications of the results.","subject":"Phrase Structure, Teaching Methods, Second Language Learning, Second Language Instruction, English (Second Language), College Freshmen, Student Attitudes, Foreign Countries, Computational Linguistics, North American English, Essays, Writing (Composition), Pretests Posttests, Verbs, Error Correction, Outcomes of Education, Recall (Psychology), Language Usage, Language Patterns, Writing Instruction","source":"Language Learning & Technology","publicationdateyear":2021,"identifiersgeo":"Taiwan"}]