[{"id":"EJ1063571","title":"Computer-Based Grammar Instruction in an EFL Context: Improving the Effectiveness of Teaching Adverbial Clauses","author":"Kiliçkaya, Ferit","description":"This study aims to find out whether there are any statistically significant differences in participants' achievements on three different types of instruction: computer-based instruction, teacher-driven instruction, and teacher-driven grammar supported by computer-based instruction. Each type of instruction follows the deductive approach. The sample of the study consists of 50 learners of English enrolled in a preparatory course for a high-stake language exam conducted in Turkey. The effectiveness is compared based on the results obtained from the post-test and the delayed post-test, which is conducted five weeks later. The participants instructed by using both computer-based and teacher-driven grammar instruction supported by computer-based materials score higher than those who receive traditional instruction. Moreover, supporting teacher-driven instruction with computer-based materials in learning adverbial clauses can lead to higher achievement through taking practice beyond the classroom.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Grammar, English (Second Language), Teaching Methods, High Stakes Tests, Foreign Countries, Scores, Conventional Instruction, Form Classes (Languages), Phrase Structure, Academic Achievement, Instructional Effectiveness, Language Tests, Experimental Groups, Courseware, Instructional Materials, Pretests Posttests, Language Proficiency, Employment Qualifications","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1051460","title":"Corpus-Based versus Traditional Learning of Collocations","author":"Daskalovska, Nina","description":"One of the aspects of knowing a word is the knowledge of which words it is usually used with. Since knowledge of collocations is essential for appropriate and fluent use of language, learning collocations should have a central place in the study of vocabulary. There are different opinions about the best ways of learning collocations. This study investigates the effectiveness of corpus-based activities for learning verb-adverb collocations compared to traditional activities usually found in course books. The test results show that the participants who learned the collocations with the help of the online concordancer gained more knowledge and had better results in all parts of the test.","subject":"Computational Linguistics, Phrase Structure, Verbs, Form Classes (Languages), Teaching Methods, Indexes, Language Tests, Language Fluency, Instructional Effectiveness, Foreign Countries, Undergraduate Students, Second Language Instruction, Second Language Learning, Experimental Groups, Pretests Posttests, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Macedonia"},{"id":"EJ1051421","title":"Implementing Courseware as the Primary Mode of Task-Based ESP Instruction: A Case Study of EFL Students","author":"Tsai, Shu-Chiao","description":"The study reports on implementing self-developed English for specific purposes (ESP) courseware for technology industries in an elective course, &quot;English reading for technology,&quot; offered to junior students of English as a foreign language in a technical university in southern Taiwan. Courseware implementation was combined with a sustained-content language teaching (SCLT) approach and a task-based learning (TBL) approach was adopted. The course mainly focused on vocabulary, listening, and reading comprehension. Evaluation of implementing these information and communication technologies (ICTs) in ESP instruction was based upon data from a variety of pre-tests and post-tests including cloze, dictation, essay writing, and Q&amp;A tests. The courseware not only provided learning materials for the target ESP, but also offered content-based and linguistic learning activities with corresponding instant self-evaluation. These features offered by the courseware both corresponded to the duel focus of the SCLT approach, and provided a model for developing an ESP courseware. Also, a teacher-centered instruction of the same subject matter was conducted with a control group. Students self-studying with the ESP courseware made as much progress as those that elected teacher-centered instruction. Most students were satisfied with the courseware-implemented ESP instruction combined with the SCLT and TBL approaches.","subject":"Courseware, English for Special Purposes, Second Language Learning, Second Language Instruction, Task Analysis, Teaching Methods, Models, Computer Assisted Instruction, Elective Courses, Reading Comprehension, Pretests Posttests, Cloze Procedure, Course Descriptions, Foreign Countries, Technical Education, Universities, Essays, Self Evaluation (Individuals), Student Attitudes, Undergraduate Students, Questionnaires, Control Groups","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077787","title":"Design Considerations of Help Options in Computer-Based L2 Listening Materials Informed by Participatory Design","author":"Cárdenas-Claros, Mónica Stella","description":"This paper reports on the findings of two qualitative exploratory studies that sought to investigate design features of help options in computer-based L2 listening materials. Informed by principles of participatory design, language learners, software designers, language teachers, and a computer programmer worked collaboratively in a series of design sessions. The participants first evaluated researcher-generated prototypes, designed prototypes for two language proficiencies (beginner and upper intermediate) and iterated designs on both paper and screen. Analysis of the reworked prototypes resulted in five features of help option design: type, location, sequence, click-through, and display. Analyses of the interaction data showed that consensually the participants favored help options that are easy to use, promote learner control, support guidance, and stimulate learning.","subject":"Second Language Learning, Qualitative Research, Listening Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Materials, Language Teachers, Programming, Language Proficiency, Material Development, Usability, Interaction, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1047670","title":"Promoting Different Reading Comprehension Levels through Online Annotations","author":"Tseng, Sheng-Shiang, Yeh, Hui-Chin, Yang, Shih-hsien","description":"Previous studies have evaluated reading comprehension as the general understanding of reading texts. However, this broad and generic assessment of reading comprehension overlooks the specific aspects and processes that students need to develop. This study adopted Kintsch's Construction-Integration model to tap into reading comprehension at different levels and investigated how English as a foreign language (EFL) students benefit from online annotations to scaffold reading comprehension. Fifty EFL students participated in this study and the data collected included (1) the pre- and post-test assessments in reading comprehension levels, (2) the students' online annotations on reading texts, and (3) the discussion transcripts from an online discussion forum. The results from the first two data sources (1 and 2) were the data-sets used to investigate the influence of the annotation types on reading comprehension levels. The third data source was the data-set used to probe into the process of how students benefited from annotation types to reach different levels of reading comprehension. Four types of online annotations were frequently used by the students while reading online, including (1) marking vocabulary, (2) adding Chinese explanatory notes to unknown vocabulary, (3) marking text information, and (4) adding summary notes to each paragraph. Different frequencies of using the four types of online annotations resulted in three different comprehension levels: surface-based, text-based, and situation-based levels. Marking vocabulary and adding Chinese explanatory notes helped scaffold the students' learning to achieve surface comprehension levels to facilitate recognition and meaning of unknown vocabulary. Marking text information and in particular, the adding of summary notes to each paragraph were the core annotations that helped students comprehend the online text in text-based and situation-based levels. EFL teachers can guide students to use online annotations to different extents in order to deepen their reading comprehension.","subject":"Reading Comprehension, Reading Instruction, Scaffolding (Teaching Technique), Documentation, English (Second Language), Second Language Instruction, College Freshmen, Pretests Posttests, Discussion, Vocabulary, Notetaking, Computer Uses in Education, Reading Improvement, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1080778","title":"Facilitating Metacognitive Processes of Academic Genre-Based Writing Using an Online Writing System","author":"Yeh, Hui-Chin","description":"Few studies have investigated how metacognitive processes foster the application of genre knowledge to students' academic writing. This is largely due to its internal and unobservable characteristics. To bridge this gap, an online writing system based on metacognition, involving the stages of planning, monitoring, evaluating, and revising, was developed to investigate how such a system contributed to the understanding and application of genre knowledge to students' academic writing. The data included three different versions of each student's written research proposal, action logs, discussion transcripts in discussion forums, and an open-ended questionnaire. Descriptive statistics, a typical case sampling, and the constant comparison method were used to analyze the data. The results suggested that the students made greater improvements in academic writing performance after experiencing metacognitive processes. Particularly, collaborative efforts throughout the metacognitive processes were important in supporting students to understand the academic genre, recognize the problems of unstructured academic papers, and apply genre knowledge to academic writing. The online writing system features, designed to nurture students' metacognitive processes, served as useful cognitive stimuli to raise students' metacognitive awareness. The system's functions overcame the limitations of observing students' metacognitive processes described in previous studies, and enabled teachers to provide follow-up instruction. Implications and recommendations are also addressed.","subject":"Metacognition, Statistical Analysis, Academic Discourse, Sampling, Questionnaires, Writing Instruction, Computer Assisted Instruction, Writing Processes, Writing Improvement, Teaching Methods, Cooperative Learning, Graduate Students, Foreign Countries, Computer Software, Second Language Learning, Second Language Instruction, English for Academic Purposes","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077717","title":"Applying Role-Playing Strategy to Enhance Learners' Writing and Speaking Skills in EFL Courses Using Facebook and Skype as Learning Tools: A Case Study in Taiwan","author":"Yen, Yen-Chen, Hou, Huei-Tse, Chang, Kuo En","description":"English as a foreign language (EFL) instruction faces many challenges in Asia because of many cultural and environmental factors, such as the lack of interactive speaking environments, emphasis placed on test scores, and foreign language anxiety. The purpose of this research is to conduct an EFL instructional course by integrating Facebook (asynchronous online discussion) and Skype (synchronous online discussion) as platforms through which students perform role-playing based learning activities and to observe the effects of the course on the challenges mentioned above. The study consists of 42 participants who are enrolled in an English conversation course in a business college in Taiwan. This study conducted a learning performance analysis, correlation analysis, and qualitative content analysis of the learning process. The results indicate that the learners improved their speaking and writing skills through the learning tools and role-playing activities. The content analysis also demonstrated that learners could improve their speaking and writing skills via peer-to-peer and self-correction behaviors. We also provide several recommendations for EFL educators and researchers.","subject":"Role Playing, English (Second Language), Second Language Learning, Content Analysis, Conversational Language Courses, Correlation, Business Schools, Foreign Countries, Asians, Second Language Instruction, Cultural Influences, Environmental Influences, Computer Mediated Communication, Synchronous Communication, Qualitative Research, Learning Processes, Writing Skills, Oral Language, Peer Relationship, Error Correction, Case Studies, College Students, Social Media, Language Tests, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1080885","title":"Spoken Grammar Practice and Feedback in an ASR-Based CALL System","author":"de Vries, Bart Penning, Cucchiarini, Catia, Bodnar, Stephen, Strik, Helmer, van Hout, Roeland","description":"Speaking practice is important for learners of a second language. Computer assisted language learning (CALL) systems can provide attractive opportunities for speaking practice when combined with automatic speech recognition (ASR) technology. In this paper, we present a CALL system that offers spoken practice of word order, an important aspect of Dutch grammar. The system uses ASR technology to process the learner's responses and to detect errors so that immediate corrective feedback (CF) can be provided on learner errors. We evaluate the system as a learning environment by analyzing proficiency gains in pre- and post-tests, the logs of the practice sessions, and the learners' appreciation of the system. In this paper, we present two learning conditions: (1) the learners received oral practice and immediate CF on spoken performance and (2) learners received oral practice and NO CF on spoken performance. We found that our system was successful in providing L2 speaking practice. Results show that both groups improve their proficiency on the target feature as a result of treatment. Between the groups there is no significant difference in learning, but the groups proceeded differently through the sessions, and the learners in the group that received automatic CF evaluated the system more positively than the NO CF group. We discuss the performance of the system as an environment for language learning and the obtained proficiency test results, and relate them to current views on second language acquisition.","subject":"Grammar, Computer Assisted Instruction, Feedback (Response), Error Correction, Language Proficiency, Pretests Posttests, Oral Language, Second Language Learning, Indo European Languages, Second Language Instruction, Language Tests, Task Analysis, Adult Students, Video Technology, Foreign Countries, Likert Scales, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Netherlands"},{"id":"EJ1047675","title":"Developing a Corpus-Based Paraphrase Tool to Improve EFL Learners' Writing Skills","author":"Chen, M.-H., Huang, S.-T., Chang, J. S., Liou, H.-C.","description":"Paraphrasing, or restating information using different words, is critical to successful writing. However, EFL learners have difficulty in making paraphrases to meet their writing demands, and there has been little research on developing automatic reference tools to assist these learners' paraphrasing skills for better writing quality. In this study, we developed PREFER, an online corpus-based paraphrasing assistance system. Allowing multi-word input and returning promptly with a list of paraphrases in English and Chinese, along with usage patterns and example sentences, &quot;PREFER&quot; provides substantial support for EFL learners to vary their expressions during writing. An assessment study of the effectiveness of &quot;PREFER&quot; was conducted with 55 Chinese-speaking EFL college freshmen in an Asian country. The results indicated that &quot;PREFER&quot; offered the most benefits to students' writing performance (with an after-use improvement of 38.2%), compared with an online dictionary and an online thesaurus (-31.6% and -6.2%, respectively). Further investigation revealed that the less proficient, more motivated, and more conservative students showed more significant progress in the paraphrasing task with the help of &quot;PREFER.&quot; In the meantime, nearly 90% of the students expressed satisfaction with the paraphrases generated by &quot;PREFER,&quot; and its functions, and another 75% of them acknowledged that &quot;PREFER&quot; benefits their writing task.","subject":"English (Second Language), Second Language Learning, Computational Linguistics, Dictionaries, Internet, Writing (Composition), Language Usage, Chinese, Writing Improvement, Asians, College Freshmen, Student Attitudes, Writing Instruction, Second Language Instruction, Scoring Rubrics, Writing Evaluation, Pretests Posttests, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1063555","title":"The Influence of Chinese Character Handwriting Diagnosis and Remedial Instruction System on Learners of Chinese as a Foreign Language","author":"Hsiao, Hsien-Sheng, Chang, Cheng-Sian, Chen, Chiao-Jia, Wu, Chia-Hou, Lin, Chien-Yu","description":"This study designed and developed a Chinese character handwriting diagnosis and remedial instruction (CHDRI) system to improve Chinese as a foreign language (CFL) learners' ability to write Chinese characters. The CFL learners were given two tests based on the CHDRI system. One test focused on Chinese character handwriting to diagnose the CFL learners' errors in the stroke order and their knowledge of Chinese characters, while the other test focused on the spatial structure of Chinese characters. Sixty-five participants, who had a strong desire to learn Chinese characters, voluntarily participated in this study. The results revealed that the CHDRI system enhanced the CFL learners' ability to write Chinese characters and to understand the spatial structure of Chinese characters, especially Sinosphere CFL learners. Moreover, it was found that remedial instruction materials not only reduced the amount of time the teacher spent coaching CFL learners in Chinese language learning but also facilitated the teacher's ability to provide feedback to individual learners.","subject":"Remedial Instruction, Chinese, Handwriting, Orthographic Symbols, Second Language Learning, Writing Improvement, Second Language Instruction, Language Tests, Error Patterns, Feedback (Response), Teaching Methods, Computer Assisted Instruction, Reliability, Validity, Foreign Countries, Statistical Analysis, Student Characteristics, College Students, Quasiexperimental Design, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1047664","title":"EFL Writing Revision with Blind Expert and Peer Review Using a CMC Open Forum","author":"Wu, Wen-Chi Vivian, Petit, Emily, Chen, Ching-Huei","description":"This exploratory computer assisted-language learning (CALL) study used a computer-mediated communication (CMC) interface to allow English as a foreign language (EFL) writing students in classes at two universities to give each other anonymous peer feedback about essay-writing assignments reacting to selected news stories. Experts also provided feedback review. Follow-up questions were facilitated by the interface. The students felt that they benefitted from the instructional design, but found that the peer review focused most on things like grammar whereas the experts focused on organization and structure, making the expert feedback more valuable. Researchers found that more complex issues discussed in the source news articles resulted in lower outcome scores, based on a rubric, than did source material simpler issues. The study also compared performance of students with higher and lower ability and evaluated the quality of the review comments. Conclusions and recommendations for practice are provided. This study is significant because it used CALL\/CMC technology to provide online interactivity between students and reviewers in an open forum that allowed students to seek follow-up clarification to the comments of reviewers. The review process, therefore, was not a one-way anonymous communication from reviewer to student but rather allowed interactive discussion of the points and suggestions made by the reviewers.","subject":"Computer Mediated Communication, Grammar, Scores, English (Second Language), Second Language Learning, Feedback (Response), Essays, Writing Assignments, Second Language Instruction, Instructional Design, Scoring Rubrics, College Students, Statistical Analysis, Qualitative Research, Focus Groups, Interviews, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059285","title":"Interactions between Text Chat and Audio Modalities for L2 Communication and Feedback in the Synthetic World &quot;Second Life&quot;","author":"Wigham, Ciara R., Chanier, Thierry","description":"This paper reports on a study of the interactions between text chat and audio modalities in L2 communication in a synthetic (virtual) world and observes whether the text chat modality was used for corrective feedback and the characteristics of the latter. This is examined within the context of a hybrid content and language integrated learning design workshop. This course involved 17 students of architecture whose L2 was either French or English and for which the synthetic world environment Second Life was employed for distance language sessions. Using multimodal transcriptions of the interaction data from these sessions, it was found that text chat was employed for content-based interaction concerning the task as well as for feedback concerning non-target-like errors in the audio modality. Feedback predominantly concerned lexical errors and was offered in the form of recasts. The multimodality of the environment did not appear to cognitively overload students who frequently responded in the audio modality to corrective feedback offered in the text chat. The study highlights the need to train language tutors who wish to exploit synthetic worlds to use the text chat in parallel with the audio to support learners' verbal production with respect to verbal participation and proficiency.","subject":"Computer Simulation, Social Systems, Internet, Computer Mediated Communication, Handheld Devices, Written Language, Telecommunications, Second Language Instruction, Auditory Stimuli, English, French, Nonverbal Communication, Feedback (Response), Discourse Analysis, Interaction, Interaction Process Analysis, Electronic Learning, Undergraduate Students, Architectural Education","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077835","title":"Technology Use and Self-Perceptions of English Language Skills among Urban Adolescents","author":"Li, Jia, Snow, Catherine, Jiang, Jingjing, Edwards, Nicholas","description":"Technology including social media and other technology applications enabled by different technology devices offer many possibilities for second language learners to improve their learning, if they are interested in doing so. We investigated purposes for using technology among urban adolescents, including both English language learners (ELLs) and native English speakers (NESs). Data were collected through a survey of 531 students in an urban public middle school in the USA. The results showed that students used technology for diverse purposes regardless of their first language background. Although overall technology students' access was comparable to national averages, the use of technology for many specific purposes was markedly lower, lending support to the notion of a new digital divide between students from high- and low-income families based on technology knowledge and meaningful application of such knowledge rather than mere access. Student reports of their own English skills were related to various specific uses of technology, e.g., blogging and email. These relationships were stronger for ELLs, particularly those in grade 6, than for NESs. The results suggest that younger ELL adolescents may be more aware of their language constraints and prone to use technology in certain ways than their NES peers. These findings provide some preliminary insights into the complex relationships between language skills and student preferences for technology use and can ultimately provide guidance for the integration of technology into language and literacy instruction for linguistically diverse urban adolescents.","subject":"Self Concept, English (Second Language), Second Language Learning, Low Income, Social Differences, Urban Areas, Adolescents, Technological Literacy, English Language Learners, Surveys, Middle School Students, Correlation, Literacy Education, Language Skills, Student Attitudes, Social Networks, Socioeconomic Status, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Massachusetts"},{"id":"EJ1051437","title":"From Web-Based Readers to Voice Bloggers: EFL Learners' Perspectives","author":"Huang, Hsin-chou","description":"With the advancement of such Web 2.0 applications as weblogs, language learners have more opportunities to use a target language for communication purposes and to experience peer collaboration and interaction. In the search for ways to augment an EFL curriculum in which speaking practice is limited but the demand for improving oral proficiencies is high, this study explored the use of voice blogging to develop communication skills, analyzed the stages of students' blogging efforts, and investigated students' perceptions of this authentic language experience. Seventy-four intermediate EFL learners from two Freshman English classes at a national university in Taiwan participated in this study. During the semester-long experiment, students read online materials and used an instructional blogging site constructed by the teacher-researcher to post voice blog entries and comment on peers' blog posts. The recursive four stages of their blogging efforts were: reading to learn, planning and organizing, speaking, and sharing. In a post-task survey and in semi-structured interviews, students said they felt that the process of producing voice blog entries facilitated language learning, enhanced knowledge construction, and promoted social networking. Students also offered suggestions for ways to improve the project, such as teaching more online search skills, providing better online recording mechanisms, and setting up a combination of face-to-face and online interactions. This study's findings and suggestions for future voice blogging projects can serve as a template for integrating voice blogging into the EFL curriculum.","subject":"Web 2.0 Technologies, Semi Structured Interviews, Electronic Publishing, English (Second Language), Second Language Learning, Surveys, Foreign Countries, College Freshmen, Language Proficiency, Oral Language, Computer Mediated Communication, Language Processing, Student Attitudes, Social Networks, Search Strategies, Second Language Instruction, Teaching Methods, Computer Assisted Instruction, Web Sites, Feedback (Response)","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1047667","title":"Flipping the Classroom for English Language Learners to Foster Active Learning","author":"Hung, Hsiu-Ting","description":"This paper describes a structured attempt to integrate flip teaching into language classrooms using a WebQuest active learning strategy. The purpose of this study is to examine the possible impacts of flipping the classroom on English language learners' academic performance, learning attitudes, and participation levels. Adopting a quasi-experimental design, three different formats for flip teaching were developed in this study. The results indicate that the structured and semi-structured flip lessons were more effective instructional designs than the non-flip lessons. With a varying extent, both the structured and semi-structured flip lessons helped the students attain better learning outcomes, develop better attitudes toward their learning experiences, and devote more effort in the learning process. Given the positive results, this paper concludes with a call for more research into this promising pedagogy to contribute to its knowledge base across disciplines.","subject":"Active Learning, Second Language Learning, Learning Experience, Teaching Methods, Learning Processes, Computer Assisted Instruction, Academic Achievement, Student Attitudes, Quasiexperimental Design, English (Second Language), Second Language Instruction, Foreign Countries, Communicative Competence (Languages), Instructional Effectiveness, Questionnaires, Semi Structured Interviews, Statistical Analysis, Student Participation, College Students, Blended Learning","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059266","title":"I Help, Therefore, I Learn: Service Learning on Web 2.0 in an EFL Speaking Class","author":"Sun, Yu-Chih, Yang, Fang-Ying","description":"The present study integrates service learning into English as a Foreign Language (EFL) speaking class using Web 2.0 tools--YouTube and Facebook--as platforms. Fourteen undergraduate students participated in the study. The purpose of the service-learning project was to link service learning with oral communication training in an EFL speaking class by having each student create two YouTube videos in which they made informative presentations about the university (e.g., transportation system) and the city (e.g., sightseeing spots) in English to international students on campus. A Facebook community was established as a forum for students to share their videos with the international students and peers. The results suggest that the project enhanced EFL students' public speaking-related skills (e.g., idea and content development, and pronunciation), built their confidence in speaking English, and allowed them to develop their own learning process and strategies. Moreover, Web 2.0 tools endow service learning with new possibilities of reaching a greater number of the target audience and provide the members of the community with alternative means of communication.","subject":"Service Learning, Web 2.0 Technologies, English (Second Language), Second Language Learning, Oral Language, Learning Processes, Learning Strategies, Video Technology, Pronunciation, Foreign Students, Peer Relationship, Teaching Methods, Self Efficacy, Computer Assisted Instruction, Case Studies, Undergraduate Students, Foreign Countries, Surveys, Likert Scales, Student Attitudes, Reflection, Essays, Interviews, Outcomes of Education, Learning Theories, Qualitative Research, Dialogs (Language), Privacy, Computer Mediated Communication, Learning Experience","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051461","title":"Developing a Multimedia Instrument for Technical Vocabulary Learning: A Case of EFL Undergraduate Physics Education","author":"Rusanganwa, Joseph Appolinary","description":"The aim of the present study is to investigate the process of constructing a Multimedia Assisted Vocabulary Learning (MAVL) instrument at a university in Rwanda in 2009. The instrument is used in a one-computer classroom where students were taught in a foreign language and had little access to books. It consists of video clips featuring images, sound and text intended to facilitate learning and retention of technical vocabulary in a first-year electricity course. The construction takes theories of social constructivism and learning with multimedia as its point of departure. In response to the need for knowledge of scientific vocabulary, the researcher collaborated with a group of 82 students and their two teachers to select and encode 81 video clips of technical terminology. The gains from the process of constructing the instrument enabled collaborative and interdisciplinary learning and showed the potential to facilitate technical vocabulary acquisition.","subject":"Vocabulary Development, Second Language Learning, Multimedia Materials, Video Technology, Interdisciplinary Approach, Foreign Countries, Physics, English (Second Language), Energy, Introductory Courses, Cooperative Learning, Constructivism (Learning), Learning Theories, Undergraduate Students, Computer Assisted Instruction","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Rwanda"},{"id":"EJ1077721","title":"A Virtual Walk through London: Culture Learning through a Cultural Immersion Experience","author":"Shih, Ya-Chun","description":"Integrating Google Street View into a three-dimensional virtual environment in which users control personal avatars provides these said users with access to an innovative, interactive, and real-world context for communication and culture learning. We have selected London, a city famous for its rich historical, architectural, and artistic heritage, as the location of choice for culture learning. Using avatars, learners walk the virtual streets of London under the guidance of a native English-speaking instructor, and interact with each other using text and voice chat functions. The study examines the effects of this virtual environment on culture learning. Specifically, a qualitative case study combined with a time-series design is used to investigate the virtual context's impact on culture learning in terms of learner knowledge and attitudes, and to track associated change processes across the three research phases (baseline, treatment, and maintenance). The results show that all four English learners involved in the study benefitted from their cultural immersion, to varying extents, in the virtual environment. Four contributing learner factors, namely linguistic proficiency, motivation, character traits, and attitudes were found to correspond to the learners' levels of acquaintance with the target culture.","subject":"Geographic Information Systems, Case Studies, Qualitative Research, Language Proficiency, Computer Simulation, English (Second Language), Second Language Learning, Learning Motivation, Personality Traits, Student Attitudes, Second Language Instruction, Foreign Countries, Native Speakers, Computer Mediated Communication, Cultural Education, Teaching Methods, Graduate Students, Multiple Choice Tests, Identification, Pictorial Stimuli, Student Evaluation, Statistical Analysis, Test Validity, Observation","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom (London)"},{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"},{"id":"EJ1063503","title":"Task Design and Its Induced Learning Effects in a Cross-Institutional Blog-Mediated Telecollaboration","author":"Chen, Wen-Chun, Shih, Yu-Chih Doris, Liu, Gi-Zen","description":"This research investigated if and how the instructional design affected the learning outcome in a blog-mediated project, namely students' communicative writing in the social media. Thirty-four college-level English learners from two universities in Taiwan participated in the telecollaboration. The current research continues to highlight the social networking nature of Web 2.0 by locating idea units (IUs) in students' semi-formal weekly discussions, instead of focusing on syntactic complexity of conventional written modality. In this study, the language learners' output performance (the quantity of IUs was operationalized as the dependent variable) was hypothesized to be affected by task type and duration time. The findings indicate that both were significant in eliciting the amount of IUs. As a result, the contributions of this study include (a) shedding some light on the academic and educational capacity of blog-mediated telecollaboration, (b) revealing multiple factors that might affect the telecollaborative mechanism with the use of weblogs for language learning purposes, and finally (c) evaluating interactive blogging activities' educational value for complementing formal-writing training.","subject":"Second Language Learning, English (Second Language), Social Networks, Electronic Publishing, Foreign Countries, Instructional Design, Outcomes of Education, Writing (Composition), College Students, Task Analysis, Second Language Instruction, Writing Instruction, Web 2.0 Technologies, Videoconferencing, Majors (Students), Qualitative Research, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1047685","title":"University Teachers' Perceptions of Online Informal Learning of English (OILE)","author":"Toffoli, Denyze, Sockett, Geoff","description":"Online Informal Learning of English (OILE) involves the many different types of language practices that non-specialist EFL students of English are involved in on the Internet. This article reviews previous studies in the area and summarises the specific outcomes that OILE is thought to produce. It then presents an analysis of a survey of teachers' cognitions concerning OILE from a sample of 30 professors of English working in French universities. It analyses survey data in various manners, offering insight into teachers' awareness of the OILE phenomenon amongst students, the perceived or imagined effects of these practices on their students' English and the ways they do or do not integrate these cognitions into their own teaching. Results indicate that many professors are aware of the types of input that their learners may be exposed to, but that they know little of the specifics and few make use of this knowledge in their English courses. In the discussion some questions are raised as to future forms for English language teaching to specialists of other disciplines.","subject":"Online Courses, Teacher Attitudes, Informal Education, English (Second Language), Second Language Learning, Surveys, Schemata (Cognition), College Faculty, Foreign Countries, Second Language Instruction, Futures (of Society), Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1080781","title":"Type of Instructional Delivery and Second Language Teacher Candidate Performance: Online versus Face-to-Face","author":"Kissau, Scott","description":"Research conducted over the past decade has consistently reported no significant differences in learning outcomes for students of fully online or face-to-face (F2F) instruction. Only a small number of these studies, however, have focused on courses in second language (L2) teacher preparation programs. Even fewer studies have compared the impact of online and F2F instruction on classroom practice. To fill this void in the research, an investigation was conducted of the impact of method of instructional delivery on the performance of teacher candidates in a Teaching English as a Second Language (TESL) program during their culminating student teaching internship. Focusing on a group of TESL interns who completed either online or F2F methodology training, a mixed methodology was used to compare student teacher outcomes on two key performance assessments and to compare university supervisor perceptions of student teacher performance. While the type of instructional setting was not found to significantly impact the teaching performance of the interns, interview data suggested that support from a cooperating teacher and prior experience working with students of diverse language and cultural backgrounds strongly influenced the teacher candidates' instructional practices.","subject":"English (Second Language), Second Language Learning, Second Language Instruction, Cooperating Teachers, Student Teachers, Mixed Methods Research, Internship Programs, Comparative Analysis, Supervisors, Online Courses, Prior Learning, Teacher Attitudes, Conventional Instruction, Cultural Differences, Cultural Background, Teaching Methods, College Faculty, Language Teachers, Meta Analysis, Teacher Education, Graduate Students, Semi Structured Interviews, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059236","title":"Factors Affecting the Normalization of CALL in Chinese Senior High Schools","author":"He, Bi, Puakpong, Nattaya, Lian, Andrew","description":"With the development of Information Technology, increasing attention has been paid to Computer Assisted Language Learning (CALL). Meanwhile, increasing enthusiasm is seen for English learning and teaching in China. Yet, few research studies have focused on the normalization of CALL in ethnically diverse areas. In response to this research gap, this study aims to identify major factors affecting the normalization of CALL in Chinese senior high schools in the Qian Xi'nan Buyi and Miao Autonomous Prefecture (QBMP). A questionnaire was administered to 340 English teachers and a semi-structured oral interview was conducted as a follow-up. The study produced the following four findings: (a) most teachers were in favor of using computers in English teaching although they had to be cautious in guiding students; (b) institutional support was seen as instrumental; (c) teachers' computer competency and relevant training were considered to be important; and (d) teaching methodology and learner factors were identified as crucial.","subject":"Foreign Countries, Computer Assisted Instruction, Second Language Instruction, English (Second Language), High Schools, English Teachers, Secondary School Teachers, Questionnaires, Semi Structured Interviews, Teacher Attitudes, Computer Attitudes, Computer Literacy, Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1080783","title":"Symmetrical and Asymmetrical Scaffolding of L2 Collocations in the Context of Concordancing","author":"Rezaee, Abbas Ali, Marefat, Hamideh, Saeedakhtar, Afsaneh","description":"Collocational competence is recognized to be integral to native-like L2 performance, and concordancing can be of assistance in gaining this competence. This study reports on an investigation into the effect of symmetrical and asymmetrical scaffolding on the collocational competence of Iranian intermediate learners of English in the context of concordancing. It also surveys the learners' attitudes towards the role of concordancing and scaffolding in learning L2 collocations. Immediate and delayed posttests were administered to examine the effects of the treatments given over 10 sessions on L2 collocations in the receptive and productive tasks. Results demonstrated that the three groups of participants who received the treatment tasks in the context of concordancing under symmetrical, asymmetrical, and no-scaffolding conditions, improved their knowledge of collocations significantly both in the receptive and productive tasks compared to the control group which had no access to concordancing and did not receive scaffolding. However, there was no significant difference among the performances of the concordancing groups either in the receptive or in the productive tasks. Moreover, learners expressed positive attitudes towards both concordancing and scaffolding.","subject":"Computational Linguistics, Phrase Structure, Scaffolding (Teaching Technique), Foreign Countries, Control Groups, English (Second Language), Second Language Learning, Task Analysis, Student Attitudes, Receptive Language, Pretests Posttests, Role, Expressive Language, Positive Attitudes, Second Language Instruction, Teaching Methods, Qualitative Research, Questionnaires, Likert Scales, College Students, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Iran"},{"id":"EJ1063476","title":"Investigating an Innovative Computer Application to Improve L2 Word Recognition from Speech","author":"Matthews, Joshua, O'Toole, John Mitchell","description":"The ability to recognise words from the aural modality is a critical aspect of successful second language (L2) listening comprehension. However, little research has been reported on computer-mediated development of L2 word recognition from speech in L2 learning contexts. This report describes the development of an innovative computer application to improve L2 word recognition from speech, and goes on to describe an exploratory study of its use by 33 English as a second language (ESL) students. The study detected significant differences between word recognition scores measured before and after participants used the application. The manner with which students engaged with the computer application in terms of word recognition, self-determined exposure to speech input (repetitions) and modified output productivity (revisions) are also described and analysed. Differences in engagement by learners with different word recognition capabilities are noted. The paper concludes with a discussion of some recommendations for the use of computer-assisted development of L2 word recognition from speech and also provides concrete suggestions for much needed further empirical research in this area.","subject":"Second Language Learning, Second Language Instruction, Word Recognition, Linguistic Input, Computer Assisted Instruction, Teaching Methods, Speech, Listening Comprehension, English (Second Language), Learner Engagement, Psycholinguistics, Asians, College Students, Foreign Countries, Word Lists, Pretests Posttests, Language Tests, Student Attitudes, Attitude Measures, Scores, Accuracy, Verbal Communication","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1059267","title":"Blogs and the Development of Plurilingual and Intercultural Competence: Report of a Co-Actional Approach in Portuguese Foreign Language Classroom","author":"Melo-Pfeifer, Sílvia","description":"Focusing on the topic of the development of the plurilingual and intercultural competence through the integration of electronic communicative practices both in foreign language classrooms and non-formal contexts, this work aims at defining and characterizing, in view of a co-actional perspective, a &quot;pedagogical blog&quot;, by considering it from three different axes: a personal and social dimension, a collaborative and co-actional dimension and the management of linguistic and cultural repertoires dimension. In order to do so, this contribution presents and describes a case study which will highlight how blogs can be used in order to develop plurilingual and intercultural competences: we will present the classroom dynamics developed by the blog &quot;Falar pelos cotovelos&quot;, a year-long project created within the scope of the teaching and learning of Portuguese as a foreign language, in a non-formal setting (non-scholar public). Throughout the discussion of this purposeful sampling, our analysis will allow us to consider pedagogical blogs as means of socialization, as instruments at the service of exolingual interaction and as time-spaces for languages and cultures.","subject":"Multilingualism, Computer Mediated Communication, Second Language Instruction, Technology Uses in Education, Electronic Publishing, Portuguese, Cultural Awareness, Competence, Web 2.0 Technologies, Teaching Methods, Web Sites, Foreign Countries, Content Analysis, Qualitative Research, Spanish, German, English","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Germany"},{"id":"EJ1063481","title":"Dictionaries vs Concordancers: Actual Practice of the Two Different Tools in EFL Writing","author":"Lai, Shu-Li, Chen, Hao-Jan Howard","description":"A number of studies have suggested the possible benefits of using concordancers in English as a Foreign Language (EFL) writing. To date, however, there is still limited understanding of how EFL writers may make use of such tools along with dictionaries when engaging in a writing task. To better understand the question, this study investigated a class of non-English-major college students (N = 14) over a semester. Four online corpus tools, including monolingual and bilingual concordancers and collocation retrieval systems, were provided, along with two online dictionaries. After two tool-training sessions, students performed three timed-writing tasks online during three consecutive months and received individual stimulus recall interviews after each writing task. The recall interviews served as the main source of data; other data included the video clips of the writing process, student writing samples, and the researchers' notes. The result showed that students used corpus tools and the bilingual dictionary for different purposes. They tended to use a bilingual dictionary when information on word form and word meaning was needed. When searching for information related to word usage, collocation information, and grammar patterns, they chose corpus tools more often than a bilingual dictionary. However, they also turned to corpus tools for meaning and form when the bilingual dictionary failed to provide clear word meanings, when they needed to search for word strings, and when they needed to just confirm an intuition regarding either word form or word meaning. This study provides empirical data that help to better understand how corpus tools contribute to EFL writing.","subject":"Dictionaries, Indexes, English (Second Language), Second Language Learning, Second Language Instruction, Computational Linguistics, Nonmajors, Writing (Composition), Phrase Structure, Recall (Psychology), Bilingualism, Monolingualism, Video Technology, Grammar, Definitions, Intuition, Writing Processes, College Students, Writing Instruction, Teaching Methods, Qualitative Research, Statistical Analysis, Semi Structured Interviews, Observation, Foreign Countries, Questionnaires","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1059286","title":"Effect of Training Japanese L1 Speakers in the Production of American English \/r\/ Using Spectrographic Visual Feedback","author":"Patten, Iomi, Edmonds, Lisa A.","description":"The present study examines the effects of training native Japanese speakers in the production of American \/r\/ using spectrographic visual feedback. Within a modified single-subject design, two native Japanese participants produced single words containing \/r\/ in a variety of positions while viewing live spectrographic feedback with the aim of producing \/r\/ with a third formant (F3) frequency of less than 2300 Hz (upper threshold for identifiable \/r\/). Feedback was gradually reduced to promote independent production and monitoring. Both participants showed improvement in \/r\/ production in trained and untrained single words as indicated by percentage increases and effect sizes. Blind ratings by independent experts indicated significant \/r\/ production improvements during the reading of the Rainbow Passage. Perceptual distinction of \/r\/ and \/l\/ in minimal pairs also showed an upward trend. These findings suggest that spectrographic visual feedback is a promising method for training \/r\/ to Japanese-speaking English language learners.","subject":"Japanese, English (Second Language), Second Language Instruction, Visual Stimuli, Feedback (Response), Teaching Methods, Phonology, Phonemes, Articulation (Speech), Cues, Adults, Training, Pronunciation, Audio Equipment, Pretests Posttests, Oral Reading, Repetition, Prompting, Listening, Instructional Effectiveness, Scores, Comparative Analysis, Accuracy","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null}]