[{"id":"EJ1051724","title":"Exploring EFL Teachers' CALL Knowledge and Competencies: In-Service Program Perspectives","author":"Liu, Mei-Hui, Kleinsasser, Robert C.","description":"This article describes quantitative and qualitative data providing perspectives on how six English as a Foreign Language (EFL) vocational high school teachers perceived CALL knowledge and competencies in a yearlong technology-enriched professional development program. The teachers' developing technological pedagogical content knowledge (TPACK) and perceived computer self-efficacy are examined from their use of technology while participating in online project-based EFL instruction. Data analysis reveals these participants' TPACK and self-efficacy of using computer technology development, their application and infusion of technology in English instruction, and factors that facilitated or hampered their (technology) professional development. Such understandings are briefly buttressed with additional perspectives from three university professionals and these teachers' vocational high school students. The multiple perspectives and perceptions render meaning-making potential for professionals promoting and developing technology integration into EFL classrooms.","subject":"Inservice Teacher Education, Teacher Competencies, Teacher Competency Testing, Knowledge Level, Statistical Analysis, Qualitative Research, Vocational High Schools, Secondary School Teachers, English (Second Language), English Instruction, Language Teachers, Technology Uses in Education, Faculty Development, Technological Literacy, Pedagogical Content Knowledge, Self Efficacy, Online Courses, Electronic Learning, Barriers, Student Surveys, Student Teacher Attitudes, Pretests Posttests, Observation, Teacher Attitudes, Learning Experience, Foreign Countries, Computer Assisted Instruction, Semi Structured Interviews","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051720","title":"ESL Teacher Training in 3D Virtual Worlds","author":"Kozlova, Iryna, Priven, Dmitri","description":"Although language learning in 3D Virtual Worlds (VWs) has become a focus of recent research, little is known about the knowledge and skills teachers need to acquire to provide effective task-based instruction in 3D VWs and the type of teacher training that best prepares instructors for such an endeavor. This study employs a situated learning approach to teacher training and explores what online teaching skills emerge in the process of collaborative situated learning, how these skills develop, and whether collaborative situated learning is an effective method of training instructors to teach in 3D VWs. Six English as a second language (ESL) teacher trainees enrolled in the Teaching English as a Second\/Foreign Language (TES\/FL) program participated in the study. During the preteaching stage, teacher trainees developed language tasks to implement during the teaching stage with eight EFL students in 3D VWs. Blackboard wikis used for designing tasks allowed for observing the acquisition of five 3D-specific, integrated skills. The analysis of teaching sessions recorded through screen capturing software Camtasia Relay in conjunction with the teacher trainees' wikis and journals demonstrates that for this group of teachers, a situated learning approach was an effective method of teacher training.","subject":"English (Second Language), Second Language Instruction, Language Teachers, Teacher Education, Educational Technology, Virtual Classrooms, Online Courses, Teaching Skills, Cooperative Learning, Skill Development, Preservice Teachers, Technology Uses in Education, Computer Software, Web Sites, Web 2.0 Technologies, Context Effect, Foreign Countries, Teaching Methods, Qualitative Research, Content Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Canada, Turkey"},{"id":"EJ1063800","title":"Facilitating Participation: Teacher Roles in a Multiuser Virtual Learning Environment","author":"Wang, Airong","description":"This paper reports on a task-based language teaching course in Second Life. The data set consists of transcribed recordings and a teacher interview. Focusing on how the teacher facilitated student participation, this paper aims to explore the discourse functions in the teacher language output and then to address the teacher roles in three different task phases. All the turns produced by the teacher and the students were counted, the teacher language output in the recordings was classified into 19 discourse function categories, and then all the discourse functions were classified into six teacher roles. The results show that the during-task phase was student output oriented. This study reveals that in the pre-task phase the teacher used the largest number of types and tokens of discourse functions, and played a significant technical and social role. In the during-task phase, the teacher focused on motivating students to participate, monitoring student activities, and providing task support. In the post-task phase, the teacher was a language guide. While the teacher roles that were most prominent varied in the three task phases, the teacher was found to play four roles consistently in the three task phases: monitor role, motivator role, language guide role, and social role.","subject":"Virtual Classrooms, Teacher Role, Student Participation, Discourse Analysis, Undergraduate Students, Business English, Second Language Instruction, English (Second Language), College Faculty, Interviews, English Teachers, Foreign Countries","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Sweden"},{"id":"EJ1051684","title":"Promoting Pre-Service Teachers' Reflections through a Cross-Cultural Keypal Project","author":"Wach, Aleksandra","description":"This paper reports the results of an action research-based study that investigated participants' reflections on EFL learning and teaching in a computer-mediated communication (CMC)-based project. Forty pre-service teachers from two universities, in Poland and in Romania, exchanged emails on class-related topics; the email exchange was followed by a project evaluation questionnaire. E-mail entries and quantitative and qualitative findings from the questionnaire were analysed to evaluate the effects of participating in the keypal project on stimulating participants' reflections. Results point to considerable potential for the collaborative project as a means of evoking reflections on participants' knowledge, experience and practice. The investigation also highlighted the very positive perceptions of the participants about the value of the project for their professional training.","subject":"Action Research, English (Second Language), Second Language Instruction, Second Language Learning, Computer Assisted Instruction, Preservice Teachers, Electronic Mail, Program Evaluation, Questionnaires, Reflection, Teacher Education, Computer Mediated Communication, Cooperation, Cross Cultural Training, Foreign Countries","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Poland, Romania"},{"id":"EJ1051671","title":"Rethinking Transfer: Learning from CALL Teacher Education as Consequential Transition","author":"Chao, Chin-chi","description":"Behind CALL teacher education (CTE) there is an unproblematized consensus of transfer, which suggests a positivist and tool-centered view of learning gains that differs from the sociocultural focus of recent teacher education research. Drawing on Beach's (2003) conceptualization of transfer as &quot;consequential transition,&quot; this qualitative study seeks a cross-contextual understanding of language teacher learning with digital technology as the teachers in this study moved from a CTE course back to their own teaching contexts. Near the end of a CTE course, 19 in-service language teachers were asked to build connections between their experiences in the course and their teaching by creating a presentation. Four types of connections were identified, including thoughtful action planning, past experience refinement, and limited and reluctant use. In-depth interviews eight months later with four of the teachers found that they could seldom use the tools in the ways they had planned. However, they each experienced consequential transition as they struggled to reflect on their CTE course experience in everyday teaching. These results challenge the view that transfer in CTE must be about using technology. It is suggested that a focus on critical reflection of technology use may encourage teachers to continue reflective engagement in the ever-changing and complicated digital learning and teaching context.","subject":"Language Teachers, Teacher Education Programs, Praxis, Theory Practice Relationship, Transfer of Training, Interviews, Followup Studies, Graduate Surveys, Technology Uses in Education, Achievement Gains, Sociocultural Patterns, Pedagogical Content Knowledge, Educational Practices, Learning Experience, Multimedia Instruction, Multimedia Materials, English (Second Language), Second Language Instruction, Inservice Teacher Education, Graduate Students, Comparative Analysis, Semi Structured Interviews, Transcripts (Written Records), Technological Literacy, Technology Education, Teaching Methods, Teaching Skills, Foreign Countries, Educational Technology, Qualitative Research, Computer Assisted Instruction","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051726","title":"From TPACK-in-Action Workshops to Classrooms: CALL Competency Developed and Integrated","author":"Tai, Shu-Ju Diana","description":"This study investigated the impact of a CALL teacher education workshop guided by the TPACK-in-Action model (Tai, 2013). This model is framed within Technological Pedagogical Content Knowledge (TPACK, Mishra &amp; Koehler, 2006) and advocates a learning-by-doing approach (Chapelle &amp; Hegelheimer, 2004) to understand how English teachers develop CALL competency and adopt the competency in their teaching. Participants were 24 elementary English teachers in Taiwan. The study used a mixed methods design (Creswell &amp; Plano Clark, 2007), collecting and analyzing qualitative and quantitative data concurrently but separately before they were triangulated. Findings show that the TPACK-in-Action workshops had a positive impact on the 24 teachers. In addition to the development of CALL competency, it was also observed that participants demonstrated CALL competency in their teaching, such as selecting online materials and appropriate technology for content teaching, using cloud computing for student interaction, and matching the affordances of technology to meet their instructional goals and pedagogy. In sum, the study provides empirical evidence and a new perspective in the investigation of CALL teacher education. The theoretical and pedagogical implications for CALL teacher education research and practice are discussed.","subject":"Computer Assisted Instruction, Pedagogical Content Knowledge, Educational Technology, Technological Literacy, Technology Integration, Teacher Education, Elementary School Teachers, English Teachers, Mixed Methods Research, Program Effectiveness, Teacher Competencies, Educational Objectives, English (Second Language), Second Language Instruction, Models, Workshops, Teacher Surveys, Teacher Attitudes, Observation, Interviews, Reflection","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051670","title":"Supporting In-Service Language Educators in Learning to Telecollaborate","author":"O'Dowd, Robert","description":"The importance of teachers' capacity to integrate and exploit computer mediated communication (CMC) in the foreign language classroom has been recognised by many of the leading publications in foreign language teacher education, including the European Profile for Language Teacher Education (2004) and the European portfolio for student teachers of foreign languages (EPOSTL) (2007). One of the essential CMC activities in foreign language education is undoubtedly telecollaboration. This is the application of online communication tools to connect classes of language learners in geographically distant locations with the aim of developing their foreign language skills and intercultural competence through collaborative tasks and project work (O'Dowd, 2007). This paper begins by presenting a model of competences for the telecollaborative teacher, which has been developed and verified by this author (2013) using the Delphi technique. The paper then presents UNICollaboration (www.unicollaboration.eu), an online platform, which has been developed reflecting these competences and a sociocultural approach to teacher education. Following that, the findings of four qualitative case studies of novice telecollaborators are used to inform the design of tools and training courses for educators in this complex activity of online foreign language education.","subject":"Second Language Instruction, Second Language Learning, Language Teachers, Computer Assisted Instruction, Computer Mediated Communication, Teacher Competencies, Delphi Technique, Teacher Education, Case Studies, Cooperative Learning, Technological Literacy, Teacher Attitudes, College Faculty, Interviews, Foreign Countries","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Argentina, California, Italy"},{"id":"EJ1051723","title":"Learning to Identify and Actualize Affordances in a New Tool","author":"Haines, Karen J.","description":"Keeping abreast of new technologies and the opportunities they offer is a challenge for inservice teachers (Blake, 2008; Egbert, Akasha, Huff, &amp; Lee, 2011; Hanson-Smith, 2006; Hubbard, 2007; Robb, 2006). An important aspect of teacher learning about the use of technology is the ability to identify the affordances of new tools and how they can support learning in the language classroom (Hampel &amp; Stickler, 2005; Kessler, 2010). This fourteen-month-long longitudinal study of the learning of two experienced foreign language teachers working together describes how their perceptions of the affordances of two computer-mediated communication (CMC) tools developed over time. Interview data collected over three semesters demonstrated how teachers' perceptions of affordance evolve through classroom practice with technology, and how such perceptions might be transferred to the use of a new tool. As well, although the two teachers used the same tools (blogs and wikis) in the same courses and, at times, with the same classes, they perceived different learning affordances in relation to the language learning processes they prioritized. The article will conclude with suggestions for ways in which a better understanding of affordance in teacher knowledge development has implications for the support of in-service language teachers' learning.","subject":"Educational Technology, Longitudinal Studies, Second Language Instruction, Language Teachers, Computer Mediated Communication, Teacher Attitudes, Teaching Methods, Second Language Learning, Electronic Publishing, Web Sites, Case Studies, Interviews, Italian, Foreign Countries, College Faculty, Adult Students","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1051673","title":"Teaching Critical, Ethical and Safe Use of ICT in Pre-Service Teacher Education","author":"Shin, Sang-Keun","description":"This paper describes two studies that examined the awareness of pre-service English teachers regarding issues of digital literacy, fair use of digital materials, and e-safety. The participants in Study One designed reading and listening lessons utilizing online materials and then evaluated their lessons in terms of digital literacy and fair use. The participants in Study Two designed writing lessons based on social network services or online environments and evaluated the resulting lessons in terms of e-safety. This article reports on how these activities influenced selection criteria for online materials, methods for gathering instructional materials, and lesson plans. The results indicated that, initially, the pre-service teachers rarely considered these issues when selecting materials or designing class activities. The findings also showed that the participants' awareness of critical, ethical, and safe use of information and communication technologies was raised through activities for evaluating and discussing the selection of instructional materials and the lesson activities associated with them. Implications for teacher education in computer-assisted language learning are discussed.","subject":"Information Technology, Preservice Teacher Education, Technological Literacy, Copyrights, Safety, Electronic Learning, Web Based Instruction, Instructional Material Evaluation, Lesson Plans, Computer Assisted Instruction, Second Language Learning, Preservice Teachers, Reading Assignments, Foreign Countries, English Teachers","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"South Korea"},{"id":"EJ1063806","title":"The Practices and Challenges of Telecollaboration in Higher Education in Europe","author":"Helm, Francesca","description":"Telecollaboration is an area of CALL research and practice which has developed considerably in the last twenty years. Many research studies have been carried out and important findings have been made, but there has not yet been a large scale survey to try and &quot;map&quot; the state of the art in telecollaboration practice. Most studies focus on single telecollaboration projects and look at the project design, learning outcomes and difficulties teachers and researchers have encountered in that particular project. This paper reports on a survey which sought to explore current practices and attitudes towards telecollaboration across European universities and to identify barriers that practitioners encounter. The survey was completed in full by a total of 210 university language teachers in 23 different European countries and 131 students. The picture we found presents a broad spectrum of practices. Despite an overwhelmingly positive attitude towards telecollaboration, findings also provide large-scale confirmation of some of the problems identified in small-scale studies, such as organizational difficulties, lack of time, limited technical support and great uncertainty regarding issues students should address in their exchanges. The paper concludes with some recommendations as to how to meet these challenges and how telecollaboration practice could become mainstreamed in higher education.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Videoconferencing, Surveys, Educational Practices, Teacher Attitudes, Barriers, College Faculty, Language Teachers, Teaching Methods, Positive Attitudes, Time Management, Technical Support, Teacher Student Relationship, College Students, Computer Mediated Communication, Cooperative Learning, Foreign Countries, Profiles, Questionnaires, Qualitative Research, Statistical Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051718","title":"Contextualized Views of Practices and Competencies in CALL Teacher Education Research","author":"Arnold, Nike, Ducate, Lara","description":"While teachers play a central role in capitalizing on the potentials of computer assisted language learning (CALL), CALL teacher education overall still appears not to be adequate and effective (Healey et al., 2011; Hubbard, 2008). Furthermore, foreign\/second language teachers have expressed a desire for more and better professional development opportunities in that area (Beaven, Emke, Ernest, Germain-Rutherford, Hampel, Hopkins, Stanojevic &amp; Stickler, 2010; Digedu, 2014; Kessler, 2006). Given the continuing and new challenges for CALL teacher education, this special issue of &quot;Language Learning &amp; Technology&quot; on CALL teacher education further speaks to its importance for our field and ultimately our students. To advance our understanding of CALL teacher education, the main goal for this issue is to move beyond research on teacher beliefs and attitudes to investigate actual practices and competencies, especially from a longitudinal perspective, that traces teachers&apos; development. The current issue brings together a collection of articles that represents a wide variety of contexts, formats, foci, and research methods. This variety is particularly important given the highly contextualized nature of teaching and learning (Freeman &amp; Johnson, 1998) and the different needs of pre-service and in-service teachers (Beaven et al., 2010).","subject":"Teacher Education, Faculty Development, Language Teachers, Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Educational Technology, Teacher Competencies, Educational Practices","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1075830","title":"Digital Mindsets: Teachers' Technology Use in Personal Life and Teaching","author":"Tour, Ekaterina","description":"Over the last few years there have been important calls for new literacies to become an integral part of language education. Yet traditional approaches to technology continue to persist in many contexts. Although the role of teachers in this problem has been acknowledged, little is known about how teachers' everyday digital literacy practices influence teaching with technologies. Informed by Literacy Studies, the paper reports the findings from a larger qualitative study and explores the relationship between technology use in personal and professional domains of three language teachers. The study found that the participants' digital mindsets, comprising assumptions about affordances of digital technologies, shaped the ways in which the participants used digital technologies within and beyond classrooms. New literacies required creative and elaborated assumptions about affordances; however, these understandings had different significance for the participants. The article explains why teaching new literacies continues to be challenging and suggests implications for teachers' professional learning and education and language pedagogy.","subject":"Media Literacy, Technology Uses in Education, Beliefs, Language Teachers, Teaching Styles, Educational Practices, Individual Characteristics, Teacher Characteristics, Case Studies, Elementary Secondary Education, Interviews, Mass Media Use, Use Studies, Teacher Attitudes, Foreign Countries, Photography","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1051677","title":"The Evolving Roles of Language Teachers: Trained Coders, Local Researchers, Global Citizens","author":"Godwin-Jones, Robert","description":"Language teachers are working in a world which has changed in the past decades in fundamentally disruptive ways, through profound changes in the role that networked computers play in everyday life and through the social and demographic shifts brought on by an increasingly globalized society, bringing together more than ever before people from different cultures and languages in real and virtual environments. One of the byproducts of this new environment is the growth in opportunity for language learning, in particular through informal environments such as social networks and networked gaming. The challenges for training language teachers to deal with this dynamic are considerable. They will need to be able to follow new developments in technology and be able to understand their potential use in second language instruction. In this column, Robert Godwin-Jones, examines the interconnected roles that L2 (second language) teachers may need to play in order to be effective in a changing social, educational, and technological environment.","subject":"Language Teachers, Teacher Role, Computer Networks, Global Approach, Social Networks, Second Language Learning, Computer Games, Programming, Technology Uses in Education, Computer Assisted Instruction, Second Language Instruction, Educational Technology","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1075822","title":"Contributing, Creating, Curating: Digital Literacies for Language Learners","author":"Godwin-Jones, Robert","description":"In today's globalized, connected world, fixed and stable identities are increasingly uncommon. The means and modes of online communication and engagement, themselves powerful contributors to identity formation, are likewise in a constant state of flux. Participating in emerging online communities may require users to develop new skills, acquire specific software or hardware, and\/or learn particular conventions and behavior norms. In this column we will be looking at what that dynamic entails and what impact the ongoing need for new literacies and competencies has on language learning, both in formal instruction and in out-of-school environments. We will be looking at ways in which learners achieve language and literacy gains through participation in online communal spaces and how such activities relate to formal language instruction. Engaging with Internet-based communities is likely to involve the ability to interact with and to create or remix materials and resources in a variety of media and from a variety of sources. In addition to focused or incidental language learning through roles played in participatory Internet communities we will also look at the need for language learners to develop competence in searching out, evaluating, and collecting online materials, tools, and services. This includes the guiding role language teachers can play in the process. As language teachers, our ultimate goal is to enable and encourage our students to gain the knowledge, skills, and motivation to become autonomous language learners and culturally responsible participants in local and online communities. Capability in a full range of digital literacies is key to that process and vital today in education, personal life, and work environments: The growing importance of online technologies for the ways in which we work and learn in global networks has meant that today, instead of using technology simply to learn FLs [foreign languages], learners need to learn how to combine both FL skills and &quot;e-skills&quot; or &quot;new literacies&quot; to be able to work and collaborate in new contexts where the borders between the visual and the real and between the distant and the proximate are increasingly blurred (Dooly &amp; O'Dowd, 2012, p. 15). That blurring of boundaries among literacies, genres, and modes of representation is what makes this topic intriguing and challenging.","subject":"Technological Literacy, Second Language Learning, Incidental Learning, Skill Development, Communities of Practice, Literacy, Second Language Instruction, Computer Mediated Communication, Teacher Role, Language Teachers, Learning Motivation, Personal Autonomy, Cultural Awareness, Work Environment, Information Literacy","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1063813","title":"A Corpus Approach for Autonomous Teachers and Learners: Implementing an On-Line Concordancer on Teachers' Laptops","author":"Lee, Jang Ho, Lee, Hansol, Sert, Cetin","description":"The present article deals with the issue of how to create and operate a customizable on-line concordancer from viewpoints of language teachers and with their own laptops. It aims to introduce how to use and manage this application without relying on computer engineers for various pedagogical purposes, focusing on the four beneficial dimensions of its interface and technical features: accessibility, simplicity, functionality, and manageability. In addition, the carefully written directions illustrate how to implement this open-source application on laptops using pre-established or customized corpora. For those in the field of language teaching and learning, this application is designed to allow teachers to operate different types or levels of corpora in separate spaces on one server and to enable multiple simultaneous connections in classroom contexts. Ultimately, the authors believe that this application will not only allow students to actively experience data-driven learning anywhere and anytime, but also will help teachers manage their own version of this online concordancer by autonomously uploading any kinds of source texts for corpus analysis at their pedagogical discretion.","subject":"Indexes, Second Language Learning, Second Language Instruction, Computational Linguistics, Language Teachers, Internet, Teaching Methods, Laptop Computers, Vocabulary Development, Educational Benefits","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null}]