[{"id":"EJ1059236","title":"Factors Affecting the Normalization of CALL in Chinese Senior High Schools","author":"He, Bi, Puakpong, Nattaya, Lian, Andrew","description":"With the development of Information Technology, increasing attention has been paid to Computer Assisted Language Learning (CALL). Meanwhile, increasing enthusiasm is seen for English learning and teaching in China. Yet, few research studies have focused on the normalization of CALL in ethnically diverse areas. In response to this research gap, this study aims to identify major factors affecting the normalization of CALL in Chinese senior high schools in the Qian Xi'nan Buyi and Miao Autonomous Prefecture (QBMP). A questionnaire was administered to 340 English teachers and a semi-structured oral interview was conducted as a follow-up. The study produced the following four findings: (a) most teachers were in favor of using computers in English teaching although they had to be cautious in guiding students; (b) institutional support was seen as instrumental; (c) teachers' computer competency and relevant training were considered to be important; and (d) teaching methodology and learner factors were identified as crucial.","subject":"Foreign Countries, Computer Assisted Instruction, Second Language Instruction, English (Second Language), High Schools, English Teachers, Secondary School Teachers, Questionnaires, Semi Structured Interviews, Teacher Attitudes, Computer Attitudes, Computer Literacy, Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"China"},{"id":"EJ1047685","title":"University Teachers' Perceptions of Online Informal Learning of English (OILE)","author":"Toffoli, Denyze, Sockett, Geoff","description":"Online Informal Learning of English (OILE) involves the many different types of language practices that non-specialist EFL students of English are involved in on the Internet. This article reviews previous studies in the area and summarises the specific outcomes that OILE is thought to produce. It then presents an analysis of a survey of teachers' cognitions concerning OILE from a sample of 30 professors of English working in French universities. It analyses survey data in various manners, offering insight into teachers' awareness of the OILE phenomenon amongst students, the perceived or imagined effects of these practices on their students' English and the ways they do or do not integrate these cognitions into their own teaching. Results indicate that many professors are aware of the types of input that their learners may be exposed to, but that they know little of the specifics and few make use of this knowledge in their English courses. In the discussion some questions are raised as to future forms for English language teaching to specialists of other disciplines.","subject":"Online Courses, Teacher Attitudes, Informal Education, English (Second Language), Second Language Learning, Surveys, Schemata (Cognition), College Faculty, Foreign Countries, Second Language Instruction, Futures (of Society), Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1051461","title":"Developing a Multimedia Instrument for Technical Vocabulary Learning: A Case of EFL Undergraduate Physics Education","author":"Rusanganwa, Joseph Appolinary","description":"The aim of the present study is to investigate the process of constructing a Multimedia Assisted Vocabulary Learning (MAVL) instrument at a university in Rwanda in 2009. The instrument is used in a one-computer classroom where students were taught in a foreign language and had little access to books. It consists of video clips featuring images, sound and text intended to facilitate learning and retention of technical vocabulary in a first-year electricity course. The construction takes theories of social constructivism and learning with multimedia as its point of departure. In response to the need for knowledge of scientific vocabulary, the researcher collaborated with a group of 82 students and their two teachers to select and encode 81 video clips of technical terminology. The gains from the process of constructing the instrument enabled collaborative and interdisciplinary learning and showed the potential to facilitate technical vocabulary acquisition.","subject":"Vocabulary Development, Second Language Learning, Multimedia Materials, Video Technology, Interdisciplinary Approach, Foreign Countries, Physics, English (Second Language), Energy, Introductory Courses, Cooperative Learning, Constructivism (Learning), Learning Theories, Undergraduate Students, Computer Assisted Instruction","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Rwanda"},{"id":"EJ1047670","title":"Promoting Different Reading Comprehension Levels through Online Annotations","author":"Tseng, Sheng-Shiang, Yeh, Hui-Chin, Yang, Shih-hsien","description":"Previous studies have evaluated reading comprehension as the general understanding of reading texts. However, this broad and generic assessment of reading comprehension overlooks the specific aspects and processes that students need to develop. This study adopted Kintsch's Construction-Integration model to tap into reading comprehension at different levels and investigated how English as a foreign language (EFL) students benefit from online annotations to scaffold reading comprehension. Fifty EFL students participated in this study and the data collected included (1) the pre- and post-test assessments in reading comprehension levels, (2) the students' online annotations on reading texts, and (3) the discussion transcripts from an online discussion forum. The results from the first two data sources (1 and 2) were the data-sets used to investigate the influence of the annotation types on reading comprehension levels. The third data source was the data-set used to probe into the process of how students benefited from annotation types to reach different levels of reading comprehension. Four types of online annotations were frequently used by the students while reading online, including (1) marking vocabulary, (2) adding Chinese explanatory notes to unknown vocabulary, (3) marking text information, and (4) adding summary notes to each paragraph. Different frequencies of using the four types of online annotations resulted in three different comprehension levels: surface-based, text-based, and situation-based levels. Marking vocabulary and adding Chinese explanatory notes helped scaffold the students' learning to achieve surface comprehension levels to facilitate recognition and meaning of unknown vocabulary. Marking text information and in particular, the adding of summary notes to each paragraph were the core annotations that helped students comprehend the online text in text-based and situation-based levels. EFL teachers can guide students to use online annotations to different extents in order to deepen their reading comprehension.","subject":"Reading Comprehension, Reading Instruction, Scaffolding (Teaching Technique), Documentation, English (Second Language), Second Language Instruction, College Freshmen, Pretests Posttests, Discussion, Vocabulary, Notetaking, Computer Uses in Education, Reading Improvement, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1080781","title":"Type of Instructional Delivery and Second Language Teacher Candidate Performance: Online versus Face-to-Face","author":"Kissau, Scott","description":"Research conducted over the past decade has consistently reported no significant differences in learning outcomes for students of fully online or face-to-face (F2F) instruction. Only a small number of these studies, however, have focused on courses in second language (L2) teacher preparation programs. Even fewer studies have compared the impact of online and F2F instruction on classroom practice. To fill this void in the research, an investigation was conducted of the impact of method of instructional delivery on the performance of teacher candidates in a Teaching English as a Second Language (TESL) program during their culminating student teaching internship. Focusing on a group of TESL interns who completed either online or F2F methodology training, a mixed methodology was used to compare student teacher outcomes on two key performance assessments and to compare university supervisor perceptions of student teacher performance. While the type of instructional setting was not found to significantly impact the teaching performance of the interns, interview data suggested that support from a cooperating teacher and prior experience working with students of diverse language and cultural backgrounds strongly influenced the teacher candidates' instructional practices.","subject":"English (Second Language), Second Language Learning, Second Language Instruction, Cooperating Teachers, Student Teachers, Mixed Methods Research, Internship Programs, Comparative Analysis, Supervisors, Online Courses, Prior Learning, Teacher Attitudes, Conventional Instruction, Cultural Differences, Cultural Background, Teaching Methods, College Faculty, Language Teachers, Meta Analysis, Teacher Education, Graduate Students, Semi Structured Interviews, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1080778","title":"Facilitating Metacognitive Processes of Academic Genre-Based Writing Using an Online Writing System","author":"Yeh, Hui-Chin","description":"Few studies have investigated how metacognitive processes foster the application of genre knowledge to students' academic writing. This is largely due to its internal and unobservable characteristics. To bridge this gap, an online writing system based on metacognition, involving the stages of planning, monitoring, evaluating, and revising, was developed to investigate how such a system contributed to the understanding and application of genre knowledge to students' academic writing. The data included three different versions of each student's written research proposal, action logs, discussion transcripts in discussion forums, and an open-ended questionnaire. Descriptive statistics, a typical case sampling, and the constant comparison method were used to analyze the data. The results suggested that the students made greater improvements in academic writing performance after experiencing metacognitive processes. Particularly, collaborative efforts throughout the metacognitive processes were important in supporting students to understand the academic genre, recognize the problems of unstructured academic papers, and apply genre knowledge to academic writing. The online writing system features, designed to nurture students' metacognitive processes, served as useful cognitive stimuli to raise students' metacognitive awareness. The system's functions overcame the limitations of observing students' metacognitive processes described in previous studies, and enabled teachers to provide follow-up instruction. Implications and recommendations are also addressed.","subject":"Metacognition, Statistical Analysis, Academic Discourse, Sampling, Questionnaires, Writing Instruction, Computer Assisted Instruction, Writing Processes, Writing Improvement, Teaching Methods, Cooperative Learning, Graduate Students, Foreign Countries, Computer Software, Second Language Learning, Second Language Instruction, English for Academic Purposes","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077787","title":"Design Considerations of Help Options in Computer-Based L2 Listening Materials Informed by Participatory Design","author":"Cárdenas-Claros, Mónica Stella","description":"This paper reports on the findings of two qualitative exploratory studies that sought to investigate design features of help options in computer-based L2 listening materials. Informed by principles of participatory design, language learners, software designers, language teachers, and a computer programmer worked collaboratively in a series of design sessions. The participants first evaluated researcher-generated prototypes, designed prototypes for two language proficiencies (beginner and upper intermediate) and iterated designs on both paper and screen. Analysis of the reworked prototypes resulted in five features of help option design: type, location, sequence, click-through, and display. Analyses of the interaction data showed that consensually the participants favored help options that are easy to use, promote learner control, support guidance, and stimulate learning.","subject":"Second Language Learning, Qualitative Research, Listening Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Materials, Language Teachers, Programming, Language Proficiency, Material Development, Usability, Interaction, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"}]