[{"id":"EJ1143783","title":"Giving and Receiving Advice in Computer-Mediated Peer Response Activities","author":"Tsai, Mei-Hsing, Kinginger, Celeste","description":"In synchronous computer-mediated contexts, peer-to-peer interaction at the microlevel has received little scrutiny. In applying a conversation analysis approach, this study scrutinizes the precise nature of peer-to-peer advice giving and receiving. In this process, an advice giver can be viewed at certain moments as more competent to evaluate a recipient's essay and to provide advice, while the recipient can be positioned as being less knowledgeable. Therefore, the present study focuses on the following research question: How did advice givers and recipients manage the asymmetrical participant roles inherent in L2 peer response? More specifically, this study explores the relationship between institutional roles and social relationships during advising episodes by investigating three single cases of dyadic pairs in an ESL university writing classroom. We show the ambiguity arising in interactions as novice advice givers attempt to balance criticism with the maintenance of harmonious interpersonal relationships, offering compliments rather than straightforward advice.","subject":"College Students, Computer Mediated Communication, Synchronous Communication, Second Language Learning, English Language Learners, Asians, Peer Evaluation, Guidance, Novices, Writing Evaluation, Help Seeking","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143739","title":"Sustaining Multimodal Language Learner Interactions Online","author":"Satar, H. Müge","description":"Social presence is considered an important quality in computer-mediated communication as it promotes willingness in learners to take risks through participation in interpersonal exchanges (Kehrwald, 2008) and makes communication more natural (Lowenthal, 2010). While social presence has mostly been investigated through questionnaire data and quantitative content analysis of online interactions based on a set of predefined indicators, in a smaller number of studies the concept has also been investigated through qualitative analysis of interviews (Kehrwald, 2008, 2010). Yet studies that bring together multiple sources of data collection and examine multimodal language learning contexts are almost non-existent. In this paper, the theory of social presence is employed to explicate language learners' online multimodal communication using a case study approach. Multiple sources of data were collected, including interviews, open-ended and closed post-task questionnaires, stimulated reflection and recordings of video interactions. The main findings of the study included an innovative social presence framework developed for the analysis of online multimodal language learner interactions (Satar, 2010), which can be used in further qualitative and exploratory research. It also has potential applicability for educators to develop strategies for language learners to guide them in creating and transmitting their social presence. The focus of this article is a cross-case analysis for one of the components of social presence, sustaining interaction, bringing together social presence theory, interactional sociolinguistics and multimodal interaction analysis. Finally, strategies are proposed for language learners on how to sustain their online multimodal interactions.","subject":"Learning Modalities, Online Courses, Computer Mediated Communication, Computer Assisted Instruction, Educational Technology, Interpersonal Communication, Interviews, Questionnaires, Reflection, Video Technology, Videoconferencing, Interaction, English (Second Language), Second Language Learning, Late Adolescents, Young Adults, Preservice Teachers, Foreign Countries, Case Studies, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1143785","title":"Conversation Analysis in Computer-Assisted Language Learning","author":"González-Lloret, Marta","description":"The use of Conversation Analysis (CA) in the study of technology-mediated interactions is a recent methodological addition to qualitative research in the field of Computer-assisted Language Learning (CALL). The expansion of CA in Second Language Acquisition research, coupled with the need for qualitative techniques to explore how people interact in technology-mediated environments, has stimulated a small but growing body of research. This article reviews CALL research that employed a CA approach to the collection, microanalysis, and understanding of the data in a variety of technology-mediated fields (text, audio and video SCMC, email, forums and bulletin boards, social networks, and games), with participants from different contexts and languages, interacting in an L2 either among themselves or with native\/more expert speakers of the language. Most research up to now has been descriptive in nature, illustrating the sequential organization of interaction, interactional and linguistic resources employed by the participants, and affordances and challenges of the media to promote language learning. In addition, a few studies have directly explored &quot;learning&quot; through the microanalysis of longitudinal data for any changes in the learners' linguistic and interactional patterns of engagement. The review of studies is followed by those challenges that affect the implementation of CA in CALL research and a vision of the future of CA for CALL in the larger field of Applied Linguistics.","subject":"Discourse Analysis, Computer Mediated Communication, Computer Assisted Instruction, Second Language Instruction, Second Language Learning, Qualitative Research, Data Analysis, Program Implementation, Educational Research, Applied Linguistics, Sequential Approach, Affordances, Longitudinal Studies, Concept Formation","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143614","title":"It Takes Research to Build a Community: Ongoing Challenges for Scholars in Digitally-Supported Communicative Language Teaching","author":"Dooly, Melinda","description":"This article provides an argument for closer multilateral alliances between the emergent and loosely-bound international community of educational researchers who are working in areas related to Digitally Supported Communicative Language Teaching and learning (herein DSCLT). By taking advantage of the communications revolution that is currently reshaping the world, internationally aligned investigators can foster new knowledge, technology, and practices that develop improved teaching strategies and policies appropriate to our rapidly changing times. Beginning with a brief overview of the impact that technology has had on education and post-2000 nascent research areas related to DSCLT, this article goes on to examine whether or not the impact of research is geographically bound, and if so, how transnational alliances can be useful in bridging gaps in the continuum of knowledge-building. Finally, the potential gains that could stem from an enhanced collaboration between international research communities are examined, although admittedly such endeavors are not without challenges.","subject":"Educational Technology, Technology Uses in Education, Communication Skills, Geographic Location, International Cooperation, Computer Mediated Communication, Educational Research, Second Language Instruction, Telecommunications, Handheld Devices, Internet, Social Media, Communities of Practice","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143730","title":"Using Netnography to Explore the Culture of Online Language Teaching Communities","author":"Kulavuz-Onal, Derya","description":"Netnography (Kozinets, 2010) is an ethnographic approach to study communities that exist primarily online. Engaging in online participant observation, the netnographer connects to the online community through a computer screen, and the field is located inside the screen. Although it has been used in marketing research extensively, netnography is a relatively new methodology in educational research. In this paper, I give an overview of netnography and its applicability in studying online language teaching communities. Drawing upon a netnography of a globally-distributed online community of practice of English language teachers, Webheads in Action, I provide detailed accounts of my experiences during data collection and particular methodological considerations in netnography in order to shed light on the often untold aspects of an ethnographic design in online research that involves participant observation. I conclude with a discussion of possible benefits of a participant observer approach in netnography in understanding the culture of online language teaching communities, and invite CALL researchers to consider netnography and online participant observation in their future studies.","subject":"Second Language Learning, Computer Assisted Instruction, Web Based Instruction, Ethnography, Communities of Practice, Participant Observation, Research Methodology, Educational Research, Language Teachers, English Language Learners, Data Collection, Research Design, Educational Benefits, Computer Mediated Communication, Web 2.0 Technologies, Field Studies, Notetaking, Interviews, Archives","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143615","title":"Eye Movements of Online Chinese Learners","author":"Stickler, Ursula, Shi, Lijing","description":"Although online tutorials are becoming commonplace for language teaching, very few studies to date have provided insights into learners' behaviours in synchronous online interactions from their own perspective. This study employs eyetracking technology to investigate ten learners' attention during synchronous online language learning in a multimodal environment. The participants were learners of Chinese as a Foreign Language at beginner's or lower-intermediate level. While learners took part in two different online activities, one focusing on reading, the other on interaction with others, their gaze focus was tracked, and in subsequent stimulated recall interviews the learners reflected on their engagement with the screen and their intentions while reading or speaking online. Our findings show that during reading tasks, when Pinyin transcriptions as well as Chinese characters were presented, all beginner and lower intermediate participants focused to some degree on the Pinyin. In the interactive task learners' gaze was drawn to elements of the screen that were not immediately necessary for technical or linguistic reasons but that could be interpreted as containing social presence information, e.g. names listed and emoticons employed by other users.","subject":"Eye Movements, Attention, Online Courses, Educational Technology, Technology Uses in Education, Interaction, Learning Activities, Interviews, Recall (Psychology), Learner Engagement, Intention, Reading, Chinese, Second Language Learning, Computer Mediated Communication, Synchronous Communication, Adult Learning, Teleconferencing, Questionnaires, Measurement Equipment, Foreign Countries","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"United Kingdom"},{"id":"EJ1176700","title":"The More Things Change, the More They Stay the Same, or Do They? Revisiting Classroom Interaction Approaches and Their Effects on Quantity and Characteristics of Language Production","author":"Jones, Linda C., Murphy, Cheryl A., Holland, Amalie","description":"This study investigated the quantity and characteristics of student language production, discourse functions, and morphosyntactic features in three different discourse settings--face-to-face (F2F), lab-setting chatroom interactions (Lab), and any place\/any device chatroom interactions (APAD). Discourse was examined through the replication and extension of Richard Kern's (1995) study. Similarities in findings between the two studies included a continuation of incomplete, and short sentence lengths among F2F students, an absence of F2F greetings, and a higher rate of assertions, verb tenses, and simple sentences in the Lab setting. Differences included a higher rate of F2F turns in the current study, an absence of greetings in the lab setting, and a greater number of commands among F2F participants. Findings underscored what Kern previously asserted: that F2F and chatroom settings tend to encourage and support slightly different goals associated with language discourse. Kern stated that more sophisticated conversation occurred in the chatroom setting. Current findings concurred but furthered that more conversational interaction took place within the F2F discourse setting due to a greater number of commands, turns, and incomplete sentences. Similarly, F2F students experienced greater input due to the increase of words heard, questions asked, and commands made.","subject":"Interaction, Synchronous Communication, Statistical Analysis, Language Acquisition, Computer Mediated Communication, Comparative Analysis, Second Language Learning, Second Language Instruction, English (Second Language), Handheld Devices, French, Intervention, Student Surveys, College Students, Statistical Significance","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143738","title":"Reflexive Photography, Attitudes, Behavior, and CALL: ITAs Improving Spoken English Intelligibility","author":"Wallace, Lara","description":"Research in the field of Computer-Assisted Language Learning (CALL) has frequently taken a top-down approach when investigating learners' attitudes and behavior, both in the course as well as for their personal use. Suggestions are given for use of technology, and future research (Beatty, 2010; Levy &amp; Stockwell, 2006). One perspective that has not been examined in CALL is Reflexive Photography, a method that lends itself to rigorous and focused analysis and can illuminate the participants' experiences and perceptions in a way that the above methods cannot. In reflexive photography, participants are asked to photograph their experience of the phenomenon in question. These photographs serve as the basis for the discussion with the researcher that follows, and help to define the scope of the particular phenomenon. Together, the participants and the researcher co-produce the information regarding the phenomenon (Jenkings, Woodward &amp; Winter, 2008). Reflexive photography has been used to explore issues of identity and experience in other fields, although in CALL, it has been underutilized. The present study identified current uses of technology among International Teaching Assistants (ITAs) taking a course to improve their spoken English intelligibility. Midway through the term, learners photographed what they deemed to be helpful and what they felt obstructed the improvement of their oral English production. They then shared seven to ten photographs in a focus group of peers. At the end of the term, the researcher interviewed the learners regarding these experiences. The photos and the interviews were coded and the researcher examined the emergent findings, using observations and electronic communication from throughout the term to triangulate and support the data. The findings revealed valuable insights through the eyes of the learners regarding what technology the learners found to be helpful and\/or obstructive, both in the course as well as for their personal use, and suggestions for improvements in use of technology are given. Finally, future research directions in CALL using reflexive photography are discussed.","subject":"Computer Assisted Instruction, English (Second Language), Second Language Instruction, Educational Technology, Photography, Reflection, Teaching Assistants, Foreign Students, Graduate Students, Phenomenology, Student Attitudes, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null}]