[{"id":"EJ1051720","title":"ESL Teacher Training in 3D Virtual Worlds","author":"Kozlova, Iryna, Priven, Dmitri","description":"Although language learning in 3D Virtual Worlds (VWs) has become a focus of recent research, little is known about the knowledge and skills teachers need to acquire to provide effective task-based instruction in 3D VWs and the type of teacher training that best prepares instructors for such an endeavor. This study employs a situated learning approach to teacher training and explores what online teaching skills emerge in the process of collaborative situated learning, how these skills develop, and whether collaborative situated learning is an effective method of training instructors to teach in 3D VWs. Six English as a second language (ESL) teacher trainees enrolled in the Teaching English as a Second\/Foreign Language (TES\/FL) program participated in the study. During the preteaching stage, teacher trainees developed language tasks to implement during the teaching stage with eight EFL students in 3D VWs. Blackboard wikis used for designing tasks allowed for observing the acquisition of five 3D-specific, integrated skills. The analysis of teaching sessions recorded through screen capturing software Camtasia Relay in conjunction with the teacher trainees' wikis and journals demonstrates that for this group of teachers, a situated learning approach was an effective method of teacher training.","subject":"English (Second Language), Second Language Instruction, Language Teachers, Teacher Education, Educational Technology, Virtual Classrooms, Online Courses, Teaching Skills, Cooperative Learning, Skill Development, Preservice Teachers, Technology Uses in Education, Computer Software, Web Sites, Web 2.0 Technologies, Context Effect, Foreign Countries, Teaching Methods, Qualitative Research, Content Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Canada, Turkey"},{"id":"EJ1075830","title":"Digital Mindsets: Teachers' Technology Use in Personal Life and Teaching","author":"Tour, Ekaterina","description":"Over the last few years there have been important calls for new literacies to become an integral part of language education. Yet traditional approaches to technology continue to persist in many contexts. Although the role of teachers in this problem has been acknowledged, little is known about how teachers' everyday digital literacy practices influence teaching with technologies. Informed by Literacy Studies, the paper reports the findings from a larger qualitative study and explores the relationship between technology use in personal and professional domains of three language teachers. The study found that the participants' digital mindsets, comprising assumptions about affordances of digital technologies, shaped the ways in which the participants used digital technologies within and beyond classrooms. New literacies required creative and elaborated assumptions about affordances; however, these understandings had different significance for the participants. The article explains why teaching new literacies continues to be challenging and suggests implications for teachers' professional learning and education and language pedagogy.","subject":"Media Literacy, Technology Uses in Education, Beliefs, Language Teachers, Teaching Styles, Educational Practices, Individual Characteristics, Teacher Characteristics, Case Studies, Elementary Secondary Education, Interviews, Mass Media Use, Use Studies, Teacher Attitudes, Foreign Countries, Photography","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1063815","title":"Contextual EFL Learning in a 3D Virtual Environment","author":"Lan, Yu-Ju","description":"The purposes of the current study are to develop virtually immersive EFL learning contexts for EFL learners in Taiwan to pre- and review English materials beyond the regular English class schedule. A 2-iteration action research lasting for one semester was conducted to evaluate the effects of virtual contexts on learners' EFL learning. 132 elementary school students participated in this study. Both qualitative and quantitative data, including observation and English learning performances, were collected and analyzed. The positive results obtained from the study approved that the usage of virtual contexts in EFL learning could (1) provide students with learning opportunities without the time and space limits, (2) provide students with a game-liked scenario for English learning, and (3) enhance learners' EFL performances. The learning mode proposed and experiences gained in the current study not only serve as a practical reference to diverse foreign language educational occasions but also add to the knowledge pool of foreign language learning and teaching in virtual worlds.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Second Language Instruction, Computer Simulation, Computer Assisted Instruction, Action Research, Observation, Elementary School Students, Language Tests, Teaching Methods, Problem Solving","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051671","title":"Rethinking Transfer: Learning from CALL Teacher Education as Consequential Transition","author":"Chao, Chin-chi","description":"Behind CALL teacher education (CTE) there is an unproblematized consensus of transfer, which suggests a positivist and tool-centered view of learning gains that differs from the sociocultural focus of recent teacher education research. Drawing on Beach's (2003) conceptualization of transfer as &quot;consequential transition,&quot; this qualitative study seeks a cross-contextual understanding of language teacher learning with digital technology as the teachers in this study moved from a CTE course back to their own teaching contexts. Near the end of a CTE course, 19 in-service language teachers were asked to build connections between their experiences in the course and their teaching by creating a presentation. Four types of connections were identified, including thoughtful action planning, past experience refinement, and limited and reluctant use. In-depth interviews eight months later with four of the teachers found that they could seldom use the tools in the ways they had planned. However, they each experienced consequential transition as they struggled to reflect on their CTE course experience in everyday teaching. These results challenge the view that transfer in CTE must be about using technology. It is suggested that a focus on critical reflection of technology use may encourage teachers to continue reflective engagement in the ever-changing and complicated digital learning and teaching context.","subject":"Language Teachers, Teacher Education Programs, Praxis, Theory Practice Relationship, Transfer of Training, Interviews, Followup Studies, Graduate Surveys, Technology Uses in Education, Achievement Gains, Sociocultural Patterns, Pedagogical Content Knowledge, Educational Practices, Learning Experience, Multimedia Instruction, Multimedia Materials, English (Second Language), Second Language Instruction, Inservice Teacher Education, Graduate Students, Comparative Analysis, Semi Structured Interviews, Transcripts (Written Records), Technological Literacy, Technology Education, Teaching Methods, Teaching Skills, Foreign Countries, Educational Technology, Qualitative Research, Computer Assisted Instruction","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063800","title":"Facilitating Participation: Teacher Roles in a Multiuser Virtual Learning Environment","author":"Wang, Airong","description":"This paper reports on a task-based language teaching course in Second Life. The data set consists of transcribed recordings and a teacher interview. Focusing on how the teacher facilitated student participation, this paper aims to explore the discourse functions in the teacher language output and then to address the teacher roles in three different task phases. All the turns produced by the teacher and the students were counted, the teacher language output in the recordings was classified into 19 discourse function categories, and then all the discourse functions were classified into six teacher roles. The results show that the during-task phase was student output oriented. This study reveals that in the pre-task phase the teacher used the largest number of types and tokens of discourse functions, and played a significant technical and social role. In the during-task phase, the teacher focused on motivating students to participate, monitoring student activities, and providing task support. In the post-task phase, the teacher was a language guide. While the teacher roles that were most prominent varied in the three task phases, the teacher was found to play four roles consistently in the three task phases: monitor role, motivator role, language guide role, and social role.","subject":"Virtual Classrooms, Teacher Role, Student Participation, Discourse Analysis, Undergraduate Students, Business English, Second Language Instruction, English (Second Language), College Faculty, Interviews, English Teachers, Foreign Countries","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Sweden"},{"id":"EJ1051723","title":"Learning to Identify and Actualize Affordances in a New Tool","author":"Haines, Karen J.","description":"Keeping abreast of new technologies and the opportunities they offer is a challenge for inservice teachers (Blake, 2008; Egbert, Akasha, Huff, &amp; Lee, 2011; Hanson-Smith, 2006; Hubbard, 2007; Robb, 2006). An important aspect of teacher learning about the use of technology is the ability to identify the affordances of new tools and how they can support learning in the language classroom (Hampel &amp; Stickler, 2005; Kessler, 2010). This fourteen-month-long longitudinal study of the learning of two experienced foreign language teachers working together describes how their perceptions of the affordances of two computer-mediated communication (CMC) tools developed over time. Interview data collected over three semesters demonstrated how teachers' perceptions of affordance evolve through classroom practice with technology, and how such perceptions might be transferred to the use of a new tool. As well, although the two teachers used the same tools (blogs and wikis) in the same courses and, at times, with the same classes, they perceived different learning affordances in relation to the language learning processes they prioritized. The article will conclude with suggestions for ways in which a better understanding of affordance in teacher knowledge development has implications for the support of in-service language teachers' learning.","subject":"Educational Technology, Longitudinal Studies, Second Language Instruction, Language Teachers, Computer Mediated Communication, Teacher Attitudes, Teaching Methods, Second Language Learning, Electronic Publishing, Web Sites, Case Studies, Interviews, Italian, Foreign Countries, College Faculty, Adult Students","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1051684","title":"Promoting Pre-Service Teachers' Reflections through a Cross-Cultural Keypal Project","author":"Wach, Aleksandra","description":"This paper reports the results of an action research-based study that investigated participants' reflections on EFL learning and teaching in a computer-mediated communication (CMC)-based project. Forty pre-service teachers from two universities, in Poland and in Romania, exchanged emails on class-related topics; the email exchange was followed by a project evaluation questionnaire. E-mail entries and quantitative and qualitative findings from the questionnaire were analysed to evaluate the effects of participating in the keypal project on stimulating participants' reflections. Results point to considerable potential for the collaborative project as a means of evoking reflections on participants' knowledge, experience and practice. The investigation also highlighted the very positive perceptions of the participants about the value of the project for their professional training.","subject":"Action Research, English (Second Language), Second Language Instruction, Second Language Learning, Computer Assisted Instruction, Preservice Teachers, Electronic Mail, Program Evaluation, Questionnaires, Reflection, Teacher Education, Computer Mediated Communication, Cooperation, Cross Cultural Training, Foreign Countries","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Poland, Romania"},{"id":"EJ1063742","title":"The Accuracy of Computer-Assisted Feedback and Students' Responses to It","author":"Lavolette, Elizabeth, Polio, Charlene, Kahng, Jimin","description":"Various researchers in second language acquisition have argued for the effectiveness of immediate rather than delayed feedback. In writing, truly immediate feedback is impractical, but computer-assisted feedback provides a quick way of providing feedback that also reduces the teacher's workload. We explored the accuracy of feedback from Criterion®, a program developed by Educational Testing Service, and students' responses to it. Thirty-two students received feedback from Criterion on four essays throughout a semester, with 16 receiving the feedback immediately and 16 receiving it several days after writing their essays. Results indicated that 75% of the error codes were correct, but that Criterion missed many language errors. Students responded to the correct error codes 73% of the time and responded to more of the codes over the course of the semester, while the condition--delayed versus immediate--did not affect their response rates nor their accuracy on the first drafts. Although we cannot support claims that immediate feedback may be more helpful, we believe that, with proper training, Criterion can help students correct certain aspects of language.","subject":"Second Language Learning, Second Language Instruction, Computer Assisted Instruction, Accuracy, Feedback (Response), Student Attitudes, Teaching Methods, Essays, Error Correction, Writing Instruction, Faculty Workload, Computer Software, Instructional Effectiveness, Academic Discourse, English (Second Language), Language Tests, College Students, Foreign Students, Revision (Written Composition)","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1075828","title":"Using Facebook to Promote Korean EFL Learners' Intercultural Competence","author":"Jin, Seunghee","description":"Foreign language learners often have limited opportunity to interact with people from the target culture and develop their intercultural competence (IC) through those interactions both inside and outside of the classroom. To identify a new opportunity to engage Korean EFL learners in innovative ways to maximize target language interactions and develop their IC, this study adopts Facebook as a new computer-mediated communication (CMC) tool in a university classroom-based telecollaborative project between the U.S. and South Korea. The results revealed that Facebook offers Korean EFL learners an effective platform for intercultural interactions with people from the target culture, and Korean EFL learners demonstrate the abilities of the overall components of IC by showing many instances that fall well within Byram's (2000) assessment criteria, although some conflicting results exist. This study suggests that the adoption of Facebook is a new, innovative, and practical way to facilitate effective intercultural interactions as well as promote IC in the EFL classroom.","subject":"Social Networks, Technology Uses in Education, Intercultural Communication, Cultural Awareness, English (Second Language), Second Language Learning, Foreign Countries, College Students, Telecommunications, Intercultural Programs, Teaching Methods, Instructional Effectiveness, Participant Observation, Ethnography, Qualitative Research, Interviews, Content Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"South Korea, United States"},{"id":"EJ1075831","title":"The Intersection of Multimodality and Critical Perspective: Multimodality as Subversion","author":"Huang, Shin-ying","description":"This study explores the relevance of multimodality to critical media literacy. It is based on the understanding that communication is intrinsically multimodal and multimodal communication is inherently social and ideological. By analysing two English-language learners' multimodal ensembles, the study reports on how multimodality contributes to a critical perspective when engaging with media texts, and on the ways in which learners orchestrate multiple semiotic resources to demonstrate their analysis of the politics of representation and the resulting consequences. The findings reveal that, on the one hand, the students were able to identify the power relations between characters as well as how particular characters are marginalized in the media texts they viewed by paying attention to the multiple modes that make up the text's representation. On the other hand, the students were able to articulate the ideological subtexts they identified through the orchestration of various modes rather than relying on the linguistic mode, making their message as persuasive and effective as those in the media texts viewed.","subject":"Media Literacy, English (Second Language), Second Language Learning, Power Structure, Semiotics, Films, Teaching Methods, Racial Relations, Gender Differences, Interpersonal Relationship, College Students, Second Language Instruction, Critical Literacy, Foreign Countries, Qualitative Research, Focus Groups, Interviews","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1075815","title":"&quot;I Am What I Am&quot;: Multilingual Identity and Digital Translanguaging","author":"Schreiber, Brooke Ricker","description":"This paper presents a case study of the multilingual writing practices of a Serbian university student on Facebook, examining how he uses multiple varieties of English and Serbian images and video to shape his online identity and establish membership in local and global communities. Drawing on data from stimulated-recall interviews, online participant observation, and rhetorical analysis, this study shows how Aleksandar, a hip-hop artist, appropriates hip-hop codes and employs the &quot;gate-keeping&quot; function of posting links (Baek, Holton, Harp, &amp; Yaschur, 2011) by embedding links to music videos in his own highly personal code-mixed text in order to establish himself as a distinctly Serbian member of the global hip-hop community. The findings suggest that Aleksandar's language practices and attitudes might be better understood as translingual (Canagarajah, 2011), as the student integrates diverse linguistic and semiotic resources into a unified expression of identity, relying on the multimodal affordances of digital writing to accomplish his communicative goals. However, these sophisticated textual practices go undervalued in his EFL writing courses, where formal, monolingual, non-digital literacy remains primary (Saxena, 2011). These findings suggest a need to re-evaluate what it means to have a second language-mediated identity, and to expand the focus of EFL writing pedagogy.","subject":"Multilingualism, Code Switching (Language), Music, Language Usage, Language Attitudes, Video Technology, Case Studies, Participant Observation, Writing (Composition), Recall (Psychology), Semiotics, English (Second Language), Writing Instruction, Technological Literacy, Second Language Learning, Self Concept, Teaching Methods, Social Networks, Foreign Countries, Serbocroatian, College Students, Semi Structured Interviews, Qualitative Research","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Serbia"},{"id":"EJ1063777","title":"A Meta-Synthesis of Empirical Research on the Effectiveness of Computer-Mediated Communication (CMC) in SLA","author":"Lin, Huifen","description":"This meta-analysis reports the results of a systematic synthesis of primary studies on the effectiveness of computer-mediated communication (CMC) in second language acquisition (SLA) for the period 2000-2012. By extracting information on 21 features from each primary study, this meta-analysis intends to summarize the CMC research literature for the past decade by calculating an average effect size and performing a series of moderator analyses to factor out elements that might mediate the effect of such media in SLA. In total, 59 studies were identified as eligible after excluding three outlier studies, covering both published and unpublished studies. All studies were coded for learner characteristics (5 features), methodological characteristics (14 features) and publication characteristics (2 features), six of which were further analyzed as moderator variables. The results show that (a) there was a positive and medium overall effect for CMC used for instructional\/learning purposes in SLA, (b) among the four language skills which CMC was intended to facilitate, writing skills produced the largest effect size, as did pragmatic competence, among the three language components, i.e. pragmatics, vocabulary and pronunciation explored in this meta-analysis; however this result should be interpreted as tentative since only one study measured pragmatic competence in the current meta-analysis, and (c) smaller group studies produced a larger effect size than those using larger groups or no grouping. [See the earlier study from this research project: &quot;Establishing an Empirical Link between Computer-Mediated Communication (CMC) and SLA: A Meta-Analysis of the Research,&quot; v18 n3 p120-147 Oct 2014 in ERIC at EJ1046538.]","subject":"Computer Mediated Communication, Second Language Learning, Meta Analysis, Effect Size, English (Second Language), Pragmatics, Communicative Competence (Languages), Vocabulary Development, Pronunciation, Teaching Methods, Writing Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Effectiveness, Foreign Countries, Statistical Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063743","title":"Negotiation of Meaning to Comprehend Hypertexts through Peer Questioning","author":"Yang, Yu-Fen, Hsieh, Pei-Yin","description":"Many college students who study English as a Foreign Language (EFL) are less-proficient readers as they have few opportunities to negotiate their perspectives for creating meaning through peer questioning in onsite instruction. This study reports on using online peer questioning to enhance less-proficient college students' negotiation of meaning in comprehending texts. A sample of 50 college students was divided into two groups based on the pre-test, into a more-proficient group and a less-proficient group, with 25 students in each group. The results of this study reveal that the less-proficient students made greater progress in reading comprehension than the more-proficient students after using the strategy of online peer questioning. The less-proficient students were able to explicitly observe how the more-proficient peers used integration questions, agreed or disagreed with peer responses, and finally constructed new understandings of the hypertexts. Particularly, the less-proficient students learned from the more-proficient peers on how to engage in critical thinking to express and share multiple perspectives. Using online peer questioning, both the more-and the less-proficient students frequently engaged in negotiation of meaning, interaction, and teaching one another. Their reading progress was reflected in the post-test, the types of questions and responses, and their perceptions toward using online peer questioning.","subject":"English (Second Language), College Students, Reading Comprehension, Language Proficiency, Blended Learning, Cooperative Learning, Questioning Techniques, Group Discussion, Pretests Posttests, Hypermedia, Statistical Analysis, Computer Mediated Communication, Foreign Countries, Qualitative Research, Semi Structured Interviews","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051673","title":"Teaching Critical, Ethical and Safe Use of ICT in Pre-Service Teacher Education","author":"Shin, Sang-Keun","description":"This paper describes two studies that examined the awareness of pre-service English teachers regarding issues of digital literacy, fair use of digital materials, and e-safety. The participants in Study One designed reading and listening lessons utilizing online materials and then evaluated their lessons in terms of digital literacy and fair use. The participants in Study Two designed writing lessons based on social network services or online environments and evaluated the resulting lessons in terms of e-safety. This article reports on how these activities influenced selection criteria for online materials, methods for gathering instructional materials, and lesson plans. The results indicated that, initially, the pre-service teachers rarely considered these issues when selecting materials or designing class activities. The findings also showed that the participants' awareness of critical, ethical, and safe use of information and communication technologies was raised through activities for evaluating and discussing the selection of instructional materials and the lesson activities associated with them. Implications for teacher education in computer-assisted language learning are discussed.","subject":"Information Technology, Preservice Teacher Education, Technological Literacy, Copyrights, Safety, Electronic Learning, Web Based Instruction, Instructional Material Evaluation, Lesson Plans, Computer Assisted Instruction, Second Language Learning, Preservice Teachers, Reading Assignments, Foreign Countries, English Teachers","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"South Korea"},{"id":"EJ1063806","title":"The Practices and Challenges of Telecollaboration in Higher Education in Europe","author":"Helm, Francesca","description":"Telecollaboration is an area of CALL research and practice which has developed considerably in the last twenty years. Many research studies have been carried out and important findings have been made, but there has not yet been a large scale survey to try and &quot;map&quot; the state of the art in telecollaboration practice. Most studies focus on single telecollaboration projects and look at the project design, learning outcomes and difficulties teachers and researchers have encountered in that particular project. This paper reports on a survey which sought to explore current practices and attitudes towards telecollaboration across European universities and to identify barriers that practitioners encounter. The survey was completed in full by a total of 210 university language teachers in 23 different European countries and 131 students. The picture we found presents a broad spectrum of practices. Despite an overwhelmingly positive attitude towards telecollaboration, findings also provide large-scale confirmation of some of the problems identified in small-scale studies, such as organizational difficulties, lack of time, limited technical support and great uncertainty regarding issues students should address in their exchanges. The paper concludes with some recommendations as to how to meet these challenges and how telecollaboration practice could become mainstreamed in higher education.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Videoconferencing, Surveys, Educational Practices, Teacher Attitudes, Barriers, College Faculty, Language Teachers, Teaching Methods, Positive Attitudes, Time Management, Technical Support, Teacher Student Relationship, College Students, Computer Mediated Communication, Cooperative Learning, Foreign Countries, Profiles, Questionnaires, Qualitative Research, Statistical Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1063796","title":"Computer-Supported Cooperative Prewriting for Enhancing Young EFL Learners' Writing Performance","author":"Lan, Yu-Ju, Sung, Yao-Ting, Cheng, Chia-Chun, Chang, Kuo-En","description":"The current study investigated the effects of different computer-supported cooperative prewriting strategies (text-based brainstorming, drawing, and mind mapping) on the writing performance of elementary-school EFL (English as a foreign language) learners in Taiwan. Three intact classes of fifth graders (N = 81 students; 27 per prewriting strategy group) participated in this study. These subjects in different classes used different prewriting strategies at the prewriting stage. A quasi-experimental design was adopted in this study to collect experimental data, including the scores of English composition (two writing works), the level of grammar knowledge, and the level of English writing motivation. The analytical results indicated that in both the mind mapping group and the drawing group, the participants' English grammar knowledge had increased significantly after the treatment. It was also found that different computer-supported cooperative prewriting strategies benefited young EFL writers in different dimensions of English composition. The influence of using the mind mapping strategy seems most powerful on young EFL writers, followed by the drawing strategy and the text-based brainstorming strategy. As to English composition motivation, almost all of the participants appreciated the computer-supported cooperative prewriting activities and were also aware of how these activities benefited their English writing.","subject":"Prewriting, Writing Instruction, English (Second Language), Second Language Learning, Computer Assisted Instruction, Grammar, Cooperative Learning, Cognitive Mapping, Scores, Essays, Writing (Composition), Writing Strategies, Brainstorming, Elementary School Students, Foreign Countries, Student Motivation, Educational Benefits, Student Attitudes, Teaching Methods, Grade 5, Quasiexperimental Design, Pretests Posttests, Statistical Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1063813","title":"A Corpus Approach for Autonomous Teachers and Learners: Implementing an On-Line Concordancer on Teachers' Laptops","author":"Lee, Jang Ho, Lee, Hansol, Sert, Cetin","description":"The present article deals with the issue of how to create and operate a customizable on-line concordancer from viewpoints of language teachers and with their own laptops. It aims to introduce how to use and manage this application without relying on computer engineers for various pedagogical purposes, focusing on the four beneficial dimensions of its interface and technical features: accessibility, simplicity, functionality, and manageability. In addition, the carefully written directions illustrate how to implement this open-source application on laptops using pre-established or customized corpora. For those in the field of language teaching and learning, this application is designed to allow teachers to operate different types or levels of corpora in separate spaces on one server and to enable multiple simultaneous connections in classroom contexts. Ultimately, the authors believe that this application will not only allow students to actively experience data-driven learning anywhere and anytime, but also will help teachers manage their own version of this online concordancer by autonomously uploading any kinds of source texts for corpus analysis at their pedagogical discretion.","subject":"Indexes, Second Language Learning, Second Language Instruction, Computational Linguistics, Language Teachers, Internet, Teaching Methods, Laptop Computers, Vocabulary Development, Educational Benefits","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051726","title":"From TPACK-in-Action Workshops to Classrooms: CALL Competency Developed and Integrated","author":"Tai, Shu-Ju Diana","description":"This study investigated the impact of a CALL teacher education workshop guided by the TPACK-in-Action model (Tai, 2013). This model is framed within Technological Pedagogical Content Knowledge (TPACK, Mishra &amp; Koehler, 2006) and advocates a learning-by-doing approach (Chapelle &amp; Hegelheimer, 2004) to understand how English teachers develop CALL competency and adopt the competency in their teaching. Participants were 24 elementary English teachers in Taiwan. The study used a mixed methods design (Creswell &amp; Plano Clark, 2007), collecting and analyzing qualitative and quantitative data concurrently but separately before they were triangulated. Findings show that the TPACK-in-Action workshops had a positive impact on the 24 teachers. In addition to the development of CALL competency, it was also observed that participants demonstrated CALL competency in their teaching, such as selecting online materials and appropriate technology for content teaching, using cloud computing for student interaction, and matching the affordances of technology to meet their instructional goals and pedagogy. In sum, the study provides empirical evidence and a new perspective in the investigation of CALL teacher education. The theoretical and pedagogical implications for CALL teacher education research and practice are discussed.","subject":"Computer Assisted Instruction, Pedagogical Content Knowledge, Educational Technology, Technological Literacy, Technology Integration, Teacher Education, Elementary School Teachers, English Teachers, Mixed Methods Research, Program Effectiveness, Teacher Competencies, Educational Objectives, English (Second Language), Second Language Instruction, Models, Workshops, Teacher Surveys, Teacher Attitudes, Observation, Interviews, Reflection","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1051718","title":"Contextualized Views of Practices and Competencies in CALL Teacher Education Research","author":"Arnold, Nike, Ducate, Lara","description":"While teachers play a central role in capitalizing on the potentials of computer assisted language learning (CALL), CALL teacher education overall still appears not to be adequate and effective (Healey et al., 2011; Hubbard, 2008). Furthermore, foreign\/second language teachers have expressed a desire for more and better professional development opportunities in that area (Beaven, Emke, Ernest, Germain-Rutherford, Hampel, Hopkins, Stanojevic &amp; Stickler, 2010; Digedu, 2014; Kessler, 2006). Given the continuing and new challenges for CALL teacher education, this special issue of &quot;Language Learning &amp; Technology&quot; on CALL teacher education further speaks to its importance for our field and ultimately our students. To advance our understanding of CALL teacher education, the main goal for this issue is to move beyond research on teacher beliefs and attitudes to investigate actual practices and competencies, especially from a longitudinal perspective, that traces teachers&apos; development. The current issue brings together a collection of articles that represents a wide variety of contexts, formats, foci, and research methods. This variety is particularly important given the highly contextualized nature of teaching and learning (Freeman &amp; Johnson, 1998) and the different needs of pre-service and in-service teachers (Beaven et al., 2010).","subject":"Teacher Education, Faculty Development, Language Teachers, Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Educational Technology, Teacher Competencies, Educational Practices","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null}]