[{"id":"EJ1063476","title":"Investigating an Innovative Computer Application to Improve L2 Word Recognition from Speech","author":"Matthews, Joshua, O'Toole, John Mitchell","description":"The ability to recognise words from the aural modality is a critical aspect of successful second language (L2) listening comprehension. However, little research has been reported on computer-mediated development of L2 word recognition from speech in L2 learning contexts. This report describes the development of an innovative computer application to improve L2 word recognition from speech, and goes on to describe an exploratory study of its use by 33 English as a second language (ESL) students. The study detected significant differences between word recognition scores measured before and after participants used the application. The manner with which students engaged with the computer application in terms of word recognition, self-determined exposure to speech input (repetitions) and modified output productivity (revisions) are also described and analysed. Differences in engagement by learners with different word recognition capabilities are noted. The paper concludes with a discussion of some recommendations for the use of computer-assisted development of L2 word recognition from speech and also provides concrete suggestions for much needed further empirical research in this area.","subject":"Second Language Learning, Second Language Instruction, Word Recognition, Linguistic Input, Computer Assisted Instruction, Teaching Methods, Speech, Listening Comprehension, English (Second Language), Learner Engagement, Psycholinguistics, Asians, College Students, Foreign Countries, Word Lists, Pretests Posttests, Language Tests, Student Attitudes, Attitude Measures, Scores, Accuracy, Verbal Communication","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1047685","title":"University Teachers' Perceptions of Online Informal Learning of English (OILE)","author":"Toffoli, Denyze, Sockett, Geoff","description":"Online Informal Learning of English (OILE) involves the many different types of language practices that non-specialist EFL students of English are involved in on the Internet. This article reviews previous studies in the area and summarises the specific outcomes that OILE is thought to produce. It then presents an analysis of a survey of teachers' cognitions concerning OILE from a sample of 30 professors of English working in French universities. It analyses survey data in various manners, offering insight into teachers' awareness of the OILE phenomenon amongst students, the perceived or imagined effects of these practices on their students' English and the ways they do or do not integrate these cognitions into their own teaching. Results indicate that many professors are aware of the types of input that their learners may be exposed to, but that they know little of the specifics and few make use of this knowledge in their English courses. In the discussion some questions are raised as to future forms for English language teaching to specialists of other disciplines.","subject":"Online Courses, Teacher Attitudes, Informal Education, English (Second Language), Second Language Learning, Surveys, Schemata (Cognition), College Faculty, Foreign Countries, Second Language Instruction, Futures (of Society), Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"France"},{"id":"EJ1047675","title":"Developing a Corpus-Based Paraphrase Tool to Improve EFL Learners' Writing Skills","author":"Chen, M.-H., Huang, S.-T., Chang, J. S., Liou, H.-C.","description":"Paraphrasing, or restating information using different words, is critical to successful writing. However, EFL learners have difficulty in making paraphrases to meet their writing demands, and there has been little research on developing automatic reference tools to assist these learners' paraphrasing skills for better writing quality. In this study, we developed PREFER, an online corpus-based paraphrasing assistance system. Allowing multi-word input and returning promptly with a list of paraphrases in English and Chinese, along with usage patterns and example sentences, &quot;PREFER&quot; provides substantial support for EFL learners to vary their expressions during writing. An assessment study of the effectiveness of &quot;PREFER&quot; was conducted with 55 Chinese-speaking EFL college freshmen in an Asian country. The results indicated that &quot;PREFER&quot; offered the most benefits to students' writing performance (with an after-use improvement of 38.2%), compared with an online dictionary and an online thesaurus (-31.6% and -6.2%, respectively). Further investigation revealed that the less proficient, more motivated, and more conservative students showed more significant progress in the paraphrasing task with the help of &quot;PREFER.&quot; In the meantime, nearly 90% of the students expressed satisfaction with the paraphrases generated by &quot;PREFER,&quot; and its functions, and another 75% of them acknowledged that &quot;PREFER&quot; benefits their writing task.","subject":"English (Second Language), Second Language Learning, Computational Linguistics, Dictionaries, Internet, Writing (Composition), Language Usage, Chinese, Writing Improvement, Asians, College Freshmen, Student Attitudes, Writing Instruction, Second Language Instruction, Scoring Rubrics, Writing Evaluation, Pretests Posttests, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"}]