[{"id":"EJ1051436","title":"Computer-Assisted Language Learning (CALL) in Support of (Re)-Learning Native Languages: The Case of Runyakitara","author":"Katushemererwe, Fridah, Nerbonne, John","description":"This study presents the results from a computer-assisted language learning (CALL) system of Runyakitara (RU_CALL). The major objective was to provide an electronic language learning environment that can enable learners with mother tongue deficiencies to enhance their knowledge of grammar and acquire writing skills in Runyakitara. The system currently focuses on nouns and employs natural language processing in order to generate a large base of exercise material without extensive tuning by teachers. Language learners used the system over 10 sessions and their improvements were charted. Besides this empirical evaluation, we also sought the opinions of Runyakitara experts about the system (as a judgmental evaluation). Results from the evaluation study indicate that RU_CALL has the ability to assess users' knowledge of Runyakitara and to enhance grammar and writing skills in the language. This computational resource can be utilized by other interested learners of Runyakitara, and the idea can be extended to other indigenous languages with emigrant populations who wish to maintain their language skills.","subject":"Computer Assisted Instruction, Native Language Instruction, Grammar, Language Maintenance, Nouns, Natural Language Processing, Online Courses, Writing Skills, Skill Development, Computational Linguistics, African Languages, Foreign Countries, Morphology (Languages), Language Research, Questionnaires, Pretesting, Statistical Significance","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Uganda"},{"id":"EJ1077717","title":"Applying Role-Playing Strategy to Enhance Learners' Writing and Speaking Skills in EFL Courses Using Facebook and Skype as Learning Tools: A Case Study in Taiwan","author":"Yen, Yen-Chen, Hou, Huei-Tse, Chang, Kuo En","description":"English as a foreign language (EFL) instruction faces many challenges in Asia because of many cultural and environmental factors, such as the lack of interactive speaking environments, emphasis placed on test scores, and foreign language anxiety. The purpose of this research is to conduct an EFL instructional course by integrating Facebook (asynchronous online discussion) and Skype (synchronous online discussion) as platforms through which students perform role-playing based learning activities and to observe the effects of the course on the challenges mentioned above. The study consists of 42 participants who are enrolled in an English conversation course in a business college in Taiwan. This study conducted a learning performance analysis, correlation analysis, and qualitative content analysis of the learning process. The results indicate that the learners improved their speaking and writing skills through the learning tools and role-playing activities. The content analysis also demonstrated that learners could improve their speaking and writing skills via peer-to-peer and self-correction behaviors. We also provide several recommendations for EFL educators and researchers.","subject":"Role Playing, English (Second Language), Second Language Learning, Content Analysis, Conversational Language Courses, Correlation, Business Schools, Foreign Countries, Asians, Second Language Instruction, Cultural Influences, Environmental Influences, Computer Mediated Communication, Synchronous Communication, Qualitative Research, Learning Processes, Writing Skills, Oral Language, Peer Relationship, Error Correction, Case Studies, College Students, Social Media, Language Tests, Pretests Posttests","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1077835","title":"Technology Use and Self-Perceptions of English Language Skills among Urban Adolescents","author":"Li, Jia, Snow, Catherine, Jiang, Jingjing, Edwards, Nicholas","description":"Technology including social media and other technology applications enabled by different technology devices offer many possibilities for second language learners to improve their learning, if they are interested in doing so. We investigated purposes for using technology among urban adolescents, including both English language learners (ELLs) and native English speakers (NESs). Data were collected through a survey of 531 students in an urban public middle school in the USA. The results showed that students used technology for diverse purposes regardless of their first language background. Although overall technology students' access was comparable to national averages, the use of technology for many specific purposes was markedly lower, lending support to the notion of a new digital divide between students from high- and low-income families based on technology knowledge and meaningful application of such knowledge rather than mere access. Student reports of their own English skills were related to various specific uses of technology, e.g., blogging and email. These relationships were stronger for ELLs, particularly those in grade 6, than for NESs. The results suggest that younger ELL adolescents may be more aware of their language constraints and prone to use technology in certain ways than their NES peers. These findings provide some preliminary insights into the complex relationships between language skills and student preferences for technology use and can ultimately provide guidance for the integration of technology into language and literacy instruction for linguistically diverse urban adolescents.","subject":"Self Concept, English (Second Language), Second Language Learning, Low Income, Social Differences, Urban Areas, Adolescents, Technological Literacy, English Language Learners, Surveys, Middle School Students, Correlation, Literacy Education, Language Skills, Student Attitudes, Social Networks, Socioeconomic Status, Statistical Analysis","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Massachusetts"},{"id":"EJ1051437","title":"From Web-Based Readers to Voice Bloggers: EFL Learners' Perspectives","author":"Huang, Hsin-chou","description":"With the advancement of such Web 2.0 applications as weblogs, language learners have more opportunities to use a target language for communication purposes and to experience peer collaboration and interaction. In the search for ways to augment an EFL curriculum in which speaking practice is limited but the demand for improving oral proficiencies is high, this study explored the use of voice blogging to develop communication skills, analyzed the stages of students' blogging efforts, and investigated students' perceptions of this authentic language experience. Seventy-four intermediate EFL learners from two Freshman English classes at a national university in Taiwan participated in this study. During the semester-long experiment, students read online materials and used an instructional blogging site constructed by the teacher-researcher to post voice blog entries and comment on peers' blog posts. The recursive four stages of their blogging efforts were: reading to learn, planning and organizing, speaking, and sharing. In a post-task survey and in semi-structured interviews, students said they felt that the process of producing voice blog entries facilitated language learning, enhanced knowledge construction, and promoted social networking. Students also offered suggestions for ways to improve the project, such as teaching more online search skills, providing better online recording mechanisms, and setting up a combination of face-to-face and online interactions. This study's findings and suggestions for future voice blogging projects can serve as a template for integrating voice blogging into the EFL curriculum.","subject":"Web 2.0 Technologies, Semi Structured Interviews, Electronic Publishing, English (Second Language), Second Language Learning, Surveys, Foreign Countries, College Freshmen, Language Proficiency, Oral Language, Computer Mediated Communication, Language Processing, Student Attitudes, Social Networks, Search Strategies, Second Language Instruction, Teaching Methods, Computer Assisted Instruction, Web Sites, Feedback (Response)","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1047675","title":"Developing a Corpus-Based Paraphrase Tool to Improve EFL Learners' Writing Skills","author":"Chen, M.-H., Huang, S.-T., Chang, J. S., Liou, H.-C.","description":"Paraphrasing, or restating information using different words, is critical to successful writing. However, EFL learners have difficulty in making paraphrases to meet their writing demands, and there has been little research on developing automatic reference tools to assist these learners' paraphrasing skills for better writing quality. In this study, we developed PREFER, an online corpus-based paraphrasing assistance system. Allowing multi-word input and returning promptly with a list of paraphrases in English and Chinese, along with usage patterns and example sentences, &quot;PREFER&quot; provides substantial support for EFL learners to vary their expressions during writing. An assessment study of the effectiveness of &quot;PREFER&quot; was conducted with 55 Chinese-speaking EFL college freshmen in an Asian country. The results indicated that &quot;PREFER&quot; offered the most benefits to students' writing performance (with an after-use improvement of 38.2%), compared with an online dictionary and an online thesaurus (-31.6% and -6.2%, respectively). Further investigation revealed that the less proficient, more motivated, and more conservative students showed more significant progress in the paraphrasing task with the help of &quot;PREFER.&quot; In the meantime, nearly 90% of the students expressed satisfaction with the paraphrases generated by &quot;PREFER,&quot; and its functions, and another 75% of them acknowledged that &quot;PREFER&quot; benefits their writing task.","subject":"English (Second Language), Second Language Learning, Computational Linguistics, Dictionaries, Internet, Writing (Composition), Language Usage, Chinese, Writing Improvement, Asians, College Freshmen, Student Attitudes, Writing Instruction, Second Language Instruction, Scoring Rubrics, Writing Evaluation, Pretests Posttests, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Asia"},{"id":"EJ1077787","title":"Design Considerations of Help Options in Computer-Based L2 Listening Materials Informed by Participatory Design","author":"Cárdenas-Claros, Mónica Stella","description":"This paper reports on the findings of two qualitative exploratory studies that sought to investigate design features of help options in computer-based L2 listening materials. Informed by principles of participatory design, language learners, software designers, language teachers, and a computer programmer worked collaboratively in a series of design sessions. The participants first evaluated researcher-generated prototypes, designed prototypes for two language proficiencies (beginner and upper intermediate) and iterated designs on both paper and screen. Analysis of the reworked prototypes resulted in five features of help option design: type, location, sequence, click-through, and display. Analyses of the interaction data showed that consensually the participants favored help options that are easy to use, promote learner control, support guidance, and stimulate learning.","subject":"Second Language Learning, Qualitative Research, Listening Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Materials, Language Teachers, Programming, Language Proficiency, Material Development, Usability, Interaction, Foreign Countries","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1059266","title":"I Help, Therefore, I Learn: Service Learning on Web 2.0 in an EFL Speaking Class","author":"Sun, Yu-Chih, Yang, Fang-Ying","description":"The present study integrates service learning into English as a Foreign Language (EFL) speaking class using Web 2.0 tools--YouTube and Facebook--as platforms. Fourteen undergraduate students participated in the study. The purpose of the service-learning project was to link service learning with oral communication training in an EFL speaking class by having each student create two YouTube videos in which they made informative presentations about the university (e.g., transportation system) and the city (e.g., sightseeing spots) in English to international students on campus. A Facebook community was established as a forum for students to share their videos with the international students and peers. The results suggest that the project enhanced EFL students' public speaking-related skills (e.g., idea and content development, and pronunciation), built their confidence in speaking English, and allowed them to develop their own learning process and strategies. Moreover, Web 2.0 tools endow service learning with new possibilities of reaching a greater number of the target audience and provide the members of the community with alternative means of communication.","subject":"Service Learning, Web 2.0 Technologies, English (Second Language), Second Language Learning, Oral Language, Learning Processes, Learning Strategies, Video Technology, Pronunciation, Foreign Students, Peer Relationship, Teaching Methods, Self Efficacy, Computer Assisted Instruction, Case Studies, Undergraduate Students, Foreign Countries, Surveys, Likert Scales, Student Attitudes, Reflection, Essays, Interviews, Outcomes of Education, Learning Theories, Qualitative Research, Dialogs (Language), Privacy, Computer Mediated Communication, Learning Experience","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan"}]