[{"id":"EJ1143739","title":"Sustaining Multimodal Language Learner Interactions Online","author":"Satar, H. Müge","description":"Social presence is considered an important quality in computer-mediated communication as it promotes willingness in learners to take risks through participation in interpersonal exchanges (Kehrwald, 2008) and makes communication more natural (Lowenthal, 2010). While social presence has mostly been investigated through questionnaire data and quantitative content analysis of online interactions based on a set of predefined indicators, in a smaller number of studies the concept has also been investigated through qualitative analysis of interviews (Kehrwald, 2008, 2010). Yet studies that bring together multiple sources of data collection and examine multimodal language learning contexts are almost non-existent. In this paper, the theory of social presence is employed to explicate language learners' online multimodal communication using a case study approach. Multiple sources of data were collected, including interviews, open-ended and closed post-task questionnaires, stimulated reflection and recordings of video interactions. The main findings of the study included an innovative social presence framework developed for the analysis of online multimodal language learner interactions (Satar, 2010), which can be used in further qualitative and exploratory research. It also has potential applicability for educators to develop strategies for language learners to guide them in creating and transmitting their social presence. The focus of this article is a cross-case analysis for one of the components of social presence, sustaining interaction, bringing together social presence theory, interactional sociolinguistics and multimodal interaction analysis. Finally, strategies are proposed for language learners on how to sustain their online multimodal interactions.","subject":"Learning Modalities, Online Courses, Computer Mediated Communication, Computer Assisted Instruction, Educational Technology, Interpersonal Communication, Interviews, Questionnaires, Reflection, Video Technology, Videoconferencing, Interaction, English (Second Language), Second Language Learning, Late Adolescents, Young Adults, Preservice Teachers, Foreign Countries, Case Studies, Qualitative Research","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":"Turkey"},{"id":"EJ1143616","title":"An Analysis of Social Network Websites for Language Learning: Implications for Teaching and Learning English as a Second Language","author":"Liu, M., Abe, K., Cao, M. W., Liu, S., Ok, D. U., Park, J., Parrish, C., Sardegna, V. G.","description":"Although educators are excited about the potential of social network sites for language learning (SNSLL), there is a lack of understanding of how SNSLL can be used to facilitate teaching and learning for English as Second language (ESL) instructors and students. The purpose of this study was to examine the affordances of four selected SNSLL (LingQ, Lang-8, italki, and Polyglotclub) through site design and user experience from two perspectives: using the sites as a language teacher through site analyses; and using the sites as a language learner through usability testing. The findings showed that these sites have the potential to facilitate language learning. The learning tasks created using the social networking features of these sites are to provide examples of how to use these SNSLL as teaching tools under a socio-constructivist learning framework. In addition, the results of the usability testing highlighted the importance of considering the website's information, interface, and interaction designs. SNSLL should be as easy to use and as intuitive to navigate as possible. We hope the findings will provide valuable insights regarding how SNSLL can be used as teaching and learning tools, and how they should be designed to facilitate pedagogical goals.","subject":"Social Media, Second Language Instruction, English (Second Language), Technology Uses in Education, Educational Technology, Language Teachers, Usability, Web Sites, Teaching Methods, Web 2.0 Technologies, Teacher Attitudes, College Students, Questionnaires, Program Effectiveness, Use Studies, Video Technology, Student Attitudes","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143730","title":"Using Netnography to Explore the Culture of Online Language Teaching Communities","author":"Kulavuz-Onal, Derya","description":"Netnography (Kozinets, 2010) is an ethnographic approach to study communities that exist primarily online. Engaging in online participant observation, the netnographer connects to the online community through a computer screen, and the field is located inside the screen. Although it has been used in marketing research extensively, netnography is a relatively new methodology in educational research. In this paper, I give an overview of netnography and its applicability in studying online language teaching communities. Drawing upon a netnography of a globally-distributed online community of practice of English language teachers, Webheads in Action, I provide detailed accounts of my experiences during data collection and particular methodological considerations in netnography in order to shed light on the often untold aspects of an ethnographic design in online research that involves participant observation. I conclude with a discussion of possible benefits of a participant observer approach in netnography in understanding the culture of online language teaching communities, and invite CALL researchers to consider netnography and online participant observation in their future studies.","subject":"Second Language Learning, Computer Assisted Instruction, Web Based Instruction, Ethnography, Communities of Practice, Participant Observation, Research Methodology, Educational Research, Language Teachers, English Language Learners, Data Collection, Research Design, Educational Benefits, Computer Mediated Communication, Web 2.0 Technologies, Field Studies, Notetaking, Interviews, Archives","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1143733","title":"Second Language Teacher Development through CALL Practice: The Emergence of Teachers&apos; Agency","author":"Kitade, Keiko","description":"A growing number of studies examining second language (L2) teacher education from the perspective of sociocultural theory, in particular the activity theory framework (Engeström, 1999), show that transformations in teachers' cognition and practice can be fostered through negotiation of sociocultural and cognitive dissonance in their teaching environments. This case study examines 16 years of cognitive development of two Japanese language teachers practicing computer-assisted language learning (CALL) and the challenges they experienced as a result of the evolution of information and communications technology (ICT). The focus is on the challenges faced by L2 teachers and their responses, and how these challenges relate to the development of teachers' agency as CALL practitioners. Narrative inquiry data for both participants were collected following the Trajectory Equifinality Approach (e.g., Valsiner &amp; Sato, 2006), in which each teacher's life trajectory is visualized to identify critical points based on social affordances and constraints. The critical points were further analyzed and interpreted within and between activity systems. The data suggests that the teachers became aware of the social nature of the technology through the challenges they encountered when coordinating their own and students' mismatched values attached to ICT. Such a change in perceptions not only impacted their pedagogical usage of the technology but in turn also constituted their agency.","subject":"Computer Assisted Instruction, Second Language Instruction, Language Teachers, Technology Uses in Education, Educational Technology, Technological Literacy, Empowerment, Japanese, Semi Structured Interviews, Teacher Attitudes, Social Influences, Faculty Development, Case Studies, Qualitative Research, Personal Narratives","source":"CALICO Journal","publicationdateyear":2015,"identifiersgeo":null}]