[{"id":"EJ1317920","title":"CALL Beliefs in Context: A Study of US High School Foreign Language Learners","author":"Hellmich, Emily A.","description":"Recent calls from applied linguistics and from CALL have emphasized the importance of situating the understanding and use of digital tools for language learning within layered contexts. An important component of these layered contexts is societal discourses of technology, which are multiple and far from neutral. In response to these calls, this study examines how students at one San Francisco Bay Area high school understand technology in foreign language learning and how these beliefs relate to regional discourses of technology. The study assumed an ecological theoretical frame and deployed a multi-pronged research design: a survey study (n = 283), a case study (n = 3), and a discourse analysis of a regional newspaper corpus (n = 372). Findings indicate that students held largely utilitarian beliefs about CALL that both aligned with and diverged from regional discourses. Instances of alignment suggest the potential influence of larger societal discourses on student beliefs about CALL while instances of divergence underscore the need to address the larger role of technology in society when considering CALL beliefs and practices.","subject":"Computer Assisted Instruction, Second Language Learning, Second Language Instruction, Student Attitudes, Case Studies, Applied Linguistics, High School Students, Technology Uses in Education, Student Surveys, Discourse Analysis, Educational Practices, Newspapers, Computational Linguistics, Information Technology, Geographic Regions, Correlation","source":"Computer Assisted Language Learning","publicationdateyear":2021,"identifiersgeo":"California (San Francisco)"},{"id":"EJ1318371","title":"Promotion of Learner Autonomy within the Framework of a Flipped EFL Instructional Model: Perception and Perspectives","author":"Tsai, Yea-Ru","description":"This study investigated the effects of the flipped classroom model on EFL learner autonomy in a content-based instructional context. The participants involved were students enrolled in two linguistics classes, divided into an experimental group (n = 64) which received a flipped classroom (FC) instruction and a control group (n = 60) taught in a non-flipped classroom. In the FC, various functions were embedded in a Moodle course management system (CMS), including video lectures, online quizzes, resources and e-journals. The comparison between the pre- and post-questionnaire on perceived learner autonomy showed no difference between the groups prior to instruction; however, significant statistical differences were found between the groups following instruction, especially in the constructs of learner autonomous strategy, learner behavior and learner confidence. The examination of e-journals revealed that learner autonomy had been improved in terms of strategy use, behavior, interaction with the materials, the use of social resources and self-management of learning. The CMS log analysis showed significant correlations between online learning activities and perceived learner autonomy. Furthermore, the data collected from the pre- and post-questionnaires, e-journal and interviews were analysed and interpreted to explain the fostered learner autonomy from psychological, technical, sociocultural and political-critical perspectives.","subject":"Foreign Countries, Undergraduate Students, Second Language Learning, English (Second Language), Personal Autonomy, Flipped Classroom, Learning Strategies, Self Esteem, Student Behavior, Instructional Materials, Self Management, Educational Technology","source":"Computer Assisted Language Learning","publicationdateyear":2021,"identifiersgeo":"Taiwan"},{"id":"EJ1296398","title":"Using Collocation Clusters to Detect and Correct English L2 Learners&apos; Collocation Errors","author":"Huang, Ping-Yu, Tsao, Nai-Lung","description":"In this article, we describe an online English collocation explorer developed to help English L2 learners produce correct and appropriate collocations. Our tool, which is able to visually represent relevant correct\/incorrect collocations on a single webpage, was designed based on the notions of collocation clusters and intercollocability proposed by Cowie and Howarth. As they pointed out, in a collocation cluster L2 learners generally cannot distinguish true collocations (e.g., &quot;tell truth,&quot; &quot;state truth,&quot; and &quot;state fact&quot;) from impossible combinations (e.g., *&quot;say fact&quot; and *&quot;say truth&quot;). Accordingly, our tool applies natural language processing techniques to construct collocation clusters to enable learners to easily differentiate between correct and incorrect pairs. Relying on data from a reference corpus, our system instantaneously processes the collocability of users' target combination (verb-noun or adj-noun) and all other relevant words and presents true\/false collocations that L2 learners should master\/avoid. To assess our tool, we investigated its performance in detecting and correcting learners' V-N and A-N errors, with results comparable to those of most previous studies. Piloted using a sample of 13 intermediate- or upper-intermediate level English as a foreign language learners, our tool was found to help them self-correct their collocation errors effectively. Compared with similar tools or approaches, our tool requires much less data resources, but still demonstrates a remarkable capability to detect\/correct errors and generate useful collocational knowledge in English.","subject":"Second Language Learning, Second Language Instruction, English (Second Language), Error Correction, Phrase Structure, Computer Software, Natural Language Processing, Computational Linguistics, Nouns, Verbs, Teaching Methods","source":"Computer Assisted Language Learning","publicationdateyear":2021,"identifiersgeo":null}]