[{"id":"EJ1059285","title":"Interactions between Text Chat and Audio Modalities for L2 Communication and Feedback in the Synthetic World &quot;Second Life&quot;","author":"Wigham, Ciara R., Chanier, Thierry","description":"This paper reports on a study of the interactions between text chat and audio modalities in L2 communication in a synthetic (virtual) world and observes whether the text chat modality was used for corrective feedback and the characteristics of the latter. This is examined within the context of a hybrid content and language integrated learning design workshop. This course involved 17 students of architecture whose L2 was either French or English and for which the synthetic world environment Second Life was employed for distance language sessions. Using multimodal transcriptions of the interaction data from these sessions, it was found that text chat was employed for content-based interaction concerning the task as well as for feedback concerning non-target-like errors in the audio modality. Feedback predominantly concerned lexical errors and was offered in the form of recasts. The multimodality of the environment did not appear to cognitively overload students who frequently responded in the audio modality to corrective feedback offered in the text chat. The study highlights the need to train language tutors who wish to exploit synthetic worlds to use the text chat in parallel with the audio to support learners' verbal production with respect to verbal participation and proficiency.","subject":"Computer Simulation, Social Systems, Internet, Computer Mediated Communication, Handheld Devices, Written Language, Telecommunications, Second Language Instruction, Auditory Stimuli, English, French, Nonverbal Communication, Feedback (Response), Discourse Analysis, Interaction, Interaction Process Analysis, Electronic Learning, Undergraduate Students, Architectural Education","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1077721","title":"A Virtual Walk through London: Culture Learning through a Cultural Immersion Experience","author":"Shih, Ya-Chun","description":"Integrating Google Street View into a three-dimensional virtual environment in which users control personal avatars provides these said users with access to an innovative, interactive, and real-world context for communication and culture learning. We have selected London, a city famous for its rich historical, architectural, and artistic heritage, as the location of choice for culture learning. Using avatars, learners walk the virtual streets of London under the guidance of a native English-speaking instructor, and interact with each other using text and voice chat functions. The study examines the effects of this virtual environment on culture learning. Specifically, a qualitative case study combined with a time-series design is used to investigate the virtual context's impact on culture learning in terms of learner knowledge and attitudes, and to track associated change processes across the three research phases (baseline, treatment, and maintenance). The results show that all four English learners involved in the study benefitted from their cultural immersion, to varying extents, in the virtual environment. Four contributing learner factors, namely linguistic proficiency, motivation, character traits, and attitudes were found to correspond to the learners' levels of acquaintance with the target culture.","subject":"Geographic Information Systems, Case Studies, Qualitative Research, Language Proficiency, Computer Simulation, English (Second Language), Second Language Learning, Learning Motivation, Personality Traits, Student Attitudes, Second Language Instruction, Foreign Countries, Native Speakers, Computer Mediated Communication, Cultural Education, Teaching Methods, Graduate Students, Multiple Choice Tests, Identification, Pictorial Stimuli, Student Evaluation, Statistical Analysis, Test Validity, Observation","source":"Computer Assisted Language Learning","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom (London)"}]