[{"id":"EJ1074883","title":"Attitudes towards Online Feedback on Writing: Why Students Mistrust the Learning Potential of Models","author":"Strobl, Carola","description":"This exploratory study sheds new light on students' perceptions of online feedback types for a complex writing task, summary writing from spoken input in a foreign language (L2), and investigates how these correlate with their actual learning to write. Students tend to favour clear-cut, instructivist rather than constructivist feedback, and guided self-evaluation through model solutions in online learning environments. However, the former type is too limited to tackle all dimensions of advanced writing. Constructivist feedback, in the form of guided modelling, allows addressing the higher-order concerns involved in summary writing. In addition, it is widely acknowledged that activating the zone of proximal development (ZPD) through cognitive involvement is beneficial to learning. To investigate students' learning from both types of feedback, a one-group pre-post-test intervention study was set up. Students attending a course on summary writing in L2 within a bachelor programme in Applied Languages (n = 38) followed an individual online learning module containing both instructivist fill-the-gap exercises and model solutions with constructivist guiding questions for self-assessment. The students' actual learning gain was measured through pre- and post-tests, and compared with their perceived learning gain, as expressed in self-evaluation. The comparison reveals a dichotomy between the students' observed learning curve and an underestimation of their own progress. This dichotomy was found to originate in a mismatch between their expectations towards the online learning module and the characteristics of the constructivist feedback conveyed. This mismatch can be attributed to three key factors: (1) evaluation, (2) linguistic focus, and (3) learner motivation.","subject":"Feedback (Response), Writing (Composition), Constructivism (Learning), Computer Mediated Communication, Student Attitudes, Writing Attitudes, Second Language Learning, Correlation, Writing Instruction, Trust (Psychology), Models, Undergraduate Students, Bachelors Degrees, Applied Linguistics, Problem Solving, Ability, Cognitive Development, Educational Benefits, Pretests Posttests, Intervention, Electronic Learning, Learning Modules, Writing Exercises, Self Evaluation (Individuals), Comparative Analysis, Learning Motivation, Blended Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074878","title":"Using Key Part-of-Speech Analysis to Examine Spoken Discourse by Taiwanese EFL Learners","author":"Lin, Yen-Liang","description":"This study reports on a corpus analysis of samples of spoken discourse between a group of British and Taiwanese adolescents, with the aim of exploring the statistically significant differences in the use of grammatical categories between the two groups of participants. The key word method extended to a part-of-speech level using the web-based corpus analytical tool, &quot;Wmatrix,&quot; highlights those linguistic domains which deserve particular attention. Specifically, it reveals the lexical and grammatical categories that occur unusually frequently or unusually infrequently in the English learners' discourse when compared with the language used by the native speakers of English in the sample. The research findings delineate the pedagogical merit of key domain analysis and thus help to inform English as a foreign language teachers and materials developers in the design of courses emphasising spoken interaction.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Discourse Analysis, Computational Linguistics, Grammar, Second Language Instruction, Teaching Methods, Material Development, Language Teachers, English, Native Speakers, Cross Cultural Studies","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom"},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]