[{"id":"EJ1063742","title":"The Accuracy of Computer-Assisted Feedback and Students' Responses to It","author":"Lavolette, Elizabeth, Polio, Charlene, Kahng, Jimin","description":"Various researchers in second language acquisition have argued for the effectiveness of immediate rather than delayed feedback. In writing, truly immediate feedback is impractical, but computer-assisted feedback provides a quick way of providing feedback that also reduces the teacher's workload. We explored the accuracy of feedback from Criterion®, a program developed by Educational Testing Service, and students' responses to it. Thirty-two students received feedback from Criterion on four essays throughout a semester, with 16 receiving the feedback immediately and 16 receiving it several days after writing their essays. Results indicated that 75% of the error codes were correct, but that Criterion missed many language errors. Students responded to the correct error codes 73% of the time and responded to more of the codes over the course of the semester, while the condition--delayed versus immediate--did not affect their response rates nor their accuracy on the first drafts. Although we cannot support claims that immediate feedback may be more helpful, we believe that, with proper training, Criterion can help students correct certain aspects of language.","subject":"Second Language Learning, Second Language Instruction, Computer Assisted Instruction, Accuracy, Feedback (Response), Student Attitudes, Teaching Methods, Essays, Error Correction, Writing Instruction, Faculty Workload, Computer Software, Instructional Effectiveness, Academic Discourse, English (Second Language), Language Tests, College Students, Foreign Students, Revision (Written Composition)","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1063777","title":"A Meta-Synthesis of Empirical Research on the Effectiveness of Computer-Mediated Communication (CMC) in SLA","author":"Lin, Huifen","description":"This meta-analysis reports the results of a systematic synthesis of primary studies on the effectiveness of computer-mediated communication (CMC) in second language acquisition (SLA) for the period 2000-2012. By extracting information on 21 features from each primary study, this meta-analysis intends to summarize the CMC research literature for the past decade by calculating an average effect size and performing a series of moderator analyses to factor out elements that might mediate the effect of such media in SLA. In total, 59 studies were identified as eligible after excluding three outlier studies, covering both published and unpublished studies. All studies were coded for learner characteristics (5 features), methodological characteristics (14 features) and publication characteristics (2 features), six of which were further analyzed as moderator variables. The results show that (a) there was a positive and medium overall effect for CMC used for instructional\/learning purposes in SLA, (b) among the four language skills which CMC was intended to facilitate, writing skills produced the largest effect size, as did pragmatic competence, among the three language components, i.e. pragmatics, vocabulary and pronunciation explored in this meta-analysis; however this result should be interpreted as tentative since only one study measured pragmatic competence in the current meta-analysis, and (c) smaller group studies produced a larger effect size than those using larger groups or no grouping. [See the earlier study from this research project: &quot;Establishing an Empirical Link between Computer-Mediated Communication (CMC) and SLA: A Meta-Analysis of the Research,&quot; v18 n3 p120-147 Oct 2014 in ERIC at EJ1046538.]","subject":"Computer Mediated Communication, Second Language Learning, Meta Analysis, Effect Size, English (Second Language), Pragmatics, Communicative Competence (Languages), Vocabulary Development, Pronunciation, Teaching Methods, Writing Skills, Computer Assisted Instruction, Second Language Instruction, Instructional Effectiveness, Foreign Countries, Statistical Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Taiwan"},{"id":"EJ1051720","title":"ESL Teacher Training in 3D Virtual Worlds","author":"Kozlova, Iryna, Priven, Dmitri","description":"Although language learning in 3D Virtual Worlds (VWs) has become a focus of recent research, little is known about the knowledge and skills teachers need to acquire to provide effective task-based instruction in 3D VWs and the type of teacher training that best prepares instructors for such an endeavor. This study employs a situated learning approach to teacher training and explores what online teaching skills emerge in the process of collaborative situated learning, how these skills develop, and whether collaborative situated learning is an effective method of training instructors to teach in 3D VWs. Six English as a second language (ESL) teacher trainees enrolled in the Teaching English as a Second\/Foreign Language (TES\/FL) program participated in the study. During the preteaching stage, teacher trainees developed language tasks to implement during the teaching stage with eight EFL students in 3D VWs. Blackboard wikis used for designing tasks allowed for observing the acquisition of five 3D-specific, integrated skills. The analysis of teaching sessions recorded through screen capturing software Camtasia Relay in conjunction with the teacher trainees' wikis and journals demonstrates that for this group of teachers, a situated learning approach was an effective method of teacher training.","subject":"English (Second Language), Second Language Instruction, Language Teachers, Teacher Education, Educational Technology, Virtual Classrooms, Online Courses, Teaching Skills, Cooperative Learning, Skill Development, Preservice Teachers, Technology Uses in Education, Computer Software, Web Sites, Web 2.0 Technologies, Context Effect, Foreign Countries, Teaching Methods, Qualitative Research, Content Analysis","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":"Canada, Turkey"},{"id":"EJ1063788","title":"Bridging the Communication Divide: CMC and Deaf Individuals' Literacy Skills","author":"Garberoglio, Carrie Lou, Dickson, Duncan, Cawthon, Stephanie, Bond, Mark","description":"Deaf individuals frequently capitalize upon communication technologies that increase equitable access to communication in an ongoing, effortless manner. Those communication technologies create conditions that increase direct access to language and literacy. It is the lack of direct access to language that has been historically problematic for deaf individuals, contributing to English literacy achievement gaps that are evidenced in deaf education settings. This study explored the hypothesis that increased access to English through communication technologies would be related to stronger English literacy skills for deaf individuals. A secondary analysis approach using a longitudinal large-scale dataset, the second National Longitudinal Transition Study (NLTS2), was used to assess the frequency of computer-mediated communication as a predictor of English literacy skills in a sample of 510 deaf youths in the United States. Regression analyses demonstrated that deaf adolescents who e-mailed or chatted more frequently exhibited higher reading comprehension skills in the years ahead. These results suggest that communication technologies should be further explored as a potential avenue that may support deaf individuals' English language and literacy development.","subject":"Deafness, Communication Skills, Literacy, Reading Skills, Longitudinal Studies, Regression (Statistics), English, Computer Mediated Communication, Electronic Mail, Reading Comprehension, Language Acquisition, Surveys, Scores, Hearing Impairments, Statistical Analysis, Correlation, Individual Characteristics, Adolescents","source":"Language Learning & Technology","publicationdateyear":2015,"identifiersgeo":null}]