[{"id":"EJ1074893","title":"Computer-Mediated Input, Output and Feedback in the Development of L2 Word Recognition from Speech","author":"Matthews, Joshua, Cheng, Junyu, O'Toole, John Mitchell","description":"This paper reports on the impact of computer-mediated input, output and feedback on the development of second language (L2) word recognition from speech (WRS). A quasi-experimental pre-test\/treatment\/post-test research design was used involving three intact tertiary level English as a Second Language (ESL) classes. Classes were either assigned to a control group (n = 31) or to one of two alternative treatment levels which used a web-based computer application enabling self-determined opportunities to repeatedly listen to and reconstruct spoken target text into its written form. Treatment group one (n = 30) received text feedback after each of their efforts at target text reconstruction, whereas treatment group two (n = 35) did not. Results indicated that word recognition gain scores of those who used the application, regardless of treatment level, were significantly higher than those of the control group. The relationship between the quantity of self-determined exposure to input and word recognition improvements was moderate but not linear, with those choosing moderate levels of speech input deriving the greatest measurable improvement. Neither increased levels of modified output nor the provision of text feedback were associated with significant improvements in word recognition gain scores. Implications for computer-mediated approaches for the development of L2 WRS are described and areas for future empirical research are suggested.","subject":"Second Language Learning, English (Second Language), Quasiexperimental Design, Control Groups, Pretests Posttests, Linguistic Input, Feedback (Response), Scores, Correlation, Computer Assisted Instruction, Higher Education, Speech","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074878","title":"Using Key Part-of-Speech Analysis to Examine Spoken Discourse by Taiwanese EFL Learners","author":"Lin, Yen-Liang","description":"This study reports on a corpus analysis of samples of spoken discourse between a group of British and Taiwanese adolescents, with the aim of exploring the statistically significant differences in the use of grammatical categories between the two groups of participants. The key word method extended to a part-of-speech level using the web-based corpus analytical tool, &quot;Wmatrix,&quot; highlights those linguistic domains which deserve particular attention. Specifically, it reveals the lexical and grammatical categories that occur unusually frequently or unusually infrequently in the English learners' discourse when compared with the language used by the native speakers of English in the sample. The research findings delineate the pedagogical merit of key domain analysis and thus help to inform English as a foreign language teachers and materials developers in the design of courses emphasising spoken interaction.","subject":"Foreign Countries, English (Second Language), Second Language Learning, Discourse Analysis, Computational Linguistics, Grammar, Second Language Instruction, Teaching Methods, Material Development, Language Teachers, English, Native Speakers, Cross Cultural Studies","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Taiwan, United Kingdom"},{"id":"EJ1059678","title":"The Influence of Group Formation on Learner Participation, Language Complexity, and Corrective Behaviour in Synchronous Written Chat as Part of Academic German Studies","author":"Fredriksson, Christine","description":"Synchronous written chat and instant messaging are tools which have been used and explored in online language learning settings for at least two decades. Research literature has shown that such tools give second language (L2) learners opportunities for language learning, e.g. , the interaction in real time with peers and native speakers, the written mode of language, and the time available for planning and monitoring utterances. However, since the majority of the empirical work on chat and instant messaging has been conducted under experimental conditions, relatively little research has investigated how interaction in chat influences language learning opportunities under the conditions of an online academic language course where students have unequal status because of their different language background and level of L2 proficiency. This article presents an explorative study of the interaction in chat in a web-based academic language course between students with different L1s and different levels of L2. The aim is to shed light on how student interaction in an institutional context benefits the language learning environment in a manner that promotes L2 learners' attention to linguistic items in their input and output, and that allow opportunities for functional practising. Based on a mainly quantitative analysis, this article illustrates how L2 learners' participation, the complexity of their utterances, and their opportunities for self-correction and corrective feedback are influenced by group formation.","subject":"German, Computer Mediated Communication, Group Dynamics, Second Language Learning, Synchronous Communication, Language Proficiency, Online Courses, Academic Discourse, Native Language, Educational Benefits, Interaction Process Analysis, Linguistic Input, Statistical Analysis, Error Correction, Feedback (Response), Native Speakers, Student Participation","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059680","title":"Research Trends in Mobile Assisted Language Learning from 2000 to 2012","author":"Duman, Guler, Orhon, Gunseli, Gedik, Nuray","description":"In order to trace how mobile assisted language learning (MALL) has evolved in recent years, we analysed studies published from 2000 to 2012 to examine their characteristics and research trends. These studies were published in international journals listed in the Social Sciences Citation Index (SSCI). Sixty-nine studies that fit the time frame and study parameters were examined using a classification form. The results indicate that research in the field increased at a fast pace from 2008 and reached a peak in 2012. Teaching vocabulary with the use of cell phones and PDAs has remained popular over this period. A significant number of studies did not base their research on any theoretical framework. Applied and design-based research dominated the field, and these studies generally adopted quantitative research methods. Reflecting on these results, we suggest directions for future research and practices in the field.","subject":"Educational Research, Trend Analysis, Statistical Analysis, Telecommunications, Vocabulary Development, Classification, Futures (of Society), Teaching Methods, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059663","title":"The Impact of Mode of Instructional Delivery on Second Language Teacher Self-Efficacy","author":"Kissau, Scott, Algozzine, Bob","description":"Research has called into question the suitability of fully-online instruction for certain teacher preparation courses. Methodology coursework, in particular, has been singled out in research as ill-suited to online instruction. Recent research, for example, involving second language (L2) teacher candidates has demonstrated that aspiring teachers who completed online methodology instruction were less confident in their abilities to teach L2 learners than their counterparts who completed the same instruction in a face-to-face (F2F) setting. To address the limitations of online instruction, while still incorporating its associated strengths, the development and implementation of hybridized methodology coursework have been proposed. Following this recommendation, the researchers developed and implemented hybridized L2 methodology courses that mirrored their pre-existing online and F2F equivalents. Using a mixed methodology, the researchers then conducted a three-way comparison of instructional delivery modes (online, F2F, hybrid) to investigate their impact on L2 teacher candidate self-efficacy. Although the results demonstrated that all three modes of instruction can be equally effective at increasing candidate confidence, they also highlighted the potential of hybridized instruction to address the limitations of online and F2F instruction, while still including their strengths. The findings also emphasized that simply viewing or participating in live demonstrations of teaching strategies in post-secondary methodology courses is not sufficient. To feel confident in their teaching abilities, teacher candidates need opportunities in their coursework to apply what they have learned in K-12 classrooms. Offering numerous research-based suggestions to improve the design of hybridized methodology courses, the study also serves to inform the development of future hybridized methodology coursework.","subject":"Self Efficacy, Teacher Effectiveness, Online Courses, Teaching Methods, Second Language Learning, Second Language Instruction, Teacher Education Programs, Mixed Methods Research, Methods Courses, Comparative Analysis, Preservice Teachers, Instructional Design, Language Teachers, Student Attitudes, Intermode Differences","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"North Carolina"},{"id":"EJ1048372","title":"The Story in the Mind: The Effect of 3D Gameplay on the Structuring of Written L2 Narratives","author":"Neville, David O.","description":"The article reports on a mixed-methods study evaluating the use of a three-dimensional digital game-based language learning (3D-DGBLL) environment to teach German two-way prepositions and specialized vocabulary within a simulated real-world context of German recycling and waste management systems. The study assumed that goal-directed player activity in this environment would configure digital narratives, which in turn would help study participants in the experimental group to co-configure story maps for ordering and making sense of the problem spaces encountered in the environment. The study further assumed that these participants would subsequently rely on the story maps to help them structure written L2 narratives describing an imagined personal experience closely resembling the gameplay of the 3D-DGBLL environment. The study found that immersion in the 3D-DGBLL environment influenced the manner in which the second language was invoked in these written narratives: Participants in the experimental group produced narratives containing more textual indicators describing the activity associated with the recycling and waste management systems and the spaces in which these systems are located. Increased usage of these indicators suggest that participants in the experimental group did indeed rely on story maps generated during 3D gameplay to structure their narratives, although stylistic and grammatical features of the narratives suggest, however, that changes could be made to the curricular implementation of the 3D-DGBLL environment. The study also puts forward ideas for instructional best practices based on research findings and suggests future areas of development and investigation.","subject":"Mixed Methods Research, Educational Games, Video Games, Computer Games, German, Second Language Instruction, Grammar, Vocabulary, Simulation, Recycling, Sanitation, Experimental Groups, Maps, Teaching Methods, Educational Technology","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1074888","title":"Mobile Technology in Second Language Classrooms: Insights into Its Uses, Pedagogical Implications, and Teacher Beliefs","author":"Van Praag, Benjamin, Sanchez, Hugo Santiago","description":"Adopting a multiple-case, multiple-method design, this study investigates mobile technology use in the practices of three experienced second language teachers. The findings, based on an analysis of the teachers' rationales, stated beliefs and classroom actions, show that the teachers tend to prohibit or reluctantly tolerate mobile device usage, while they recognise some of its potential benefits to support their teaching and student learning. They also highlight the incentives and barriers which respectively facilitate and hinder the integration of mobile technology, including factors which are internal (e.g. beliefs) and external (e.g. contextual constraints) to the teachers. Implications for classroom practice and teacher education are drawn.","subject":"Teaching Methods, Educational Technology, Technology Uses in Education, Case Studies, Mixed Methods Research, Telecommunications, Handheld Devices, Teacher Attitudes, Barriers, Incentives, Technology Integration, Second Language Instruction","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048411","title":"Affect and Willingness to Communicate in Digital Game-Based Learning","author":"Reinders, Hayo, Wattana, Sorada","description":"The possible benefits of digital games for language learning and teaching have received increasing interest in recent years. Games are said, amongst others, to be motivating, to lower affective barriers in learning, and to encourage foreign or second language (L2) interaction. But how do learners actually experience the use of games? What impact does gameplay have on students' perceptions of themselves as learners, and how does this affect their learning practice? These questions are important as they are likely to influence the success of digital gamebased language learning, and as a result the way teachers might integrate games into the curriculum. In this study we investigated the experiences of five students who had participated in a fifteen-week game-based learning program at a university in Thailand. We conducted six interviews with each of them (for a total of 30 interviews) to identify what impact gameplay had in particular on their willingness to communicate in English (MacIntyre, Dörnyei, Clément &amp; Noels, 1998). The results showed that gameplay had a number of benefits for the participants in this study, in particular in terms of lowering their affective barriers to learning and increasing their willingness to communicate. We discuss the implications of these results in terms of further research and classroom practice.","subject":"Educational Games, Educational Technology, Teaching Methods, Student Attitudes, Interviews, College Students, English (Second Language), Barriers, Foreign Countries, Second Language Learning","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Thailand"},{"id":"EJ1048414","title":"Twenty Years of MALL Project Implementation: A Meta-Analysis of Learning Outcomes","author":"Burston, Jack","description":"Despite the hundreds of Mobile-Assisted Language Learning (MALL) publications over the past twenty years, statistically reliable measures of learning outcomes are few and far between. In part, this is due to the fact that well over half of all MALL-related studies report no objectively quantifiable learning outcomes, either because they did not involve MALL implementation projects, or if they did, learning gains were only based on subjective teacher assessments and\/or student self-evaluations. Even more so, the paucity of statistically reliable learning outcome data stems from the short duration of projects and small numbers of students involved. Of the 291 distinct studies examined in this review only 35 meet minimal conditions of duration and sample size, i.e., ten experimental subjects over a period of at least a month. Sixteen of these suffer from serious design shortcomings, leaving only nineteen MALL studies that can reliably serve as a basis for determining the learning outcomes of mobile-based language applications. Of these studies, fifteen can be considered to report unequivocal positive results, with those focusing on reading, listening and speaking without exception evidencing a MALL application advantage. Four studies, all focusing on vocabulary, reported no significant differences.","subject":"Educational Technology, Technology Uses in Education, Second Language Instruction, Second Language Learning, Research Methodology, Instructional Effectiveness, Meta Analysis, Telecommunications, Grammar, Vocabulary Development, Reading Skills, Listening Skills, Speech Skills","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1048375","title":"Tracing the Reflective Practices of Student Teachers in Online Modes","author":"Farr, Fiona, Riordan, Elaine","description":"During the course of pre-and in-service teacher education programmes, reflection can happen in a number of ways, for example: reflective journals, personal stories and pair\/group co-operative discussions, professional development portfolios, and blogs and electronic portfolios. The aim of this paper is to examine various technologies such as online chat, discussion forums and blogs, in terms of their suitability and affordances as reflective media. It begins by examining positional survey data gathered from student teachers (STs) who have used these social media over a period of time. Following this it focuses on one of the desired outcomes of Reflective Practice (RP), the construction of teacher identity as part of the process of becoming a professional. The construction of identity through the mediational tool of language used across these modes is examined through a corpus linguistics lens. Collections of language produced around RP activities are analysed as a corpus in quantitative and qualitative ways. These complementary sources of data in a mixed-methods approach provide some insights into the technologies and their potential in a Language Teacher Education (LTE) context. To this end, our findings suggest that blogs, in particular, foster narration, RP and the expression of identities, while chat and forums promote emotional and affective engagement, all of which can be useful to STs at the initial and continuing stages of their career.","subject":"Teacher Education Programs, Reflection, Online Courses, Web Sites, Computer Mediated Communication, Electronic Publishing, Educational Technology, Social Networks, Reflective Teaching, Language Usage, Mixed Methods Research, Language Teachers, Second Language Instruction, Technology Uses in Education","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null},{"id":"EJ1059671","title":"Language Learner Perspectives on the Functionality and Use of Electronic Language Dictionaries","author":"Levy, Mike, Steel, Caroline","description":"This paper investigates the extent of electronic dictionary use by language learners in an Australian university. All students in the study are formally enrolled in language courses across ten languages at first, second or third year level. The study places a particular emphasis on gauging student perceptions of the beneficial aspects of electronic dictionaries as judged by learners themselves in circumstances where they are able to act independently. As these benefits are often described in terms of &quot;usability&quot; and &quot;functionality,&quot; these particular terms are defined and introduced in the literature review, and then later they are employed to help structure and describe the results. The arguments for the discussion are supported by the use of empirical data taken from a large-scale survey conducted in 2011 (n = 587) where comments from students were obtained on why and how dictionary-type resources were accessed and used (see also Steel &amp; Levy, 2013). The paper restricts itself to the quantitative and qualitative data gathered on mobile phones, translators, dictionaries and web conjugators and related items (e.g. discussion forums). The particular functions that students use and the ways in which they use them are described and categorised, with the discussion supported by student comments. The data exhibits a remarkable range of resources available to students to look up unknown words or to see translations and, consequently, our understanding of what exactly an electronic dictionary might comprise is challenged. Many students' comments demonstrate a sophistication and knowledge about the effective use of these dictionary tools together with a keen awareness of their limitations.","subject":"Second Language Learning, Second Language Instruction, Foreign Countries, Dictionaries, Electronic Publishing, Surveys, Student Attitudes, Language Enrollment, Usability, College Students, Statistical Analysis, Qualitative Research, Telecommunications, Classification","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":"Australia"},{"id":"EJ1074890","title":"Computer-Mediated Communication (CMC) in L2 Oral Proficiency Development: A Meta-Analysis","author":"Lin, Huifen","description":"The ever growing interest in the development of foreign or second (L2) oral proficiency in a computer-mediated communication (CMC) classroom has resulted in a large body of studies looking at both the direct and indirect effects of CMC interventions on the acquisition of oral competences. The present study employed a quantitative meta-analytic approach to investigate such effects by synthesizing (quasi)experimental studies that provide empirical quantitative data for effect size calculation. A literature search located 25 relevant studies for the final analysis. Each study was independently coded for learner, design and publication characteristics. The averaged effect size was estimated from the included studies. The results of the meta-analysis reveal that communication mediated by computer\/technologies produced a moderate positive effect on L2 learners' oral proficiency compared to face-to-face (F2F) communication or no interaction. Furthermore, CMC has roughly similar effect on pronunciation, lexical and syntactic level of oral production; however, it might have a negative impact on fluency and accuracy. This meta-analysis also found that the effect of CMC on oral proficiency depends on several methodological factors such as task type, outcome measurement, treatment length, and assessment task. Major findings of the current meta-analysis include: (1) studies relying on elicited data are superior to those utilizing naturalistic data; (2) reading aloud seems to be the task that could elicit the best oral performance from students; (3) surprisingly, CMC appeared to be harmful for accuracy and fluency; (4) studies that employed decision-making generated the largest effect size, followed by studies that used more than one task type; (5) among the four tasks, jigsaw actually generated a negative effect on oral performance; and (6) as the most popular task employed by primary researchers, opinion-exchange studies produced the smallest effect size. These findings need to be interpreted as exploratory rather than confirmatory since each of them became less trustworthy after taking into consideration numerous other factors such as CMC task and the particular CMC tool used, etc. Future research suggestions are provided and the limitations of this meta-analysis are addressed.","subject":"Computer Mediated Communication, Second Language Learning, Oral Language, Language Proficiency, Intervention, Meta Analysis, Quasiexperimental Design, Effect Size, Literature Reviews, Achievement Gains, Data, Reading Aloud to Others, Accuracy, Reading Fluency, Decision Making, Task Analysis, Competence, Statistical Analysis","source":"ReCALL","publicationdateyear":2015,"identifiersgeo":null}]