[{"title": "Perceptions and Opinions of Students Studying at Primary School Mathematics Teaching Department about the Concept of Mathematics", "author": "Altintas, Esra", "description": "The purpose of this study is get opinions of students on the subject of mathematics. It is thought that determining the meaning of mathematics in students' minds, the things that students associate mathematics with and the things that come to their minds when you say mathematics is vital. In this way, it is thought that it can be possible to take some precautions for enabling students to develop positive attitudes towards mathematics, making mathematics more popular among students and reducing mathematics anxiety. This study is particularly important in terms of taking the opinions of students who will be responsible for teaching mathematics and making students become more interested in mathematics so that they can take necessary precautions before they start teaching at schools. This study is a qualitative research and the data obtained through coding the answers provided by students from the Department of Teaching Primary School Mathematics. Two questions in the opinion form were divided into categories and themes were displayed in tables by given percentages and frequencies. In this sense, content analysis from qualitative data approaches and phenomenology from qualitative research designs were used. The study group consisted of 153 students (from freshman to senior) who are studying at Kafkas University, Faculty of Education, Department of Teaching Primary School Mathematics. It was concluded that students mentioned &quot;nature,&quot; &quot;life&quot;,&quot; &quot;oxygen,&quot; &quot;everything complicated&quot; and &quot;puzzle&quot; for &quot;mathematics,&quot; and they provided answers such as &quot;concepts related to mathematics,&quot; &quot;middle school mathematics teacher&quot; and &quot;everything&quot; for the question stated as &quot;What is the first thing that comes to your mind when we say mathematics?&quot;", "subject": "Student Attitudes, Mathematics Instruction, Departments, Mathematical Concepts, Positive Attitudes, Mathematics Anxiety, Qualitative Research, Content Analysis, Phenomenology, Figurative Language, Mathematics Teachers, Elementary School Mathematics, Foreign Countries, Preservice Teachers, Elementary School Teachers", "source": "Educational Research and Reviews", "publicationdateyear": 2018, "identifiersgeo": "Turkey"}, {"title": "Negative Feedback on Task Repetition: ESL vs. EFL Child Settings", "author": "Azkarai, Agurtzane, Oliver, Rhonda", "description": "Research on task repetition in second language (L2) learning has shown the benefits of this practice for subsequent L2 learning. However, as with much L2 research, most studies on task repetition have focused on adults and there is a dearth of research in this area involving young children. This study examines the effect of task repetition on two forms of negative feedback (NF), recasts and negotiation of meaning (NoM) strategies, available to children in an English as a second language (ESL) setting (Australia) and in an English as a foreign language (EFL) setting (Spain). Participants were 7-8 years old and worked in pairs on a spot-the-differences task at two testing times (time 1 [T1] and time [T2]). Differences were reported in the provision and use of NF from T1 to T2, and between the ESL and EFL group: feedback was provided and used significantly more at T2, and especially by the ESL group, but EFL learners made more errors and used different NoM strategies than ESL learners. The results are discussed in light of recent research on task repetition.", "subject": "Feedback (Response), English (Second Language), Second Language Learning, Second Language Instruction, Foreign Countries, Task Analysis, Elementary School Students, Comparative Analysis, Cross Cultural Studies, Teaching Methods, Error Correction, Testing, Learning Strategies, Educational Benefits", "source": "Language Learning Journal", "publicationdateyear": 2019, "identifiersgeo": "Australia, Spain"}, {"title": "Using \"Second Life\" as a Virtual Collaborative Tool for Preservice Teachers Seeking English for Speakers of Other Languages Endorsement", "author": "Kim, Deoksoon, Blankenship, Rebecca J.", "description": "This study evaluated preservice teachers' professional-knowledge transformation while they participated in simulated professional-development activities via a \"Second Life\" virtual classroom--an Internet-based multiuser virtual environment (MUVE). While a cohort of preservice teachers experienced the MUVE environment, the instrumental exploratory case study highlighted how 2 preservice teachers among the 12 internalized professional knowledge, as well as how that knowledge transferred into active teaching practice. The study was framed around sociocultural theory as it pertains to enabling intramental functioning through co-constructed activities. The preservice teachers' debriefings and reflective statements suggest that they entered the Zone of Proximal Development (ZPD)--the range of potential an individual has for learning, with that learning being shaped by the social environment--indicating the positive potential of using an MUVE to promote self-regulatory pedagogic behaviors. (Contains 6 figures and 2 footnotes.)", "subject": "Virtual Classrooms, Computer Assisted Instruction, Computer Simulation, Video Technology, Data Analysis, Observation, Case Studies, Instructional Effectiveness, Teaching Methods, College Instruction, Language Teachers, Preservice Teachers, English (Second Language), Second Language Instruction, English Language Learners, Preservice Teacher Education, Constructivism (Learning), Self Management, Social Environment, Vignettes, Electronic Learning", "source": "Journal of Educational Computing Research", "publicationdateyear": 2013, "identifiersgeo": null}, {"title": "The Instructional Materials of the Arabic Language Teaching for Non-Arabic Speakers in the Republic of Indonesia: A Typical Study of the State University of Malang, Indonesia", "author": "Yani, Achmad, Ahmad, Siti Sara Binti Haji", "description": "The aim of this research work is to identify the extent of the effectiveness of the Instructional Materials in teaching of the Arabic Language at the State University of Malang in Indonesia. Meanwhile, the two researchers have chosen the State University of Malang in Indonesia as a case study because it is one of the renowned universities in Indonesia and as it takes much interest in Arabic Language Education. Therefore, both researchers evaluated the Arabic Language Instructional Materials adopted in the State University of Malang, Indonesia under the light of Communication Approach in the Arabic Teaching Language where they distributed questionnaires to the teachers of the university concerned in order to get facts on the content about the Arabic Language Instructional Materials therein, then they analyzed them through quantitative and evaluative methods for the purpose of achieving the rightly desired outcome. The Communication Approach in the teaching Arabic for Non-Native Speakers observes that Arabic language is a communication means, and it is necessary that its teaching be made for this purpose. Therefore, the existence of the suitable Instructional Materials which can empower students on the communication skills in Arabic language is a very important issue in the teaching of Arabic language under the light of this approach. Thus, this research paper is a quantitative evaluative work as it exploits quantitative method to identify some facts about the proper instructional materials for Arabic Language Teaching at the State University of Malang in Indonesia from a widest and comprehensive perspective (Obserne, 1977). As for the evaluative method, it has been adopted for the purpose of rendering an accurate objective ruling, on some approaches, processes and products. Consequently, the areas of strengths and weakness are identifiable to facilitate the adoption of suitable resolutions that can rectify the detected points of weakness and failure (Yusuf, 1962). The research has consequently arrived at an outcome that the positive sides of the instructional materials for the Arabic Language teaching in the State University of Malang in Indonesia are visibly apparent as it is grossly equipped with various (audio-visual) teaching aids. Likewise, the majority of the teachers are highly interested in using them during the teaching process, because of its perfection, development and enhanced effectiveness, in addition to the availability of a number of teachers who are well-versed in using them. In regard to the negative sides, it is obviously seen in the manner of oversight of small number of them while using the materials during Arabic Language Teaching. This negative side should be improved in order to acquaint all the teachers of that university with the application of various teaching aids in the teaching procedures, in addition to a big number among them who are not well-versed in using them to some extent. That is a weak side of it which should be improved so as to achieve perfection in Arabic Language teaching at that university in a better way. Likewise, some instruments adopted in the instructional materials are outdated and need to be rectified.", "subject": "Foreign Countries, Instructional Materials, Second Language Instruction, Semitic Languages, College Students, Teaching Methods, Educational Media, Use Studies", "source": "Online Submission", "publicationdateyear": 2018, "identifiersgeo": "Indonesia"}, {"title": "Efficiency of Digital and Non-Digital Educational Games: A Comparative Meta-Analysis and a Meta-Thematic Analysis", "author": "Talan, Tarik, Dogan, Yunus, Batdi, Veli", "description": "The present article attempts to reinterpret the findings of most recent studies investigating effect of using games for teaching purposes. A methodological approach combining a meta-analysis of quantitative data with qualitative ones was adopted in order to present the broadest picture of the current research on educational use of games. To this end, we conducted a meta-analysis of 180 effect size comparisons out of 154 empirical studies on the effect of both digital and non-digital games on academic achievement conducted during the period from 2004 to 2019 in order to determine the overall effect size of using games for teaching various subjects. The overall sample size of the studies included a total number of 12800 participants. Some moderator analyses were also carried out to determine the exact efficiency of educational games in terms of student levels, durations of implementation of game activities, school subjects in which games were used, class sizes, kinds of games and achievement tests used. The findings suggest that educational games have a positive effect on academic achievement and this effect is at a medium level (g = 0.695). The highest effect sizes were observed in foreign language courses (g = 0.87), small (less than 50) class sizes (g = 0.87), and in non-digital games (g = 0.90). Moreover, we conducted a meta-thematic analysis based on document analysis of qualitative studies in order to further consolidate the findings of the meta-analysis. The meta-thematic dimension of our study reveals cognitive contributions as well as drawbacks of game-based teaching, and provides suggestions for conducting educational games in a better way.", "subject": "Educational Games, Game Based Learning, Instructional Effectiveness, Academic Achievement, Educational Research, Effect Size, Second Language Instruction, Small Classes", "source": "Journal of Research on Technology in Education", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "EFL Teachers and Students Raising Their Eyebrows over Portfolio Assessment in Language Classrooms", "author": "Al-Naibi, Is'haq Salim, Al-Hatali, Nasser Rashid, Al-Hadhrami, Marwa Aziz", "description": "The present paper reports on EFL teachers' and students' attitudes, challenges, and suggestions regarding portfolio assessment in language classes at a higher academic institution in Oman. The sample of the study includes six teachers and 108 students. Data was collected through two questionnaires. Analysis of the results reveals that teachers have low attitude levels, compared to students who have moderate attitude levels, towards using portfolios as an assessment tool for students' learning. Also, both teachers and students met various challenges in using portfolios and suggested different changes to the practice. These findings have several implications for language teachers, as well as language institutions, who should consider including all language skills in assessment portfolios. There should be periodic reviews of portfolio completion by the teacher and students. In addition, the findings of this paper suggest considerations for using e-portfolios.", "subject": "Foreign Countries, English Teachers, Second Language Instruction, English (Second Language), Portfolio Assessment, Alternative Assessment, College Faculty, Teacher Attitudes, College Students, Student Attitudes, Language Skills, Evaluation Methods, Student Evaluation", "source": "English Language Teaching", "publicationdateyear": 2019, "identifiersgeo": "Oman"}, {"title": "Classroom Talk in Bilingual Class Interaction", "author": "Puasa, Kuran, Asrifan, Andi, Chen, Yan", "description": "This study reveals how the classroom talk was in the bilingual classroom interaction. The classroom talk comprises teacher and pupil talk--in which they cover teacher's explanation, teacher's question, teacher's feedback, and modification to teacher's speech; as well as pupil's responses and pupil's questions. The research findings show that the language option used by the teachers in the bilingual classroom interaction was influenced by several factors, such as (1) teacher's linguistic competence, (2) the views on the roles of the two languages in the bilingual interaction (3) teacher's interpretation on the instructional language use prescribed by the school management, and (4) the teacher's educational background. The research findings on pupil talk show that the pupils generally adjusted their language option in responding to questions as the language used by the teachers in asking questions. Although the questions were translated into their mother tongue, pupils still assumed that the questions were actually in English. Similarly, the pupils strived to adjust the language of their questions as the language used by the teachers in explaining.", "subject": "Bilingualism, Classroom Communication, School Administration, Feedback (Response), Teacher Student Relationship, Language Usage, Teaching Methods, Translation, English (Second Language), Second Language Learning, Second Language Instruction, Indonesian, Foreign Countries, Error Correction, Bilingual Education, Interviews, Elementary School Teachers, Elementary School Students, Student Attitudes, Teacher Attitudes, Qualitative Research, Discourse Analysis, Observation", "source": "Research in Pedagogy", "publicationdateyear": 2017, "identifiersgeo": "Indonesia"}, {"title": "Building Teacher Capacity in K-12 Computer Science by Promoting Formative Literacy. Whitepaper", "author": "Basu, Satabdi, Rutstein, Daisy W., Tate, Carol", "description": "The rapid expansion of computer science (CS) instruction in primary and secondary education has highlighted the shortage of teachers qualified to teach the subject. A key strategy for building CS teaching capacity has been preparing teachers of other subjects (e.g., math, technology applications, business) to teach introductory CS through short-term professional development (PD) workshops, online training modules, micro-credentials, and teacher meetups or conferences (Christensen Institute, 2019). As various new CS curricula and activities using different computational representations or programming environments are rolled out each year, it can be difficult for teachers to make sense of how they map to CS standards or fit with existing activities. To benefit a wide range of teachers using a variety of CS curricula across different programming languages, CS teacher PD needs to focus on CS standards and CS content and pedagogical knowledge rather than merely the details of a particular curriculum. This white paper details the elements of effective CS education, known teacher challenges in CS education, and the current state of CS teacher PD. It also describes an approach to address some of these teacher challenges and help teachers understand CS standards and develop their CS formative assessment skills. The white paper concludes with recommendations for CS teacher PD design and suggest actions for states and school districts to support CS teachers.", "subject": "Capacity Building, Faculty Development, Computer Science Education, Teaching Methods, Elementary Secondary Education, Teacher Shortage, Teacher Qualifications, Introductory Courses, Standards, Programming Languages, Pedagogical Content Knowledge, Barriers, Educational Needs, Formative Evaluation, School Districts, Curriculum Development, Instructional Effectiveness, Technological Literacy, Kindergarten, Online Courses", "source": "National Comprehensive Center", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Comics for Inclusive English Language Learning: The CIELL App, Supporting Dyslexic English Language Learners", "author": "Joannidou, Shaunna, Sime, Julie-Ann", "description": "As teaching moves increasingly online, language teachers are faced with the challenge of how to support dyslexic students in an inclusive manner in and out of the classroom. This paper will focus on an innovative educational multi-modal, mobile application -- Comics for Inclusive English Language Learning (CIELL) -- supporting upper-intermediate and advanced English as a Foreign Language (EFL) students with dyslexia when faced with language proficiency tests and academic writing tasks. A cyclical educational design research methodology (McKenney &amp; Reeves, 2019) was used to include three cycles of feedback from stakeholders so that their views and suggestions would inform the development of an alpha, beta, and gamma version of the app, thereby maximising practical relevance. The discussion of the quantitative and qualitative feedback is supported by educational design research. [For the complete volume, &quot;CALL and Professionalisation: Short Papers from EUROCALL 2021 (29th, Online, August 26-27, 2021),&quot; see ED616972.]", "subject": "Dyslexia, Student Needs, Teaching Methods, English (Second Language), Second Language Instruction, Cartoons, Telecommunications, Handheld Devices, Technology Uses in Education, Foreign Countries, Program Effectiveness, Writing Assignments, Essays, Language Teachers", "source": "Research-publishing.net", "publicationdateyear": 2021, "identifiersgeo": "United Kingdom, Cyprus, Germany, Greece"}, {"title": "EFL Virtual Learning Environments: Perception, Concerns and Challenges", "author": "Dayag, Joseph Decena", "description": "Virtual Learning Environment (VLE) is a fad in the 21st century academic landscape. A number of studies found out that students perceive VLEs positively and that VLEs facilitate learning English as a Foreign Language (EFL) and provide an avenue for educators to extend a helping hand to their EFL students. Sustaining VLEs is not an easy task as it raises various concerns and challenges, particularly in the domain of EFL learning. This paper reports on the results of a qualitative study aimed to shed light on the stakeholders' perception towards VLE as well as the significant concerns and challenges encountered by EFL lecturers and their students on their actual use of VLEs in a higher education institution. Furthermore, the study unveiled the practical tips to create efficient and effective VLEs, based on the suggestions of both the EFL students and their lecturers.", "subject": "Computer Simulation, English (Second Language), Second Language Learning, Second Language Instruction, Teaching Methods, College Students, College Faculty, Language Teachers, Barriers, Foreign Countries, Educational Benefits, Student Attitudes, Teacher Attitudes", "source": "Teaching English with Technology", "publicationdateyear": 2018, "identifiersgeo": "Oman"}, {"title": "Learners&apos; Perceptions on Peer Assessment in Team-Based Learning Classroom", "author": "Chorrojprasert, Linchong", "description": "Focusing on the perceptions of learners on their peer assessment experiences, this study -- a case study in nature -- was conducted with mixed methods approach with the aim to shed light on how peer assessment, a prominent characteristic of team-based learning classroom, could enhance the learners' performance and learning skills, in particular the soft skills deemed most beneficial and essential in most professions. Data collection instruments employed included a survey questionnaire and a focus group session. Participants in the study included 18 graduate students of mixed nationalities in an English Language Teaching (ELT) required course. Findings from the study confirmed most of the proffered benefits of peer assessment on learners' improvement of knowledge and skills, and further raised some issues related to individual constraints in assessment and class preparation. Furthermore, recommendations for further study and instructional implications were discussed to provide guidance for those who share similar teaching contexts and are keen to embrace these teaching challenges.", "subject": "Student Attitudes, Positive Attitudes, Peer Evaluation, Formative Evaluation, Feedback (Response), Teamwork, Cooperative Learning, Soft Skills, Skill Development, Graduate Students, Asians, English (Second Language), Second Language Instruction, Teacher Education", "source": "LEARN Journal: Language Education and Acquisition Research Network", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Scale of Vocabulary Learning Strategies for Learners of Turkish as a Foreign Language: A Scale Development Study", "author": "Melanlioglu, Deniz", "description": "It does not seem to be possible to teach all the words needed by learners of Turkish as a foreign language in the target language just through classroom applications. Thus, students should be taught vocabulary learning strategies that will contribute to their independent learning and raise their awareness of vocabulary learning processes. In this regard, the purpose of the current study is to develop a scale to determine the vocabulary learning strategies used by learners of Turkish as a foreign language. The data of the current study were collected from a total of 507 students attending Turkish teaching centres in five different cities of Turkey. In the development of the scale, all stages of scale development process were followed and then the required reliability calculations were performed. On the basis of the scores obtained from the scale, exploratory and confirmatory factor analyses were conducted to test the construct validity of the scale. As a result of the factor analysis, it was found that the scale consists of four factors that are &quot;learning process&quot;, &quot;technological material&quot;, &quot;psychological process&quot; and &quot;visual materials&quot; and its Cronbach Alpha internal consistency value was calculated to be 0.86. After the completion of all the stages of scale development, a 23-item scale whose psychometric features had been examined was developed to be used to determine students' vocabulary learning strategies.", "subject": "Turkish, Second Language Instruction, Vocabulary Development, Second Language Learning, Learning Strategies, Foreign Countries, Foreign Students, Cognitive Processes, Visual Aids, Instructional Materials, Educational Technology", "source": "Educational Research and Reviews", "publicationdateyear": 2020, "identifiersgeo": "Turkey"}, {"title": "Guidelines or Commandments? Reconsidering Core Principles in Extensive Reading", "author": "Macalister, John", "description": "In this article, John Macalister draws attention to the fact that the term &quot;extensive reading&quot; can have multiple meanings. It has been used to include breadth of reading and time spent reading, as well as both amount of new reading and amount of text read. It is, therefore, perhaps unsurprising that teachers can hold differing views as to the nature of extensive reading and that it manifests itself in different ways in the classroom, if it is present at all. Given the confusion that can exist, Macalister attempts to add clarity to the guidelines of the ten principles proposed by Day and Bamford (2002). Extensive reading is not a difficult concept but suffers at times from being differently understood by teachers and researchers, leading to some confusion in the literature surrounding it, and at other times suffers from attempts to over-complicate it. In this paper Macalister has tried to de-mystify extensive reading, drawing on--and reducing in number--the principles proposed by Day and Bamford (2002) over a decade ago as these principles continue to provide a sound basis for understanding and implementing successful reading practices in the language classroom.", "subject": "Guidelines, Reading Instruction, Teaching Methods, Second Language Learning, Second Language Instruction, Reading Habits, Reading Processes, Reading Materials, Reading Material Selection, Curriculum Design", "source": "Reading in a Foreign Language", "publicationdateyear": 2015, "identifiersgeo": null}, {"title": "The Comparative Effect of Teaching Collocations through Literary vs. Non-Literary Content on EFL Learners", "author": "Saedpanah, Elahe, Dastgoshadeh, Adel", "description": "This study investigates the comparative effect of teaching collocations through practicing them in literary and non-literary contents. The participants were composed of 30 EFL students selected from a cohort of 52 intermediate students in an English language institute in Sanandaj City, Iran. They were selected based on their scores on the Preliminary English Test (PET) and a collocation test, developed and piloted in advance. The selected participants were randomly divided into two experimental groups. Collocations were taught through literary content in one group; the others were instructed via non-literary content. At the end of the period of treatment with both groups, a collocation test was administered to both groups as a posttest. The analysis of collected data, using One-way ANCOVA and Descriptive Statistics, reveals that teaching the new collocations through literary contents proved significantly more effective than teaching them through non-literary contents.", "subject": "Phrase Structure, English (Second Language), Second Language Learning, Second Language Instruction, Pretests Posttests, Teaching Methods, Language Tests, Experimental Groups, Foreign Countries, Comparative Analysis, Literature, Scores, Instructional Effectiveness", "source": "HOW", "publicationdateyear": 2019, "identifiersgeo": "Iran"}, {"title": "Investigating English Teachers Perceptions and Practices of TBLT in Three Secondary Schools in Awi Zone", "author": "Addis, Ketema, Yigzaw, Abiy", "description": "The purpose of this study was to investigate teachers' perceptions and practices of Task-Based Language Teaching (TBLT) in Awi zone three secondary schools. The data for this study were collected through questionnaires from a total of 32 teachers at three secondary schools in Awi zone. The sample of the study was taken by using convenience sampling method. In order to gather data from the subjects of the study; questionnaire, interview and class room observation were used. The internal consistency of the questionnaire proved by Cronbach's alpha. Both qualitative and quantitative methods of data analysis were employed. SPSS version 17.0 Windows was used to analyze the results of the questionnaire. One sample t-test was used to assure whether the observed and the expected mean score differences were significant. The statistical data analysis was descriptive and inferential. Frequency, a percentage analysis and mean scores were used. The data that was gathered from the class room observation and interview were qualitatively analyzed. The analysis provided qualitative data which is exploratory, explanatory and interpretive in nature. Findings of the study revealed that the study of perceptions and their practices demonstrated that TBLT has not been implemented successfully within three secondary schools in Awi zone as teachers have only limited perception and incomplete practice of its theories and methodologies. The challenges and possibilities towards the implementation of TBLT in the class room are identified. Finally, some recommendations were forwarded based on the main findings of the study.", "subject": "Foreign Countries, Teacher Attitudes, Secondary School Teachers, Teaching Methods, English (Second Language), Second Language Instruction, Language Teachers, Instructional Effectiveness, Learning Activities, Communication Skills, Observation, Student Evaluation", "source": "Asian Journal of Contemporary Education", "publicationdateyear": 2018, "identifiersgeo": "Ethiopia"}, {"title": "Teachers&apos; Perceptions on Using Smartphones in Teaching English as a Foreign Language Context", "author": "Alzubi, Ali", "description": "This study explored the perceptions of English as a foreign language (EFL) teachers at a foundation year in a university in Saudi Arabia. Forty-one (27 males and 14 females) teachers completed a survey using Google Forms. The results indicated that the majority of teachers (83%) supported the integration of smartphones in EFL context, in which 71% believed that smartphones would enhance students' EFL learning. 72% reported that they used smartphones for university-related work: sending and receiving emails, accessing the internet, and using educational applications were the most reported beneficial features whereas scanning/creating QR codes, using calculator, playing games, and playing a podcast were the least reported.79 % believed that smartphones would have instructional benefits for learners such as access to technology, motivation, creativity, English language learning opportunities, and variation in instruction, whereas 58 % did not notice any barriers in the use of smartphones in EFL context. That smartphones might distract students' attention was the only reported barrier. Recommendations and implications for further research and applications were suggested.", "subject": "Foreign Countries, English (Second Language), Second Language Instruction, Language Teachers, College Faculty, Teacher Attitudes, Telecommunications, Handheld Devices, Educational Technology, Technology Uses in Education, Teaching Methods, Barriers, Program Effectiveness", "source": "Research in Social Sciences and Technology", "publicationdateyear": 2019, "identifiersgeo": "Saudi Arabia"}, {"title": "Enhancing Poor Readers&apos; Reading Comprehension Ability through Word Semantic Knowledge Training", "author": "Dong, Yang, Chow, Bonnie Wing-Yin, Wu, Sammy Xiao-ying, Zhou, Jian-Dong, Zhao, Ya Man", "description": "Word semantic knowledge (WSK) is crucial to the development of one's reading comprehension ability. A total of 608 students (208 poor readers in the experimental group and 200 poor readers in the control group one, and 200 typical readers in control group 2) from grade 4 participated in this study. Selected reading ability assessments were administered at pretest, post-test and a 3-month delayed post-test. After 6 weeks of intervention, poor readers from the experimental group scored higher in Chinese reading abilities than the poor readers in control group one. Experimental group students reached a similar level of reading abilities with typical readers. Findings from this study suggested the main challenge in reading activities for those students who had reading problems is the characters' semantic identification. The current study confirmed the self-agency learning mode is an effective approach to semantic intervention design on semantic network construction for primary school learners.", "subject": "Reading Difficulties, Reading Skills, Reading Comprehension, Semantics, Teaching Methods, Knowledge Level, Grade 4, Elementary School Students, Intervention, Reading Instruction, Chinese, Foreign Countries, Receptive Language, Vocabulary, Word Recognition, Inferences", "source": "Reading & Writing Quarterly", "publicationdateyear": 2021, "identifiersgeo": "China"}, {"title": "The Relationship between Technology Integration and Teacher Pedagogical Beliefs", "author": "Rains, Barbara", "description": "Although research indicates that conditions for effective technology integration appear to be in place, teachers still face challenges in adapting their instruction to new technologies. As more technology is integrated, the added value for students will depend on how effectively a teacher integrates technology. Given that technology may not be integrated unless it complements teachers' educational beliefs, it is critical for educators to enhance their understanding of this relationship to effectively support 21st century teaching and learning. The purpose of this study was to explain whether there was a relationship between effective technology integration in middle school instruction and teachers' pedagogical beliefs utilizing a mixed methods correlational design. A non-probability convenience sampling of all middle school language arts, science, math, and social studies teachers in a suburban Chicago elementary school district was surveyed utilizing a Likert-like survey developed by the researcher and selected questions from the Teaching, Learning, and Computing survey and Measure of Perceived Technology Integration Knowledge of Teachers questionnaire. Administration of the survey was followed by structured interviews with selected teachers. The results of this study were intended to provide an enhanced understanding of teacher beliefs related to the role and value of technology integration to more effectively support 21st century teaching and learning. [The dissertation citations contained here are published with the permission of ProQuest LLC. Further reproduction is prohibited without permission. Copies of dissertations may be obtained by Telephone (800) 1-800-521-0600. Web page: http://www.proquest.com/en-US/products/dissertations/individuals.shtml.]", "subject": "Correlation, Information Technology, Technology Integration, Teacher Attitudes, Middle School Teachers, Teaching Methods, Language Arts, Mathematics Teachers, Science Teachers, Social Studies, Knowledge Base for Teaching", "source": "ProQuest LLC", "publicationdateyear": 2018, "identifiersgeo": "Illinois (Chicago)"}, {"title": "Language Learners&apos; and Teachers&apos; Perceptions of Task Repetition", "author": "Ahmadian, Mohammad Javad, Mansouri, Seyyed Abbas, Ghominejad, Shiva", "description": "This study examined how English language learners and teachers perceive and interpret task repetition (TR), and whether teachers' and learners' views about this pedagogic practice correspond. In addition, the study explored learners' cognitive and affective engagement with TR. We asked eight experienced language teachers to use a structured picture description task in their classes and then to repeat it after a one-week interval. Immediately after the second task performance, all eight language teachers and 21 language learners who had performed the two tasks participated in semi-structured interviews. The results of thematic analysis revealed that although students' and teachers' views about TR were similar in many respects, there were important issues on which teachers' and learners' perceptions and interpretations differed widely. We also found evidence demonstrating that learners were cognitively and affectively engaged in TR.", "subject": "Second Language Learning, Second Language Instruction, Semi Structured Interviews, Student Attitudes, Language Teachers, Task Analysis, Affective Behavior, Teacher Attitudes, Pictorial Stimuli, Teaching Methods, English (Second Language)", "source": "ELT Journal", "publicationdateyear": 2017, "identifiersgeo": null}, {"title": "Mitigation of Disagreement in Peer Review among L2 Learners and Native Speakers in a College Writing Class (Mitigación del Impacto de las Opiniones de Desacuerdo en el Proceso de Revisión por Pares entre Estudiantes de una Segunda Lengua y Hablantes Nativos en una Clase de Escritura a Nivel Universitario)", "author": "Christoffersen, Katherine O'Donnell", "description": "Peer review is now a commonplace practice in process-oriented writing instruction. A crucial aspect of peer review is assessing another classmate's work, which encompasses the act of disagreement. Given its prevalence in the classroom, it is necessary to analyze how L2 learners mitigate disagreement in the context of peer review with other L2 learners and native speakers. The present paper presents a qualitative analysis of action research from an introductory English writing class at the university level including native speakers of English and international students from different linguistic and cultural backgrounds. The conversation-based peer review sessions were analyzed for various mitigation strategies including token agreement, hedging, prefacing positive remarks and requests for clarification. The analysis shows that L2 learners and native speakers of English use similar mitigation strategies, and it demonstrates the co-construction of meaning in peer review interactions.", "subject": "Peer Evaluation, Second Language Learning, Native Speakers, English (Second Language), Second Language Instruction, Qualitative Research, Cultural Differences, Cultural Background, Introductory Courses, Incidence, Process Approach (Writing), Writing Instruction, Action Research, College Students, Teaching Methods, Language Usage, Pragmatics, Foreign Students, Classification", "source": "GIST Education and Learning Research Journal", "publicationdateyear": 2015, "identifiersgeo": null}, {"title": "Advising in Language Learning and the Support of Learners&apos; Basic Psychological Needs: A Self-Determination Theory Perspective", "author": "Shelton-Strong, Scott J.", "description": "In this article self-determination theory (SDT) is used as a framework to explore ways in which 'advising in language learning' (advising) can be understood to support language learners' basic psychological needs of autonomy, competence and relatedness. These are defined in SDT as nutrients essential for integration, growth, healthy development and well-being (Ryan &amp; Deci, 2017). SDT posits that social learning contexts in which learners' basic psychological needs are supported facilitate and sustain autonomous functioning, more effective learning and performance, strengthen adaptability, promote awareness, and foster greater wellness (Reeve, 2016; Ryan &amp; Deci, 2017; Vansteenkiste et al., 2019). While a growing body of research provides insight into ways advising promotes and is supportive of autonomous language learning and transformation (Kato &amp; Mynard, 2016; Mynard, forthcoming), more specific studies are believed to be needed to develop a deeper understanding of the potential of its supportive role in this area. To address this gap, this study investigates how learners' perceptions of their experiences in advising can be understood from an SDT perspective. Findings from a qualitative analysis of a self-reporting questionnaire suggests that participation in advising has potential to provide support for the satisfaction of language learners' basic psychological needs. Drawing on the theoretical underpinnings of SDT to interpret this evidence within the context of one-to-one advising, the author argues that advising in language learning can play an important role in providing an autonomy-supportive climate which can foster satisfaction of learners' needs for autonomy, competence and relatedness.", "subject": "Psychological Needs, Learning Theories, Student Attitudes, Self Determination, Learning Experience, Academic Advising, Guidelines, Personal Autonomy, Second Language Learning, Second Language Instruction, Socialization, Independent Study, Well Being, Transformative Learning, Private Colleges, Undergraduate Students, Foreign Countries, English (Second Language), College Second Language Programs, Language Usage, Counseling Effectiveness, Institutional Mission", "source": "Language Teaching Research", "publicationdateyear": 2022, "identifiersgeo": "Japan (Tokyo)"}, {"title": "An Advanced Fairy-Tale Course: Text Selection, Assignments, and Student Feedback", "author": "Schenker, Theresa", "description": "This article describes an advanced German course focusing on the German fairy-tale tradition. Course components are summarized and the themes and selected fairy tales for each unit are outlined. Additionally, 12 creative assignments are explained that were designed to foster students' engagement with the language and content of the fairy tales. The article also presents results from a feedback survey in which students summarized their reasons for taking the course, evaluated the individual course components, provided their perceptions of the assignments and course topics, and discussed the assignments' perceived effects on the development of their advanced German skills. The student feedback can help instructors who are interested in creating a course on fairy tales understand students' preferences for themes and assignments that best support student learning.", "subject": "Fairy Tales, Advanced Courses, German, Second Language Learning, Second Language Instruction, Assignments, Feedback (Response), Units of Study, Course Descriptions, Student Attitudes, Teaching Methods, Preferences, Outcomes of Education, Skill Development, Language Skills, Reading Material Selection, Creative Activities", "source": "Unterrichtspraxis/Teaching German", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "The Effectiveness of App-Based Language Instruction for Developing Receptive Linguistic Knowledge and Oral Communicative Ability", "author": "Loewen, Shawn, Isbell, Daniel R., Sporn, Zachary", "description": "Hundreds of millions of language learners around the globe study a second language with popular apps such as Duolingo, Rosetta Stone, Busuu, and Babbel. This study examined the effectiveness of one app, Babbel, for developing both receptive linguistic knowledge of vocabulary and grammar, as well as oral communicative ability in Spanish as a second language. Fifty-four English speakers not enrolled in Spanish classes studied Spanish on Babbel over the course of 12 weeks, with a goal of studying roughly 10 min per day. Participants completed pretests and posttests, and provided data on their motivation to learn Spanish and use Babbel. Results showed that learners were able to develop grammar and vocabulary knowledge as well as oral communicative ability. The amount of Babbel study time was the strongest predictor for all three measures, with motivation to learn Spanish also significantly predicting growth in oral communicative ability.", "subject": "Oral Language, Communicative Competence (Languages), Second Language Learning, Second Language Instruction, Teaching Methods, Predictor Variables, Computer Software, Spanish, Instructional Effectiveness, Computer Assisted Instruction, Pretests Posttests, Receptive Language, Vocabulary Development, Grammar, Learning Motivation", "source": "Foreign Language Annals", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "The Effects of Vocabulary Enhancement Exercises and Group Dynamic Assessment on Word Learning through Lexical Inferencing", "author": "Bahramlou, Khosro, Esmaeili, Adel", "description": "The study aimed to explore the effect of group dynamic assessment on word learning through lexical inferencing and to compare it to that of vocabulary enhancement exercises. Through purposive sampling, 45 intermediate EFL learners were selected as participants and randomly assigned to three groups. The participants read six texts over a 6-day period and answered comprehension questions for each text. In the second phase of each treatment session, the first group engaged in lexical inferencing of the underlined words within group dynamic assessment framework. The second group did two vocabulary exercises for each target word. The third group engaged in lexical inferencing of target words through group dynamic assessment framework and also did one vocabulary exercise for each target word. Vocabulary Knowledge Scale (Wesche and Paribakht in Can Mod Lang Rev 53:13-40, 1996) was used to measure learners' knowledge of the target words 1 day prior to the treatment and 1 day and 28 days after the treatment. The results showed that in terms of gains in depth and size of vocabulary knowledge the first and the second groups were not significantly different. However, the third group significantly outperformed the first and the second groups. It was concluded that group dynamic assessment is as effective as vocabulary exercises in enhancing word learning through lexical inferencing and that the combination of group dynamic assessment and vocabulary exercises could enhance word learning through lexical inferencing even more.", "subject": "Vocabulary Development, Inferences, English (Second Language), Second Language Learning, Second Language Instruction, Evaluation Methods, Teaching Methods, Comparative Analysis, Psycholinguistics, Achievement Gains", "source": "Journal of Psycholinguistic Research", "publicationdateyear": 2019, "identifiersgeo": null}, {"title": "Assessment of &quot;Scratch&quot; Programming Language as a Didactic Tool to Teach Functions", "author": "Quevedo Gutiérrez, Eduardo, Zapatera Llinares, Alberto", "description": "The objective of this research is to study the &quot;Scratch&quot; programming language as a didactic tool to teach functions. The introduction of didactic tools allowing comprehension in simple and attractive ways is required. Given the traditional teaching/learning system, it is necessary to organize participatory and collaborative dynamic classrooms, which allow the interaction of students in activities where the educator modifies his or her traditional role as an advisor and the students take a more active role in learning through their own effort. In this sense, three activities using the &quot;Scratch&quot; programming language are proposed: the first one refers to the linear and affine functions, while the second one deals with the quadratic function and the third one is related to the exponential function. The participants in this study were 30 future teachers. The study considers the combination of magisterial lessons and active didactic methodologies as demonstration method, cooperative learning and gamification, also including the applied assessment. The activities, methodologies and assessment were evaluated by the participants with results higher than 4 in 5-point Likert scale for all cases, preferring the active methodologies than magisterial lessons.", "subject": "Mathematics Instruction, Teaching Methods, Programming Languages, Mathematical Concepts, Mathematics, Computation, Thinking Skills, Learning Activities, Preservice Teachers, Cooperative Learning, Game Based Learning, Mathematics Activities, Foreign Countries", "source": "Education Sciences", "publicationdateyear": 2021, "identifiersgeo": "Spain"}, {"title": "New Language Learning Environment: Employers&apos;-Learners&apos; Expectations and the Role of Teacher 4.0", "author": "Peredrienko, Tatiana, Belkina, Oxana, Yaroslavova, Elena", "description": "The research attempts to reveal distinctive features of four basic patterns of the educational paradigm; aims at investigating the role of a teacher in a new language-learning environment and finding a new approach to education for a &quot;Teacher 4.0&quot; to conform to technology-related changes in the society and, consequently, to employers' expectations. The data were collected and analysed via mixed research methods based on three stages, which allow revealing the needs of learners and employers, validating the learners' skills to be formed, determining the ways for demanded skills formation and outlining the role of a teacher in the new learning environment. The findings identify that the most demanded skills for new learners are digital literacy and critical thinking. The last one along with problem-solving are of great interest to employers as the most significant educational stakeholders. These skills make a core set sought after by a professional market. Based on received data, the functions of a teacher in the formation of these skills are stated and the educational environment for foreign language teaching is presented.", "subject": "Second Language Learning, Educational Environment, Expectation, Teacher Role, Educational Change, Technology Uses in Education, Student Attitudes, Employer Attitudes, Technological Literacy, Critical Thinking, Problem Solving, Skill Development, College Students, English for Special Purposes", "source": "International Journal of Instruction", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "TV Discourse, Grammaticality, and Language Awareness", "author": "Werner, Valentin", "description": "English-language, and especially US-American TV series have been identified as a major point of contact with the target language for learners of English as a Foreign Language, and the discourse represented there constitutes authentic material that is easily accessible. While the potential of using TV discourse in language education has been widely recognized for aspects such as listening comprehension and vocabulary development, the area of grammar has remained less well investigated. This may be due to the fact that TV discourse, which regularly aims to approximate spoken usage, stereotypically has been associated with &quot;ungrammatical&quot; content in terms of highly informal and non-standard usage. The present study explores sections of the &quot;TV Corpus&quot; to assess the actual presence of such usage (e.g. hedges like &quot;sort of,&quot; &quot;ain't&quot; as a negator, double comparatives, etc.). From a language-educational perspective, it is suggested that TV discourse is well suited to illustrate different kinds of grammaticality and appropriateness in specific registers in a contextualized manner, with a particular view on informal spoken usage, a topic commonly considered underrepresented in language-pedagogical practice. It is further argued that grammaticality and appropriateness may differ across varieties of English as represented in TV discourse and that engaging with these issues will help to raise students' language awareness.", "subject": "Discourse Analysis, Television, Programming (Broadcast), Second Language Learning, Second Language Instruction, English (Second Language), Grammar, Nonstandard Dialects, Computational Linguistics, Language Usage, Language Styles, Metalinguistics, Teaching Methods", "source": "TESL-EJ", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "Translanguaging and the Writing of Bilingual Learners", "author": "Velasco, Patricia, García, Ofelia", "description": "This article makes the case for using translanguaging in developing the academic writing of bilinguals. It reviews the emerging literature on learning and teaching theories of translanguaging and presents theoretical understandings of biliteracy development and specifically on the teaching of writing to bilingual learners. The article analyzes five written texts produced by young bilingual writers in which translanguaging is used in the planning, drafting, and production stages of writing. It analyzes how and why translanguaging is used, as well as the effect it has in the development of writing and of voice. Translanguaging in writing is here proposed more as a self-regulating mechanism in which bilingual students can engage, rather than a pedagogy to be used in the teaching of writing itself. That is, the objective of this writing is not translanguaging itself, but the writing in one or the other constructed academic language that is the object of learning in school. Yet, the article makes it clear that even to develop the monolingual voice in writing that schools--and even bilingual schools--expect, a translanguaging approach has the most potential.", "subject": "Bilingualism, Code Switching (Language), Academic Discourse, Writing Instruction, Learning Theories, Teaching Methods, Second Language Instruction, Second Language Learning, Language Usage, English (Second Language), Spanish, Korean, Korean Americans, Elementary School Students, Linguistic Theory, Language Research, Metacognition, Case Studies, Vocabulary Development, Writing Processes, Diaries", "source": "Bilingual Research Journal", "publicationdateyear": 2014, "identifiersgeo": "New York"}, {"title": "Creative Collaborations in Adult ESL Classrooms: Three Community Language Tutors&apos; Pre-Understandings, Contradictions, and Growth Points", "author": "Shufflebarger, Amanda", "description": "This study draws upon Mindful L2 Teacher Education (Johnson &amp; Golombek, 2016) to explore how volunteer community tutors of adult English as a Second Language (ESL) conceptualize and enact their roles as creative teachers. Through three case studies, I explore community language teachers' preunderstandings, contradictions, and growth points. Findings revealed that tutors felt obligated to use survival ESL and grammar-based frameworks for teaching. Contradictions included their frustration with inconsistent student attendance, their fatigue creating lessons, and their feelings of isolation. Research on teacher education for community volunteers is important so that volunteers feel emotionally and pedagogically supported as they commit to teaching learners who otherwise might not have access to language instruction, including adults with immigrant and refugee backgrounds.", "subject": "Second Language Learning, Second Language Instruction, English (Second Language), Volunteers, Tutors, Creative Teaching, Language Teachers, Adult Education, Case Studies, Grammar, Teaching Methods, Immigrants, Refugees, Attendance, Fatigue (Biology), Teacher Attitudes, Psychological Patterns, Professional Isolation, Metacognition, Dialogs (Language), Teacher Education, Literacy Education, Lesson Plans", "source": "L2 Journal", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Expanding Teacher Candidate Linguistic Knowledge: Analysing Recorded Virtual Exchange Sessions", "author": "Hilliker, Shannon M., Lenkaitis, Chesla Ann, Ramirez, Angie", "description": "Teaching English to Speakers of Other Languages (TESOL) teacher candidates must have a working knowledge of English linguistics in order to support their students' language development. This article reports on TESOL teacher candidates' reflective practice to highlight how interaction with non-native speakers can develop awareness of linguistic features of the English language through virtual exchange. Sixteen teacher candidates from a university in the United States were paired with 22 undergraduate English as a Foreign Language (EFL) learners from a university in Mexico. The teacher candidates completed journal entries in which they analysed authentic language produced by their EFL partners during their virtual meetings. Teacher candidates were taking a course that covered topics related to pragmatics, semantics, morphology, phonology and syntax. Each teacher candidate submitted a final error analysis of recorded conversations to determine how many linguistic errors were made by their partners. This study describes the errors the teacher candidates were able to identify in order to explore the benefits of this reflective activity on their understanding of linguistics. This study confirms the need to utilize virtual exchange in teacher preparation programs and subsequent self-reflection in order to give teacher candidates a way to put linguistic content area into practice.", "subject": "Preservice Teachers, Teacher Education Programs, Second Language Learning, Second Language Instruction, English (Second Language), Intercultural Communication, Pragmatics, Semantics, Morphology (Languages), Phonology, Foreign Countries, Universities, Error Analysis (Language), Undergraduate Students, Syntax, Linguistics, Knowledge Base for Teaching, Pedagogical Content Knowledge, Journal Writing, Mexicans, Metalinguistics, Student Attitudes, Teacher Student Relationship, Exchange Programs, Computer Mediated Communication, Teaching Methods", "source": "The EUROCALL Review", "publicationdateyear": 2021, "identifiersgeo": "Mexico"}, {"title": "Discussing Dependencies of Variable Points on the Basis of a &quot;GeoGebra&quot; Task: Meaning Making in a Teacher-Class Dialogue", "author": "Gíslason, Ingólfur", "description": "In this article, I present a meaning-making trajectory of a teacher-class dialogue on digital, dynamic, geometric-functional tasks in an Icelandic upper-secondary classroom of low-attaining students. Learning is seen from a dialogical perspective, as taking up a more mathematical discourse, which here revolves in particular around the language of variables, functions, and Cartesian co-ordinates to describe and construct interactive graphical situations with dynamic geometry software. In the teacher-class dialogue, descriptions of the graphical situations are debated and developed, building on everyday language and intuitions, expanded with more mathematical ways of expression. The main types of discourse identified were (1) in terms of magnitudes and speed, (2) in terms of goal-directed behavior, (3) in terms of vague invariants, (4) in terms of relations between specific points, and (5) in terms of canonical mathematics. The teacher appreciating the students' discourses while prompting for more precision and suggesting specializing was instrumental in eliciting types (4) and (5). The dialogue illustrates the highly non-linear nature of mathematics learning and the complex work it takes to establish shared meanings.", "subject": "Foreign Countries, Classroom Communication, Secondary School Students, Low Achievement, Dialogs (Language), Mathematics Instruction, Educational Technology, Technology Uses in Education, Computer Software, Geometry, Graphs, Discussion (Teaching Technique), Secondary School Teachers, Secondary School Mathematics", "source": "Digital Experiences in Mathematics Education", "publicationdateyear": 2021, "identifiersgeo": "Iceland"}, {"title": "An Investigation of Metaphoric Cognition of First-Year College Students at Xinxiang Medical University, China", "author": "Ran, Zhang, Dhamotharan, Mogana", "description": "The &quot;College English Teaching Reform Project&quot;, issued by the Chinese Ministry of Education aims to strengthen the practical English instruction and improve the English language proficiency of the college students (Ministry of Education, 2007). However, the problem of &quot;naturalness&quot; in handling English by the college students still exists due to imbalanced language forms and concepts between their native language (Chinese) and target language (English). Since metaphor was referred to as only a figure of speech and often compared with simile in high schools, many students do not realize that it also can be a powerful cognitive tool. In order to ascertain the students' metaphor cognition competence in General English and Medical English, a metaphor cognition questionnaire was distributed in a class and the results obtained show that the respondents can readily recognize the existence of metaphors in General English and the teachers' instruction, and they know the essential function of metaphors. The results further show that many respondents understand metaphors in terms of the context rather than the images. However, only about half of them can effectively use metaphors in their writing and speaking.", "subject": "Medical Education, Chinese, Native Language, English (Second Language), Second Language Learning, Second Language Instruction, Language Teachers, Figurative Language, Schemata (Cognition), Educational Change, Program Descriptions, Language Proficiency, English for Academic Purposes, Student Attitudes, Context Effect, Visual Aids, Undergraduate Students", "source": "English Language Teaching", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "Exploring Teaching Academic Literacy in Mathematics in Teacher Education", "author": "Helstad, Kristin, Solbrekke, Tone Dyrdal, Wittek, Anne Line", "description": "Living in complex knowledge societies requires citizens who master multiple literacies involving both cognitive and social skills. Thus, all individuals should be offered relevant educational opportunities and teachers capable of integrating subject expertise with relational aspects. This paper demonstrates a teaching design for mathematics that student teachers have indicated integrates both these dimensions. Drawing on theoretical perspectives that conceptualize academic literacy as a socially situated discourse practice, we investigate one teacher educator's teaching design for mathematics. The evidence indicates that the teaching approaches in this design are highly student centered and process oriented. Student teachers report that the approach supports both individual and collective learning of the discipline of mathematics while also modeling how to teach mathematics as a school subject. The teaching design comprises varied and exploratory approaches to teaching mathematics and represents an alternative to more traditional mathematics pedagogy. In this way, the study contributes to an empirically informed understanding of how the goal of learning to master academic literacy may be facilitated by a varied repertoire of writing, reading, and oral activities. The study indicates challenges for traditional teaching and teacher education more broadly.", "subject": "Academic Language, Literacy, Mathematics, Mathematics Instruction, Foreign Countries, Teacher Education Programs, Writing Instruction, Multiple Literacies, Secondary Education, Student Teachers, Preservice Teacher Education, Teacher Educators, Design, Teaching Methods", "source": "Education Inquiry", "publicationdateyear": 2017, "identifiersgeo": "Norway"}, {"title": "Seeing the Science", "author": "Vaughn, Meredith Houle, Gatling, Anne", "description": "English language learners (ELLs) bring a wealth of knowledge to science classrooms, yet often that knowledge is untapped by traditional instruction and assessment. As classrooms become increasingly diverse, it is critical to recognize the depth of understandings ELLs bring to classrooms to explain the scientific world around them. English language learners are faced with two challenges in the science classroom: learning subject matter and learning English. Research suggests that integrating inquiry-based science and language acquisition into the instruction may enhance learning in both domains. Observing scientific phenomena over time, like a plant or butterfly life cycle, provides a rich opportunity for ELLs to both practice writing and learn science. However, it can sometimes be difficult to see science content within the context of a struggling writer&apos;s scientific observations. Through the authors work in science classrooms with ELL students in an inclusive second-grade classroom they developed a rubric to assess ELL students&apos; written observations of two plants growing over time. Specifically, they focused on the types of scientific observations made by students. They used this rubric, presented in this article, to analyze the writing of three students and suggest key instructional strategies to support student learning.", "subject": "English Language Learners, Inquiry, Language Acquisition, Plants (Botany), Observational Learning, Grade 2, Scoring Rubrics, Teaching Methods, Science Activities, Science Achievement, Educational Strategies, Writing Achievement, Writing Evaluation, Academic Standards, Student Writing Models, Science Instruction, Behavioral Objectives, Student Journals", "source": "Science and Children", "publicationdateyear": 2013, "identifiersgeo": null}, {"title": "Extended Icebreaker", "author": "Barrett, Alex", "description": "Icebreakers are first-day activities that are meant to give students and the teacher an opportunity to get to know one another. They are helpful activities for taking a class full of strangers and turning them into friends (or at least acquaintances). However, icebreaker activities tend to be short and limited in the extent to which students can interact. This article describes one activity that crosses a variety of contexts and levels most recently at the university level in China.", "subject": "Learning Activities, English (Second Language), Second Language Learning, Second Language Instruction, College Students, Classroom Communication, Peer Relationship, Foreign Countries", "source": "English Teaching Forum", "publicationdateyear": 2019, "identifiersgeo": "China"}, {"title": "Teaching Writing to Junior High School Students: A Focus on Challenges and Solutions", "author": "Amalia, Hilma, Abdullah, Fuad, Fatimah, Asri Siti", "description": "Writing has been considered as a highly demanding skill and a complex recursive process involving multifaceted knowledge (e.g. grammar, genre, vocabulary and metacognitive competencies). Hence, it has been documented in miscellaneous studies in the past few decades. However, the issue of challenges and solutions to teaching English writing to junior high school students remains under-researched. Therefore, this study addressed this issue, notably in Indonesian EFL context. Three English teachers from a junior high school in Tasikmalaya, West Java, Indonesia were recruited as the participants. The data were collected through semi-structured interviews and analysed with Thematic Analysis (TA) (Braun &amp; Clarke, 2006). On the one hand, the findings reported that there were seven challenges encountered by teachers when teaching English writing, namely (1) students' poor English grammatical competence, (2) students' incapability of developing ideas for English writing, (3) students' inadequate English vocabulary knowledge, (4) students' demotivation to learn English writing, (5) insufficient time management to teach English writing, (6) limited sources of English writing materials and (7) limited facilities to teach English writing. On the other hand, teachers promoted several solutions to cope with such challenges, namely (1) explicit teaching English vocabulary, (2) collaborative English writing activities, and (3) exercises of English writing. Pedagogically speaking, this study offers practical contributions for the TESOL practitioners to teach English writing effectively to junior high school students, particularly in the Indonesian EFL landscape.", "subject": "Writing Instruction, Junior High School Students, Foreign Countries, Language Teachers, English (Second Language), Second Language Learning, Second Language Instruction, Vocabulary Development, Student Motivation, Grammar, Time Management, Collaborative Writing, Teacher Attitudes, Barriers, Writing Processes", "source": "Journal of Language and Linguistic Studies", "publicationdateyear": 2021, "identifiersgeo": "Indonesia"}, {"title": "Integrating Reading, Writing, Listening, and Speaking with Visuals", "author": "Karakoc, Aynur Ismayilli", "description": "The technique provided in this article offers an integrated-skills activity. Students should be able to read the description of a visual image, describe their own visuals, read and collect information from other students' writing, and speak about what they have found. This activity can be adapted for nearly any language level. The activity can address a wide range of targeted grammar points, as learners practice using the targeted grammar as they carry out the activity. The example given uses the simple past tense as an illustration of how the technique works in practice in an elementary-level class.", "subject": "Teaching Methods, Reading Skills, Writing Skills, Listening Skills, Speech Skills, Visual Stimuli, Grammar, Elementary Education, Interdisciplinary Approach, Learning Activities, English (Second Language), Second Language Instruction", "source": "English Teaching Forum", "publicationdateyear": 2018, "identifiersgeo": null}, {"title": "The Effect of Reading Strategy Instruction on Thai EFL Adult Learners&apos; Reading Strategy Awareness", "author": "Chumworatayee, Tipamas", "description": "The purpose of this study was to determine the possible effect of the implementation of reading strategy instruction on Thai EFL adult learners' reading strategy awareness. A total of 113 postgraduate students taking a remedial reading course responded to the pre- and post-adapted version of Survey of Reading Strategies (SORS) (Mokhtari &amp; Sheorey, 2002) by Zhang and Wu (2009). After the students' existing reading strategy awareness was determined, they were explicitly taught reading comprehension strategies using a course book titled &quot;Ready to Read More: A Skills-based Reader&quot; for one semester (14 three-hour sessions). Right after the strategy training, the students' awareness of reading strategies was determined again. Analysis of the data collected consisted of descriptive statistics comparing mean scores of the 28 reading strategies in the pre- and post-SORS. The t-tests for non-independent samples were then utilized to see if there was a significant difference between the mean scores of each individual reading strategy. The findings indicated that 23 out of 28 reading strategies were found significantly different. Descriptive statistics were also used to compare the mean scores of the three categories of reading strategies in the pre- and post-SORS (global, problem-solving and support reading strategies) and the overall mean scores. As a whole, the results show a marked improvement in the students' reading strategy awareness of the overall reading strategies and the overall reading strategies of the three categories. The findings revealed that the one-semester implementation of reading strategy instruction could raise Thai EFL adult learners' awareness of reading strategies. The findings of the study have pedagogical implications for teachers in the realm of EFL reading strategy instruction. To help Thai EFL adult learners to become independent readers, teachers should provide them with explicit reading strategy instruction. As this study demonstrates, Thai EFL adult learners benefit from receiving a direct explanation of strategies; thus, teaching them reading comprehension strategies explicitly is a key for success.", "subject": "Reading Strategies, Reading Instruction, Reading Comprehension, Second Language Learning, Second Language Instruction, English (Second Language), Graduate Students, Remedial Instruction, Student Attitudes, Teaching Methods, Textbooks, Scores, Comparative Analysis, Problem Solving, Metacognition, Instructional Effectiveness, Course Descriptions, Foreign Countries", "source": "LEARN Journal: Language Education and Acquisition Research Network", "publicationdateyear": 2017, "identifiersgeo": "Thailand (Bangkok)"}, {"title": "Exploring Tertiary English as a Foreign Language Writing Tutors&apos; Perceptions of the Appropriateness of Peer Assessment for Writing", "author": "Zhao, Huahui", "description": "Despite the increasing volume of research in peer assessment for writing, few studies have been conducted to explore teachers' perceptions of its appropriateness for writing instruction. It is essential to understand teachers' perceptions of peer assessment as teachers play an important role in whether and how peer assessment is implemented in their instruction. The current study investigated tertiary English writing tutors' perceptions of the appropriateness of peer assessment for English as a Foreign Language writing in China, where peer assessment has been increasingly discussed and researched but only occasionally used in teaching. The current study scrutinised the reasons behind its limited use via in-depth exploratory interviews with 25 writing tutors with different teaching backgrounds. The interview data showed tutors' limited knowledge of peer assessment and unanimous hesitation in using it. The former was explained by insufficient instruction and training in peer assessment. The latter relates to the incompatibility of peer assessment with the examinations-oriented education system, learners' low English language proficiency and learning motivation, and the conflict of peer assessment with the entrenched teacher-driven learning culture. Suggestions are made about training and engaging teachers to effectively use peer assessment in instruction.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Foreign Countries, Peer Evaluation, Writing Evaluation, Teacher Attitudes, Writing Instruction, Teaching Methods, Writing Teachers, Language Proficiency, Learning Motivation, Language Teachers", "source": "Assessment & Evaluation in Higher Education", "publicationdateyear": 2018, "identifiersgeo": "China"}, {"title": "Evaluation of Essay Writing among Senior Secondary School Arabic Students in Kwara State, Nigeria", "author": "Abdullahi, Musa Siddiq, Salisu, Musa", "description": "This study evaluated essay writing among Senior Secondary School Arabic students in Kwara State, Nigeria. This study evaluated the content, organization, expression and mechanics aspects of essay writing among senior secondary school Arabic students on the basis of gender and school ownership in Kwara State, Nigeria. A total number of 174 students were sampled using cluster sampling technique because few students offer Arabic Language at Senior Secondary School in the state. 2013 West African Senior School Certificate Examination (WASSCE) Arabic essay writing test was adapted for data collection while descriptive statistics of mean and standard deviation were used to answer the research questions, the null hypotheses were tested with the use of inferential statistics of t-test. Findings from the study revealed among others, that the proficiency of senior secondary school Arabic students in the content, organization, expression and mechanical accuracy aspects of Arabic essay writing was below average in Kwara State, Nigeria. Findings also revealed that, there was no significant difference in the proficiency of Arabic students in essay writing on the basis of gender and school ownership in Kwara State. It was then recommended among others, that students should be constantly engaged in reading textbooks and story books such as novels, newspapers, etc. as well writing stories, letters, and articles. This might help to improve their proficiency in outlining and constructing good contents, organization, expression, as well as fine-tuning and perfecting their mechanics in essay writing.", "subject": "Foreign Countries, Secondary School Students, Essays, Writing Skills, Writing Instruction, Writing Tests, Gender Differences, Institutional Characteristics, Reading Materials, Writing Assignments, Teaching Methods, Semitic Languages", "source": "Anatolian Journal of Education", "publicationdateyear": 2017, "identifiersgeo": "Nigeria"}, {"title": "Psychological and Pedagogical Innovative Technologies for Teaching English to University Students", "author": "Assem, Kabdykalymkyzy, Turagulovna, Ayupova Gulbarshyn, Sharifullina, Mamanova Alma, Bayakhmetovna, Mukhamediyeva Assel, Rakhmetolinovna, Akmanova Galiya, Kaiyrbekovich, Omarov Murat", "description": "The purpose of this research is to get the opinions of academics about augmented reality technology, which is one of the psychological and pedagogical innovative technologies to teach English to university students. In this study, the qualitative research method, one of the research methods and techniques, was used. The study group of the research consists of 25 academicians who teach English at various universities in Kazakhstan. Research data were collected with a semi-structured interview form developed by the researchers. As a result of the research, it has been determined that the majority of academicians participating in the research do not use augmented reality applications in English education. Academics have made suggestions regarding the effect of using augmented reality, one of the innovative technologies in English education, on student achievements. These recommendations are that augmented reality applications increase a student's learning performance, provide a flexible learning environment, allow students to pay more attention to the lesson, enjoy the lessons more, increase students' curiosity about the lesson and increase students' desire to learn foreign languages. Students benefit from technology and different methods while learning to take advantage of it. In addition, it has been determined that the majority of academicians participating in the research tend to use augmented reality applications in English education. In line with the results obtained from the research, the necessity of creating English education curricula in universities in accordance with augmented reality technology has emerged.", "subject": "Educational Technology, Educational Innovation, English (Second Language), Second Language Instruction, College Students, Foreign Countries, Computer Simulation", "source": "Cypriot Journal of Educational Sciences", "publicationdateyear": 2022, "identifiersgeo": "Kazakhstan"}, {"title": "The Interplay of Selected Demotivation Determinants and Achievement in EFL Critical Reading and Writing", "author": "Ghaith, Ghazi", "description": "This study investigates the interrelatedness the English as a foreign language demotivation factors of learning difficulties, threats to self-worth, monotonous teaching, poor student-teacher relationships, and learners' proficiency in critical reading and writing. Eighty (n =80) EFL learners participated in the study. The rationale for the study assumes that demotivation to learn (EFL) is an issue in many international contexts and that there is at present a dearth of research into the interplay of the external, internal, and contextual determinants of demotivation and learners' EFL proficiency. Data were collected through administering a five-level strongly disagree - strongly agree Likert-type scale and the critical reading and writing scores on the Scholastic Aptitude Test (SAT). Results revealed positive correlations between perceptions of threats to self-worth and learning difficulties and proficiency in critical reading and writing. Likewise, while monotonous teaching was negatively correlated with proficiency in critical reading, it correlated positively with learning difficulties and threats to self-worth. It was also found that poor student-teacher relationships were positively related to perceptions of learning difficulties, threats to self-worth, and to perceptions of learning difficulties. Implication for teaching and research are discussed.", "subject": "Critical Reading, Writing (Composition), English (Second Language), Second Language Learning, Second Language Instruction, Correlation, Language Proficiency, Teacher Student Relationship, College Entrance Examinations, Learning Problems, Teaching Methods, Writing Tests, Scores, Reading Tests, Self Concept, Student Attitudes, College Preparation", "source": "TESL-EJ", "publicationdateyear": 2019, "identifiersgeo": null}, {"title": "The Mind&apos;s Eye: A Culturally Relevant Pedagogy in College English with Multilingual Populations", "author": "Thompson, Tara Aline", "description": "This dissertation study explores the relationship between Ladson-Billings' (1992, 1994, 2006) early scholarship and work with Culturally Relevant Pedagogy (CRP) frameworks and the literacy practices of the multilingual students in my community college classroom. This qualitative, interpretive case study draws upon CRP and sociocultural frameworks to specifically investigate the visual, media, and technological literacy (multimodal) practices in a community college developmental English class for multilingual students. When visual, media, and technological literacy practices are purposefully included in a CRP framework and curriculum, it helps to reposition both teachers' and students' conceptual understanding of language acquisition. Two important aims of this study are to fill an existing gap of literature around the CRP theoretical framework and strengthen it with the specific inclusion of college-level, multilingual student's use of visual and technological literacy practices for the acquisition of English literacy. This in turn helps to legitimize the inclusion of visual and technological literacies into curriculums designed especially for multilingual students which are also adaptable for any class. In this study, my classroom serves as the primary unit of analysis (Merriam, 2009). I present the multimodal practices of four student participants as &quot;cases&quot; or portraits to illustrate the study's findings. I am interpreting/defining the multimodal productions my students create as their observable literacy events (Barton &amp; Hamilton, 2000; Heath, 1992) and their literacy practice is the ongoing act of creating and engaging with visual, media, and other related technological literacy practices. The act of students creating multimodal productions, &quot;visual interpretation,&quot; is the specific visual literacy practice this study investigates triangulated with students' interactions on a group Facebook page and digital story compositions. Using a reflexive model (Luttrell, 2010b) of research and additional grounded theory methods (Charmaz, 2008, 2010; Corbin &amp; Strauss, 2008) to analyze data, findings for this study reveal that a curriculum utilizing multimodal literacy practices promote Ladson-Billings' (1992, 2006) three tenets of CRP: academic excellence, cultural competence, and sociopolitical consciousness in the following ways: First, the curriculum acknowledges students' multiple literacies and cultural backgrounds. Second, the curriculum enables students to become personally invested and more engaged in their academic participation, productions and achievement. Third, the curriculum raises students' competencies in reading/writing comprehension, deconstruction, and production of subsequent multimodal texts as it privileges students' own literacy practices. Therefore, visual literacy practices should be a mechanism for achieving and representing these tenets of a Culturally Relevant Pedagogy inside college classrooms with curriculums designed for multilingual students. [The dissertation citations contained here are published with the permission of ProQuest LLC. Further reproduction is prohibited without permission. Copies of dissertations may be obtained by Telephone (800) 1-800-521-0600. Web page: http://www.proquest.com/en-US/products/dissertations/individuals.shtml.]", "subject": "Culturally Relevant Education, Teaching Methods, Visual Literacy, Technological Literacy, Literacy Education, Multilingualism, Community Colleges, Two Year College Students, Case Studies, Sociocultural Patterns, English (Second Language), Second Language Learning, Second Language Instruction, Media Literacy, Social Media, Computer Mediated Communication, Writing (Composition), Multiple Literacies, Cultural Background, Curriculum Design", "source": "ProQuest LLC", "publicationdateyear": 2018, "identifiersgeo": null}, {"title": "Tasks and Learner Motivation in Learning Chinese as a Foreign Language", "author": "Ruan, Youjin, Duan, Xiaoju, Du, Xiang Yun", "description": "This study focuses on how beginner learners in a task-based teaching and learning (TBTL) environment perceive what is motivating to them in the process of learning Chinese as a foreign language at Aalborg University, Denmark. Drawing upon empirical data from surveys, group interviews and participant observation, this study explores which kinds of tasks are perceived as motivating from the students' perspective and which characteristics the learners associate with motivating tasks. The study indicates that it is important to consider the learners' affective factors and learning situation factors, which can boost learners' intrinsic motivation, when designing a task, especially at a beginning stage of foreign language learning, and to integrate cultural elements into tasks as an added value to motivate learners. Finally, this study identifies challenges and barriers related to TBTL that beginner-level students may find discouraging. It is suggested that motivating learners to continue learning the language and encouraging active participation may be more important than developing their linguistic accuracy and fluency in the given context.", "subject": "Second Language Learning, Second Language Instruction, Chinese, Learning Motivation, Task Analysis, Teaching Methods, Barriers, Accuracy, Language Fluency, Foreign Countries, Surveys, Interviews, Participant Observation, Student Attitudes, Correlation, Introductory Courses, Role Playing, Self Efficacy, Independent Study, Cooperative Learning, Instructional Design, Educational Improvement, Interpersonal Relationship, College Students, Mixed Methods Research", "source": "Language, Culture and Curriculum", "publicationdateyear": 2015, "identifiersgeo": "Denmark"}, {"title": "&apos;We Are Creating a Reality&apos;: Teacher Agency in Early Bilingual Education", "author": "Dubiner, Deborah, Deeb, Inas, Schwartz, Mila", "description": "This study was conducted within the context of bilingual Arabic-Hebrew medium preschools in Israel which were established to incorporate instruction in the native languages of both majority and minority children in the classroom. Bilingual education in various settings produces a wide variety of outcomes in terms of language proficiency, cultural awareness, and scholastic achievement. The purpose of the present study was to examine teacher agency in changing the language model of the preschool that aimed at enhancing willingness to use L2 (Arabic) among the Hebrew-speaking 4-6-year-old children. Two research questions guided this study: 1) How did teachers implement their agency in the process of language model modification; and 2) Is there a correspondence between teachers' perception of their role in the process and the observed language practices in the preschool? To answer these questions, we used multiple sources of qualitative data, such as observations and interviews. The findings indicate that teachers saw themselves as agents of linguistic change and were adamant about providing the class with maximum exposure to Arabic during the designated period of the project. Secondly, teachers made use of several strategies aimed at enhancing Arabic L2 output amongst Hebrew-speaking children who were previously reluctant to use the language. Finally, there is a clear correspondence between teachers' and researchers' perception of the former's agency in the modification of the language model. The findings are discussed from the perspective of strategic and critical pedagogies.", "subject": "Bilingual Education, Change Agents, Teacher Attitudes, Semitic Languages, Second Language Learning, Native Language Instruction, Teaching Methods, Preschool Education, Language Usage, Cultural Awareness, Language Minorities, Academic Achievement, Critical Theory, Foreign Countries, Classroom Communication, Jews, Arabs, Program Descriptions, Video Technology, Parent Participation, Professional Autonomy, Preschool Teachers", "source": "Language, Culture and Curriculum", "publicationdateyear": 2018, "identifiersgeo": "Israel"}, {"title": "Empowering Non-Licensed-in-English Language Teachers to Construct Professional Knowledge in Their Actual and Imagined Communities of Practice", "author": "Aguirre-Garzón, Edgar Augusto, Castañeda-Peña, Harold Andrés", "description": "Research has accumulated important knowledge over recent decades on how licensed language teachers develop and learn from cognitive and socio-cultural stances. Yet, relatively little evidence exists on how non-licensed-in-English language teachers (NLELTs) grow professionally in their communities. Similarly, few studies have yet investigated the concept of &quot;imagined communities&quot; in the language teaching field with these particular types of population. This study attempts to fill this gap by exploring the possible forms of professional knowledge that NLELTs build through participation in the activities of a learning community. Four non-licensed language teachers participated in a nine-month collaborative-reflective process focused on language teaching practices, in a public school in Bogotá (Colombia). In analyzing their interactions and consequent products, we discuss three dimensions of knowledge construction propelled by the individual visions they brought into the community. Furthermore, we analyze how learning in that present community granted the teachers access to envisioned practices in imagined communities for a desirable future. Based on the findings we argue that success or failure in participation in present, real communities determines imagined affiliation to future communities, their practices and even the NLELTs' preferred future positionings as professionals.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Language Teachers, Communities of Practice, Sociocultural Patterns, Teacher Qualifications, Pedagogical Content Knowledge, Reflective Teaching, Teaching Methods, Educational Practices, Foreign Countries, Teacher Attitudes, Teacher Empowerment, Case Studies, Faculty Development, Qualitative Research, Semi Structured Interviews, Elementary School Teachers, Secondary School Teachers", "source": "English Language Teaching", "publicationdateyear": 2017, "identifiersgeo": "Colombia (Bogota)"}, {"title": "A Study of Metaphor for Writing Skill in EFL Contexts", "author": "Ozturk, Kadim", "description": "To communicate effectively in any language, one needs to be competent in using four language skills; that is, reading, listening, reading, and writing- and accordingly the integrative skills instruction has come into prominence in L2 teaching. EFL teachers' beliefs, ideas, perceptions, attitudes are known to have a significant impact on their profession. Termed as &quot;teacher cognition&quot; by Borg (2003), the mentioned beliefs or perceptions are not directly observable. In this study, it is argued that teachers' perceptions about four language skills as a part of their teacher cognition will give insight to their instruction. This is a qualitative study which aims at finding out the prospective EFL teachers' perceptions about writing skill through metaphors. The participants included the undergraduate students studying English as a foreign language at two universities, Istanbul and Amasya. The data were analyzed with the content analysis technique. The findings revealed that prospective EFL teachers had various views regarding the nature of writing. These perceptions, either positive or negative, will influence their future practices; thus, it is essential that the awareness of prospective EFL teachers should be sharpened to help learners to understand the complicated nature of writing and proceed in writing.", "subject": "Foreign Countries, English (Second Language), Second Language Learning, Preservice Teachers, Student Teacher Attitudes, Writing Skills, Figurative Language, Language Teachers", "source": "English Language Teaching", "publicationdateyear": 2022, "identifiersgeo": "Turkey"}, {"title": "Managing Knowledge Claims in Classroom Discourse: The Public Construction of a Homogeneous Epistemic Status", "author": "Heller, Vivien", "description": "Drawing on sequential and multimodal analysis of video-recorded classroom interactions, the paper examines in detail the interactional practices and verbal and bodily displays that serve to (re-)establish a congruency between the teacher's expectation with regard to the participants' relative knowledge and the students' actual knowledge claims. By analysing the details of turn and action design, the present study shows how &quot;inserted knowledge questions&quot; and &quot;inserted knowledge accounts&quot; are used not to ascertain, but rather to define the students' epistemic status in a homogenising way. Challenging the students' knowledge, withholding confirmation and producing first explanations are practices that serve to reconstitute the students' limited access to new matters. Category-bound epistemic rights and obligations rather than displayed knowledge thus provide the basis for categorisations such as &quot;novices&quot; or &quot;advanced learners.&quot; It is argued that the public construction of a homogeneous epistemic status is consequential for the achievement of tasks and practical purposes in the multiparty setting of the classroom. Transforming individual students into a group of homogeneous novices enables participants to mutually align their knowledge claims and to form an epistemic ecology in which collective learning can take place.", "subject": "Discourse Analysis, Discourse Communities, Classroom Techniques, Classroom Communication, Epistemology, Class Activities, Video Technology, Classroom Observation Techniques, Mathematics Instruction, Language Acquisition, Grade 5, Correlation, Teaching Methods, Educational Practices, Foreign Countries", "source": "Classroom Discourse", "publicationdateyear": 2017, "identifiersgeo": "Germany"}, {"title": "The Integration of Social Networking Services in Higher Education: Benefits and Barriers in Teaching English", "author": "Marzulina, Lenny, Habibi, Akhmad, Mukminin, Amirul, Desvitasari, Deta, Yaakob, Mohd Faiz Mohd, Ropawandi, Doni", "description": "Social networking services (SNSs) have been popular and essential media to increase lecturer student interaction, collaboration, and communication as well as lecturers 'supervision in Indonesian universities including in teaching English as a foreign language (EFL). This mixed method study utilized a survey and interview as the techniques of data collection which specifically explored the lecturers' perspectives on the use SNSs for personal and educational purposes as well as demographic information related to the experience and frequency using SNSs, ownership (possession) of SNSs, and SNSs popularity. The findings revealed that the participants had much knowledge and experiences with SNSs. Even though most participants found some benefits of SNSs in EFL classes including easing communication, supervision and evaluation, time flexibility, and creativity. There were two barriers that have emerged, including lack of skill and cost to use. Implications and future research are offered to improve technology integration in higher education.", "subject": "Social Networks, Barriers, English (Second Language), Second Language Learning, Second Language Instruction, College Faculty, Language Teachers, Teacher Attitudes, Supervision, Social Media, Technology Integration, Teaching Methods, Educational Benefits, Foreign Countries", "source": "International Journal of Virtual and Personal Learning Environments", "publicationdateyear": 2018, "identifiersgeo": "Indonesia"}, {"title": "Five Years of ELEUK Conferences: A Selection of Short Papers from 2019", "author": "Lallana, Amparo, Ed., Martín, Lourdes Hernández, Ed., Gutiérrez, Mara Fuertes, Ed.", "description": "This anniversary volume of the Association for the Teaching of Spanish in Higher Education in the United Kingdom is a compilation of contributions made by members and delegates at the 2019 ELEUK annual conference held at the University of Edinburgh. Throughout the book, authors share their teaching, assessment, and research practice in the area of Spanish Language Teaching (SLT). From strategies to enhance student engagement and foster student agency to reflections on language teaching practice from diverse angles, these nine short papers contribute to current debates around foreign language pedagogy, with a focus on teaching Spanish in the higher education context. [For the two out of nine papers in this volume written in English, see ED606533 and ED606534.]", "subject": "Spanish, Higher Education, Second Language Learning, Second Language Instruction, Teaching Methods, Learner Engagement, Personal Autonomy, Conference Papers, Oral Language, Consciousness Raising, Video Technology, Visual Aids, Peer Evaluation, Metalinguistics, Metacognition, Evaluation Criteria, Spanish Literature, Figurative Language, Foreign Countries, Grammar", "source": "Research-publishing.net", "publicationdateyear": 2020, "identifiersgeo": "Argentina"}, {"title": "EFL Teachers&apos; Conceptualizations of Their Roles through Metaphor Analysis", "author": "Asmali, Mehmet, Çelik, Handan", "description": "Metaphors reflect the way people think and know the world. When they are considered within teaching profession, they can be strong agents revealing teachers? beliefs about their profession. They may also explore the meaning that teachers attach to themselves. Despite their strength to shed light on how teachers conceptualize themselves, metaphor studies seem to be limited. For this reason, this study set out to reveal what EFL teachers think about their roles through metaphorical representations. 24 EFL teachers, with varied experience in teaching, responded to a metaphor elicitation task through the statement &quot;An English teacher is like …………… because………………….. .&quot; The data were analyzed with reference to the ESL teachers? role categorization provided by De Guerrero and Villamil (2000). Thus a theory-driven, deductive content analysis was employed. The analysis revealed that the data only matched with 6 out of 9 categories of De Guerrero and Villamil. Therefore, for the metaphors that did not fit in their categorization, a new category was emerged. Revealing the teachers? interpretations and philosophies regarding teaching, the metaphors within the dominant categories showed that the teachers? conceptualizations regarding their roles were more traditional and teacher-centered. The variety in metaphors suggests the multi-dynamic nature of teaching.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Language Teachers, Teacher Attitudes, Teacher Role, Figurative Language, Task Analysis, Classification, Content Analysis, Educational Philosophy, Teaching Methods, Foreign Countries", "source": "Journal of Language and Linguistic Studies", "publicationdateyear": 2017, "identifiersgeo": "Turkey"}, {"title": "Self-Directed Learning via Contemplative Teaching to Promote Reading Comprehension Ability", "author": "Giveh, Fatemeh", "description": "The present study tried to investigate one of the options for improving self-directed learning in Iranian EFL learners, i.e., contemplative L2 instruction with a flavor of transformative instruction. Accordingly, it adopted a quasi-experimental design to investigate the influential effects that contemplative teaching would exert on Iranian EFL learners' L2 self-directed learning and reading comprehension abilities. To this end, two groups of Iranian EFL learners were taught on the L2 through either contemplative teaching (Experimental Group) or a traditional method (Control Group). The results of the study indicated that contemplative teaching, accompanied with transformative instruction, would in fact have significant effects on Iranian EFL learners' L2 autonomy, &quot;i.e.,&quot; self-directed L2 learning, and L2 reading comprehension skills. In addition, the analysis of the qualitative indicated that the participants in the Experimental Group held positive attitudes towards contemplative and transformative L2 instruction and believed these instructional strategies would create a supporting and viable classroom atmosphere. The findings of this study would have significant implications for both theory and practice on L2 contemplative teaching, self-directed learning, and reading comprehension.", "subject": "Reading Comprehension, Independent Study, English (Second Language), Second Language Learning, Second Language Instruction, Experimental Groups, Control Groups, Positive Attitudes, Student Attitudes, Transformative Learning, Teaching Methods, Foreign Countries, Females, Translation, Teacher Education Programs, Literature, Language Teachers, Language Tests, Pretests Posttests, Language Proficiency, Correlation", "source": "English Language Teaching", "publicationdateyear": 2018, "identifiersgeo": "Iran"}, {"title": "English Learning and Learning Disabilities: Has Research Made Its Way into Practice?", "author": "Lopes-Murphy, Solange A., Murphy, Christopher G.", "description": "Fundamental to the hypothesis-driven approach to assessing the special-education (SPED) needs of English learners (ELs) is the awareness that behaviors often exhibited by ELs may mirror indicators of learning disabilities (e.g., difficulty comprehending text, difficulty following directions, lack of appropriate classroom behavior, lack of attention). We surveyed 330 school professionals to examine their perceptions about four mirrored behaviors displayed by ELs during instruction, as indicators of either a second-language difficulty or a learning disability. Only 31% of the respondents correctly indicated that none of the behaviors can distinguish these two possibilities. The probability of correct assessment was positively associated with the level of English-as-a-Second Language (ESL) training for those with less than 15 years of teaching experience and negatively associated for those with more than 20 years of experience. Correct assessment was positively associated with years of teaching experience for those with no ESL training but negatively associated for those with any level of ESL training. Correct assessment was not generally associated with the level of SPED training. From these results, we derive recommendations for improving the training of all pre- and in-service teachers in ESL instruction to better equip them to discriminate ELs' language difficulties from learning disabilities. [Note: The page range (304-329) shown on the PDF is incorrect. The correct page range for this article is p304-330. The following article begins on page 330.]", "subject": "Learning Disabilities, Language Impairments, English Language Learners, Second Language Learning, Disability Identification, Theory Practice Relationship, Student Behavior, Behavior Problems, Reading Comprehension, Attention, Elementary School Teachers, Secondary School Teachers, School Personnel, Teaching Experience, Professional Development, Special Education, Correlation", "source": "Mid-Western Educational Researcher", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "Resisting Native-Speakerism in International Learning Exchange between North Korean Refugee Students and American University Students", "author": "Jang, Eun-Young, Kim, Eun-Yong, Kang, Shin Ji", "description": "This study showcases an International Learning Exchange (ILE) program between North Korean (NK) refugee students in South Korea and American university students from the US. ILE programs connect two or more linguistic/ cultural groups for intercultural awareness, which provide authentic communicative environments. However, the prevalent use of English and research focus mostly on non-native English-speaking students reflect the ideology of native-speakerism embedded in ILE programs. The purpose of this study was to develop an ILE program that resists native-speakerism and to investigate its influences on native as well as non-native English-speaking students. Adopting a case-study approach, data were collected from video-taping, fieldnotes, student documents, surveys, and interviews. Findings show how the authors designed and implemented a principle-based ILE program. The responses of NK students show their growing motivation and communication ability. The responses of American students show their critical reflections on their native-speaker identities. This study offers insights into designing ILE programs based on multilingualism and translanguaging.", "subject": "Refugees, North Americans, Asians, Exchange Programs, Intercultural Communication, Cultural Awareness, Case Studies, Authentic Learning, English (Second Language), Second Language Learning, Second Language Instruction, English, Native Speakers, Language Attitudes, Video Technology, Student Attitudes, Self Concept, Program Design, Learning Motivation, Communication Skills, Language Proficiency, Multilingualism, Code Switching (Language), Korean, Foreign Countries, High School Students, Undergraduate Students, Computer Mediated Communication", "source": "English Teaching", "publicationdateyear": 2022, "identifiersgeo": "South Korea, North Korea, United States"}, {"title": "Developing Elementary EFL Learners&apos; Procedural Knowledge and Strategic Awareness in Reading Classes during the COVID-19 Pandemic: Algerian Teachers&apos; Challenges", "author": "Ammour, Kamila", "description": "The COVID-19 pandemic has affected educational systems worldwide, leading some scholars to scrutinise the consequences of lockdown and school closure on learners' learning habits and teachers' teaching practices. In this regard, this paper aims to explore the teachers' challenges while implementing a reading strategy-based instruction for beginners during the COVID-19 pandemic, taking the Algerian middle schools as a case in point. It highlights the difficulties to achieving quality in developing learners' procedural knowledge and strategic awareness in EFL reading classes. The leading approach to the issue is the interactive approach. To attain the objective of the research, the qualitative method was adopted. Classroom observation and structured interviews were used to collect data. The population targeted was composed of 20 teachers from 16 middle schools in Tizi-Ouzou. The collected data were subjected to qualitative content analysis. The results of the study reveal that most teachers are aware of the importance of reading strategy-based instruction. However, they do not teach them systematically or consistently. Indeed, lack of targeted teacher training, time constraints, and disregard of metacognitive instruction are likely to be obstacles to the efficient implementation of reading strategy-instruction. Furthermore, the COVID-19 pandemic has thrown up several psychological and cognitive learners' difficulties, including decreased motivation and lack of cognitive focus, making the teaching process more challenging. The results imply a need for a revision of teachers' professional development programs and a re-consideration of the elementary EFL courses.", "subject": "Foreign Countries, COVID-19, Pandemics, English (Second Language), Second Language Instruction, Language Teachers, Reading Instruction, Middle School Teachers, Reading Strategies, Teaching Methods, Barriers, School Closing, Teacher Attitudes, Student Motivation, Distance Education, Time Factors (Learning)", "source": "Arab World English Journal", "publicationdateyear": 2021, "identifiersgeo": "Algeria"}, {"title": "Modular-Based Approach and Students&apos; Achievement in Literature", "author": "Ambayon, Cristobal M.", "description": "Mythology and folklore have long been important means for promoting literacy in human societies. This study aimed at validating a mythology and folklore module and evaluating its effectiveness in teaching the subject of mythology and folklore. This was in response to inadequate learning resources in teaching literature and to address the call for effective instructional materials. The study used comparative-experimental research design. The results revealed that the developed module consisted of excellent contents, relevance and mechanics as evaluated by experts in the area. The module was also assessed by the students as highly acceptable, valid, reliable, and usable. Third Year Bachelor of Secondary Education (BSED) major in English students for School Year 2015-2016 were the participants of this study. The students were divided into control and experimental groups. The groupings were based on their GPA during the previous semester. While the experimental group utilized the developed module, the control group did not. The test instruments were the different exercises given every after the topics which lasted for one hour every session. Based on the results, the performance of the college students in literature in experimental group had improved from poor to excellent achievement whereas the control group had relatively improved from poor to fair achievement. Hence, it is recommended that the module be used in similar contexts particularly in learning mythology and folklore.", "subject": "Teaching Methods, Comparative Analysis, Undergraduate Students, Secondary School Teachers, Teacher Education Programs, Grade Point Average, Mythology, Folk Culture, Literacy, Instructional Effectiveness, Instructional Materials, English Literature, English (Second Language), Language Teachers, Second Language Learning, Second Language Instruction, Tests, Foreign Countries", "source": "International Journal of Education and Literacy Studies", "publicationdateyear": 2020, "identifiersgeo": "Philippines"}, {"title": "Teaching &quot;about&quot; Taboo Language in EFL/ESL Classes: A Starting Point", "author": "Wedlock, Joshua", "description": "Although a range of authors have argued for the inclusion of swearing and taboo language in EFL/ESL curriculums (see Mercury, 1995; Horan, 2013; Holster, 2005; Liyanage, Walker, Bartlett, &amp; Guo, 2015; Finn, 2017), to the best of my knowledge, no research has investigated how this could be done in a professional and pedagogically sound manner. With this in mind, the purpose of this article is threefold. First, to present a range of arguments as to why swearing, (potentially) offensive, and taboo language (SOTL) should be covered in English as a Second Language (ESL) and English as a Foreign Language (EFL) classes. Second, to report on key findings from an action research project I conducted in 4 separate adult EFL classes in Seoul, South Korea aimed at developing an effective strategy for teaching students about SOTL in English. And third, to offer a range of considerations and ideas teachers should bear in mind if they choose to broach this somewhat sensitive subject matter in their English classes.", "subject": "Language Usage, English (Second Language), Second Language Instruction, Adult Students, Foreign Countries, Teaching Methods, Instructional Effectiveness, Student Attitudes, Guidelines", "source": "ORTESOL Journal", "publicationdateyear": 2020, "identifiersgeo": "South Korea (Seoul)"}, {"title": "Teacher Cultures: In Search of Their Contents and Forms", "author": "Hongboontri, Chantarath, Liao, Yiting", "description": "This mixed-methods study aims to explore the patterns of teacher and their effects on teachers' lives and work. To do so, the researchers went into one international school in Thailand and requested participation from 25 foreign language (FL) teachers. All the participants completed and returned a questionnaire and participated in one-on-one interviews and observations. Calculation of the questionnaires with SPSS (version 20) demonstrated the participants' high favoritism of teachers' collegial relations. Nevertheless, the researchers' analysis of their descriptive data with open and axial coding techniques opposed the numeric data and strongly supported the existence of balkanization, individualism, and contrived collegiality among these participants. The findings of the present study challenge (FL and other subject disciplines) teachers to consider the focus and the depth of teacher cultures. More importantly, they urge teachers, school administrators, and policy makers to anticipate the growing effects of teacher cultures on teachers' sense of professionalism related to their lives and work.", "subject": "Cultural Influences, International Schools, Teaching Methods, Teacher Attitudes, Collegiality, Individualism, Professionalism, Self Concept, Foreign Countries, Teacher Collaboration, Peer Relationship, Peace, Kindergarten, Elementary Secondary Education, Language Teachers, Second Language Learning, Second Language Instruction, Work Environment, Work Attitudes, Teacher Characteristics, Cultural Differences", "source": "LEARN Journal: Language Education and Acquisition Research Network", "publicationdateyear": 2021, "identifiersgeo": "Thailand (Bangkok)"}, {"title": "Supporting Academic Language Development in Elementary Science: A Classroom Teaching Experiment", "author": "Jung, Karl Gerhard", "description": "Academic language is the language that students must engage in while participating in the teaching and learning that takes place in school (Schleppegrell, 2012) and science as a content area presents specific challenges and opportunities for students to engage with language (Buxton &amp; Lee, 2014; Gee, 2005). In order for students to engage authentically and fully in the science learning that will take place in their classrooms, it is important that they develop their abilities to use science academic language (National Research Council, 2012). For this to occur, teachers must provide support to their students in developing the science academic language they will encounter in their classrooms. Unfortunately, this type of support remains a challenge for many teachers (Baecher, Farnsworth, &amp; Ediger, 2014; Bigelow, 2010; Fisher &amp; Frey, 2010) and teachers must receive professional development that supports their abilities to provide instruction that supports and scaffolds students' science academic language use and development. This study investigates an elementary science teacher's engagement in an instructional coaching partnership to explore how that teacher planned and implemented scaffolds for science academic language. Using a theoretical framework that combines the literature on scaffolding (Bunch, Walqui, &amp; Kibler, 2015; Gibbons, 2015; Sharpe, 2001/2006) and instructional coaching (Knight, 2007/2009), this study sought to understand how an elementary science teacher plans and implements scaffolds for science academic language, and the resources that assisted the teacher in planning those scaffolds. The overarching goal of this work is to understand how elementary science teachers can scaffold language in their classroom, and how they can be supported in that work. Using a classroom teaching experiment methodology (Cobb, 2000) and constructivist grounded theory methods (Charmaz, 2014) for analysis, this study examined coaching conversations and classroom instruction to identify and understand what scaffolds are planned and implemented, and how that planning and implementation occurred through an instructional coaching partnership. Findings from this study showed the elementary science teacher planned and implemented a number of scaffolds for science academic language, focusing primarily on the use of sentence starters as a scaffolding strategy. The findings also indicated that the instructional coaching partnership played a vital role as the main resource that assisted the planning of scaffolds. These findings provide insights into the types of scaffolds that elementary science teachers can implement to scaffold science academic language, and the role that instructional coaching can play in supporting teachers as they work to provide instruction that scaffolds their students' language use and development. [The dissertation citations contained here are published with the permission of ProQuest LLC. Further reproduction is prohibited without permission. Copies of dissertations may be obtained by Telephone (800) 1-800-521-0600. Web page: http://www.proquest.com/en-US/products/dissertations/individuals.shtml.]", "subject": "Academic Discourse, Science Instruction, Language Usage, Teaching Methods, Faculty Development, Scaffolding (Teaching Technique), Elementary School Teachers, Constructivism (Learning), Grounded Theory, Teacher Attitudes, Coaching (Performance), Science Teachers, Role", "source": "ProQuest LLC", "publicationdateyear": 2017, "identifiersgeo": null}, {"title": "Case Studies of Teach for America Teachers&apos; Teacher Identity Development in Relation to English Language Learners", "author": "Turgut, Refika", "description": "The purpose of this study is to examine the teacher identity development of Teach for America (TFA) teachers in relation to English language learners (ELLs) in the context of a semester-long teaching English as a second language (TESL) course. In addition, this study aims to explore primary considerations come into play in TFA teachers' teacher identity development as novice teachers of ELLs. The theoretical lenses guiding this study are Wenger's Community of Practice perspective and Positioning theory (Davies &amp; Harre, 1990). A multiple-case design is employed to examine TFA teachers' teacher identity in relation to ELLs. Data collection took place approximately six months and included individual interviews, focus group discussion, artifacts, field observations and researcher's journal. Findings indicated that the TESL course provided context for developing new understandings for the TFA teachers and contributed to their teacher identity through improving their knowledge of the education of ELLs. The TESL course also led to some positive changes in the TFA teachers' beliefs about the teaching of ELLs and enabled them to develop new understandings about working with ELLs as content-area teachers. However, the TESL course did not influence all five TFA teachers' positional identities as teachers of ELLs. The TFA teachers, except one, did not take on a linguistically responsive teacher perspective and charged bilingual or ESL teachers with the responsibility of educating ELLs. This study also found that the following five primary considerations influenced the trajectory of the five TFA teachers' professional development as novice teachers of ELLs: (a) decision to become a teacher, (b) school culture, (c) level of content area knowledge, (d) positionings in relation to ELLs, and (e) sources of support. These considerations facilitated or hindered the TFA teachers' teacher identity development process as novice teachers in the teaching community and played a role in their growth as teachers of ELLs. This study contributes to the literature by examining TFA teachers' teacher identity development in relation to ELLs and identifying primary considerations that influenced TFA teachers' teacher identities as novice teachers of ELLs. The findings of this study have implications for the TFA organization and teacher preparation courses on ELL instruction. [The dissertation citations contained here are published with the permission of ProQuest LLC. Further reproduction is prohibited without permission. Copies of dissertations may be obtained by Telephone (800) 1-800-521-0600. Web page: http://www.proquest.com/en-US/products/dissertations/individuals.shtml.]", "subject": "English Language Learners, Teacher Education Programs, Professional Identity, Teacher Attitudes, Attitude Change, English (Second Language), Second Language Learning, Second Language Instruction, Language Teachers, Beginning Teachers, Case Studies, Interviews, Focus Groups, Observation, Diaries, Teaching Methods, Bilingual Teachers, Career Choice, School Culture, Pedagogical Content Knowledge", "source": "ProQuest LLC", "publicationdateyear": 2017, "identifiersgeo": null}, {"title": "Influence of Learning Ugandan Folksongs Using Aural/Oral versus Notation Means on US Music Majors&apos; Preferences for Instruction Method and Quality of Freely Created Rhythmic Accompaniments", "author": "Killian, Janice N., Sekalegga, Lawrence Branco", "description": "To examine the quality of rhythmic improvisations after learning Ugandan folksongs via notated or aural/oral means, we asked university music majors (N = 32) to practice two Ugandan folksongs via Western notation or while viewing a prerecorded video of an expert Ugandan performer singing the same song to mimic aural/oral tradition conditions. Subsequently participants heard an authentic performance of the song they had just learned and were asked to create a rhythmic accompaniment to that song. All conditions were counterbalanced by treatment and by song. Resulting improvisations were judged regarding whether the first was better than the second. Results indicated no significant difference between improvisations on the basis of how the song was learned (p = 0.2617), differences between the songs themselves (p = 0.1261) or the order of the songs (p = 0.7518). Participants improvised better when the song was learned under notation conditions (differences not significant), but 70.1% of participants preferred to learn the song via aural/oral means (p = 0.0041). Results are discussed in terms of challenges in assessment of improvisations and pedagogical implications for future research.", "subject": "Folk Culture, Singing, Music Education, Foreign Countries, Creative Activities, College Students, Majors (Students), Student Attitudes, Teaching Methods, Oral Language, Aural Learning, Music Reading", "source": "International Journal of Music Education", "publicationdateyear": 2018, "identifiersgeo": "Uganda"}, {"title": "Russian Accent in English Written Discourse", "author": "Bondarenko, Olga R.", "description": "This research is a multi-aspect exploratory investigation of Russian English institutional written discourse and highlights its features demonstrated by Russian native learners, tertiary students of English for the tourism and hospitality industry. The author approaches the theme from the perspectives of World Englishes and the pedagogical agenda. This sample study is based on the analysis of the researcher's corpus of English written works by Russian students. It reveals Russian English discoursal variations as manifestations of ethnolinguistic and ethnocultural identity. The paper highlights users' repeated salient discoursal features, the main of which appeared to be in communication strategies, structure, and register. Specific choices of linguistic, stylistic, structural and strategic variables result in the uncovered Russian English discoursal features, such as straightforwardness, excessive evaluation, abuse of negation and others. The research also focuses on their possible unwelcome pragmatic effects in business communication. This paper is a contribution to scarce comprehensive World Englishes discourse studies, particularly to the under-explored theme of Russian English. Revelation of local voices in English discourse and their interpretation in terms of indigenous languages and cultures may be a demanded addition to the World Englishes theory and practice. The pedagogical inferences of this research suggest that culturally relevant English-as-a-foreign-language teaching should take into account the English discoursal profile of learners resulting from their interfering native profile to improve pedagogical practices.", "subject": "Russian, Pronunciation, English (Second Language), Second Language Learning, Second Language Instruction, Language Variation, Self Concept, Teaching Methods, Computational Linguistics, Writing (Composition), Foreign Countries, Native Language, College Students, Tourism, Hospitality Occupations, English for Special Purposes, Discourse Analysis, Pragmatics, Business Communication, Inferences, Interference (Language), Culturally Relevant Education, Spelling, Syntax, Grammar, Distinctive Features (Language), Error Patterns", "source": "IAFOR Journal of Education", "publicationdateyear": 2020, "identifiersgeo": "Russia"}, {"title": "The Role of Feedback and Instruction on the Cross-Situational Learning of Vocabulary and Morphosyntax: Mixed Effects Models Reveal Local and Global Effects on Acquisition", "author": "Monaghan, Padraic, Ruiz, Simón, Rebuschat, Patrick", "description": "First language acquisition is implicit, in that explicit information about the language structure to be learned is not provided to children. Instead, they must acquire both vocabulary and grammar incrementally, by generalizing across multiple situations that eventually enable links between words in utterances and referents in the environment to be established. However, this raises a problem of how vocabulary can be acquired without first knowing the role of the word within the syntax of a sentence. It also raises practical issues about the extent to which different instructional conditions -- about grammar in advance of learning or feedback about correct decisions during learning -- might influence second language acquisition of implicitly experienced information about the language. In an artificial language learning study, we studied participants learning language from inductive exposure, but under different instructional conditions. Language learners were exposed to complex utterances and complex scenes and had to determine the meaning and the grammar of the language from these co-occurrences with environmental scenes. We found that learning was boosted by explicit feedback, but not by explicit instruction about the grammar of the language, compared to an implicit learning condition. However, the effect of feedback was not general across all aspects of the language. Feedback improved vocabulary, but did not affect syntax learning. We further investigated the local, contextual effects on learning, and found that previous knowledge of vocabulary within an utterance improved learning but that this was driven only by certain grammatical categories in the language. The results have implications for theories of second language learning informed by our understanding of first language acquisition as well as practical implications for learning instruction and optimal, contingent adjustment of learners' environment during their learning.", "subject": "Feedback (Response), Second Language Learning, Second Language Instruction, Grammar, Morphology (Languages), Vocabulary Development, Syntax, Teaching Methods, Decision Making, Learning Processes, Speech Communication, Context Effect, College Students, Foreign Countries, Cartoons, Artificial Languages, Nouns, Computer Assisted Instruction, Computer Assisted Testing", "source": "Second Language Research", "publicationdateyear": 2021, "identifiersgeo": "United Kingdom (England)"}, {"title": "Heritage Language Education: Development of the Field in the United States", "author": "Kagan, Olga, Dillon, Kathleen", "description": "Since at the turn of the twenty-first century heritage language (HL) research and education was a new field emerging, this research timeline traces the complete history of the field in the US through 2016. It highlights how theories and perspectives have changed, been challenged, and widely accepted. The field's roots are in Spanish since, as the language of the most numerous immigration group, it has long been a commonly taught language in the US.", "subject": "Heritage Education, Second Language Learning, Second Language Instruction, Educational History, Native Speakers, Spanish, Language Research, Immigration, Educational Research, Teaching Methods", "source": "Language Teaching", "publicationdateyear": 2018, "identifiersgeo": null}, {"title": "Reimagining English Language Learners from a Translingual Perspective", "author": "Anderson, Jason", "description": "This article explores the potential implications of theorizing in translingualism and translanguaging for foreign language teaching and learning. I discuss key terminology and introduce a translingual continuum as a potential way to understand language use practices both within and across communities. I report on an exploratory study into the self-identified future language use profiles of 116 adult EFL learners studying in the United Kingdom, the majority of whom perceive a need for translingual practices in their varied futures. I discuss the implications, both of these findings and other research for language teaching pedagogy, considering how translingual competence may differ from communicative competence, and providing practical suggestions for teachers working in different contexts. I also discuss how reimagining the language classroom as a translingual community potentially provides a way of redefining notions of authenticity and the role of the teacher as a translingual practitioner, thereby avoiding the divisive native-speaker--non-native-speaker dichotomy.", "subject": "Foreign Countries, Vocabulary, English Language Learners, Multilingualism, Second Language Instruction, Second Language Learning, Language Usage, Teaching Methods, Adult Learning, Communicative Competence (Languages), Classroom Techniques, Educational Practices", "source": "ELT Journal", "publicationdateyear": 2018, "identifiersgeo": "United Kingdom"}, {"title": "The Trajectory of Learning in a Teacher Community of Practice: A Narrative Inquiry of a Language Teacher's Identity in the Workplace", "author": "Liu, Yongcan, Xu, Yueting", "description": "A major criticism of the Community of Practice theory is that it mainly focuses on the inward induction process of learning while neglecting the outbound trajectory. Yet, this criticism still remains at the hypothetical level in most of the literature. This paper aims to advance the theory by addressing this criticism on an empirical basis. The research highlights a language teaching reform context where the traditional and liberal pedagogies co-existed in a Chinese university department. Based on a narrative inquiry of an English as a Foreign Language (EFL) teacher's (Feng) experience during the reform, this paper reports four stories distilled from multiple &quot;restorying cycles&quot; and knit together as a coherent narrative of Feng's learning trajectory. The first story narrates how Feng was persuaded to join the department and lead the liberal pedagogical reform. The second story illustrates Feng's loss of identity when she was confronted with the challenges of competing pedagogies and the conflicting identities of a liberal and a traditional practitioner. The third story recounts her identity crisis when she tried to put into practice liberal assumptions in parenting her daughter. The last story relates the critical incident that led to Feng's self-exclusion from the community. The research findings indicate that teachers need to shift their identities to adapt to the new work order in the workplace. This process is intertwined with a two-way trajectory of learning, which can be shaped and reshaped by various power relationships in the community. The research findings have brought important messages for administrators and teachers alike to deal with the new challenges in the workplace. The research has also highlighted the theoretical importance of recognising the social-ness, bi-directionality and power-enactment of teacher learning in communities of practice. (Contains 1 figure and 3 notes.)", "subject": "Communities of Practice, Language Teachers, Professional Identity, English (Second Language), Second Language Instruction, Foreign Countries, Inquiry, Educational Change, College Faculty, Child Rearing, Family Work Relationship, Global Approach, Political Attitudes, Personal Narratives, Career Choice, Power Structure, Ethnography, Semi Structured Interviews", "source": "Research Papers in Education", "publicationdateyear": 2013, "identifiersgeo": "China"}, {"title": "Impact of Intensive Reading Strategy on English for Specific Purposes College Students&apos; in Developing Vocabulary", "author": "Khazaal, Edhah Numan", "description": "The study aims to find out the impact of intensive reading strategy on English for specific purposes college students' in developing vocabulary. To achieve the aim of the study, 40 ESP College students were randomly chosen from the college of political sciences at A-Nahrain University in Iraq, the participants were in the second grade during the academic year 2017-2018. Two groups were enrolled in this experiment, 20 ESP students in the experimental group and the same number in the control group. To determine if the intensive reading strategy had an impact on ESP student's in developing vocabulary, a pre-posttest was administered for both groups. The control group was treated by the traditional way of teaching vocabulary through translating the words in Arabic language and memorizing them with the help of the teacher, while the experimental group was treated by using intensive reading strategy for about ten weeks. The chosen texts were taken from (New Head way Pre-intermediate student's book). Fill in the blank exercises had been chosen in the pre-posttest which consist of 50 items for each, the test was administered by the researcher. Based on the findings of this research, it was found that the new strategy has a positive impact on ESP College students' in mastering vocabulary that was proven from the improvement of students' mean score from pretest to posttest. Based on the results gained; it is recommended that intensive reading strategy can play a great role in mastering vocabulary.", "subject": "Reading Strategies, Teaching Methods, English for Special Purposes, Second Language Learning, Second Language Instruction, Comparative Analysis, Pretests Posttests, Vocabulary Development, College Students, Political Science, Translation, Semitic Languages, Foreign Countries, Student Improvement, Language Tests", "source": "Arab World English Journal", "publicationdateyear": 2019, "identifiersgeo": "Iraq"}, {"title": "Inspiring Dialogue: Talking to Learn in the English Classroom. Language and Literacy Series", "author": "Juzwik, Mary M., Borsheim-Black, Carlin, Caughlan, Samantha B., Heintz, Anne E.", "description": "&quot;Inspiring Dialogue&quot; helps new English teachers make dialogic teaching practices a central part of their development as teachers, while also supporting veteran teachers who would like new ideas for inspiring talk in their classrooms. Chapter by chapter, the book follows novice teachers as they build a repertoire of practices for planning for, carrying out, and assessing their efforts at dialogic teaching across the secondary English curriculum. The text also covers dialogic teacher learning communities through video study and discourse analysis. Providing a thorough discussion of the benefits of dialogic curriculum in meeting the objectives of the Common Core State Standards, this book with its companion website is an ideal resource for teacher development. This book features: (1) Dialogic tools for step-by-step planning within a lesson, over the course of a unit, or during an entire academic year; (2) A user-friendly, interactive layout designed for new teachers who are pressed for time; (3) Classroom examples addressing the challenges English teachers may face in stimulating rich learning talk in an era of standardization; and (4) A companion website with additional examples, activities, and course material. [Foreword written by Martin Nystrand.]", "subject": "English (Second Language), Second Language Instruction, Teaching Methods, Language Teachers, Interpersonal Communication, Beginning Teachers, Secondary Education, Dialogs (Language), Common Core State Standards", "source": "Teachers College Press", "publicationdateyear": 2013, "identifiersgeo": null}, {"title": "EFL Students&apos; Difficulties with Lexical and Syntactic Features of News Headlines and News Stories", "author": "Al-Jarf, Reima", "description": "Sixty-eight undergraduate translation students received direct instruction in the features of news headlines and news stories. A week later, they took a test that required them to identify the syntactic and lexical features of a sample of news headlines and news stories, supply deleted word, and substitute punctuation marks, infinitives, and block language by their meanings. Results showed that 75% of the subjects could identify initials, 72% recognized surnames and infinitives used instead of the &quot;future&quot;, 51% recognized deleted articles, 49% identified block language, 21% identified passive without agent, 19% recognized instances were verb &quot;to be&quot; was deleted, and 6% identified ellipted words. Incorrect responses revealed syntactic and semantic/lexical problems, lack of knowledge of current world events, and insufficient ability to apply features of newspaper language to news headlines and news stories unseen before. To help students read and comprehend news headlines and news stories, pedagogical implications are given.", "subject": "Undergraduate Students, Translation, Second Language Learning, Second Language Instruction, English (Second Language), News Reporting, Punctuation, Language Processing, Language Usage, Vocabulary, Semantics, Current Events, Knowledge Level, Teaching Methods, Verbs, Form Classes (Languages), Error Analysis (Language), Identification, Written Language, Direct Instruction, Females, Arabs, Foreign Countries", "source": "Online Submission", "publicationdateyear": 2021, "identifiersgeo": "Saudi Arabia"}, {"title": "On the Nature of Interaction in SLA: A Philosophical Stream", "author": "Maftoon, Parviz, Shakouri, Nima", "description": "Researchers have long grappled with situating the stance of interaction in SLA, but it is only recently that interaction has begun to receive consideration from SLA quarters. Delving into the nature of interaction and the prerequisite of interaction in real world, in general, and in classroom, in particular, the authors hold that based on different perspectives of interaction, interaction can be placed into diverse philosophical stances and has a prominent role in second language classrooms. To the present writers, provided that second language teachers have good grasp of the philosophy of interaction, its pedagogical implications in the class will be more purposeful.", "subject": "Interaction, Second Language Learning, Second Language Instruction, Role, Educational Philosophy, Teaching Methods, Classroom Communication, Linguistic Input, Linguistic Theory, Sociocultural Patterns, Dialogs (Language)", "source": "English Language Teaching", "publicationdateyear": 2013, "identifiersgeo": null}, {"title": "Teachers&apos; Perceptions of Open Educational Resources: The Case of Open Resources for English Language Teaching (ORELT) in Kenya", "author": "Orwenjo, Daniel Ochieng, Erastus, Fridah Kanana", "description": "The use of Open Educational Resources (OERs) in the teaching and learning of various subjects is a relatively new innovation in the Kenyan school system. With the advent and subsequent liberalisation of ICT, material developers are subsequently shifting away from the traditional modes of material development in the form of textbooks and other &quot;canonical&quot; formats which require the teacher to use them as they are handed down without any input or modification. The Open Resources for English Language Teaching (ORELT) is one such educational innovation. This paper reports the findings of a baseline survey conducted in Kenya with a view to finding out the views and perceptions of Kenyan Junior Secondary School Teachers with regard to the adoption of open resources for the teaching of English language in Kenyan secondary schools. Sixty (60) JSS teachers of English from rural and urban schools and of mixed gender were invited for a four day ORELT in-service induction workshop at the Kenyatta University Conference Centre. The teachers were then given ORELT materials in the form of CDs and textbooks for use in teaching English in their schools. They were also registered on the online ORELT platform and each given log in credentials to enable them freely to access the materials and freely interact with fellow teachers throughout the Commonwealth. The study reports that whereas teachers are ready to embrace the use of open resources, they have varying perceptions on the suitability and potential efficacy of open resources in Kenyan classrooms. It also emerges that such differing perceptions are constrained by institutional, cultural, pedagogical and personal factors. Accordingly, the study recommends a more structured, inclusive bottom-up approach to any educational innovation as a means of ensuring success.", "subject": "Foreign Countries, Open Educational Resources, English (Second Language), Second Language Instruction, Teacher Attitudes, Secondary School Teachers, Cultural Influences, Teacher Characteristics, Institutional Characteristics, Rural Schools, Urban Schools, Costs, Instructional Materials, Time Management, Educational Technology, Technology Uses in Education, Educational Quality", "source": "Journal of Learning for Development", "publicationdateyear": 2021, "identifiersgeo": "Kenya"}, {"title": "Dynamic Assessment and Second Language Development", "author": "Poehner, Matthew E., Wang, Zhaoyu", "description": "This timeline is concerned with Dynamic Assessment (henceforth, DA) as it has been taken up and elaborated in contexts involving the teaching, learning, and assessment of learners of second languages (L2s). DA is distinguished by its insistence that an individual's independent performance of assessment tasks reveals only part of his/her abilities, namely those that have completed their development at the time of the assessment; insights into abilities that have begun to emerge but have not yet fully developed can be determined according to an individual's responsiveness to particular kinds of support, referred to as mediation (e.g., reminders, leading questions, hints, provision of a model, feedback), offered during the assessment as difficulties arise (Haywood &amp; Lidz, 2006). In this respect, DA differs from more conventional distinctions in assessment, such as that between assessments concerned with the results of previous learning ('summative assessment') and those intended to provide information relevant to subsequent instruction ('formative assessment'). Instead, the embedding of an interactive, instructional element within the assessment procedure allows for the possibility of expanding the evidential basis upon which summative interpretations of learner abilities are made; that is, the results encompass previous learning that has resulted in both complete and partial understanding of relevant concepts. At the same time, DA serves a formative function in so far as interaction allows insights into the underlying sources of learner difficulties and the kind of support to which they are most responsive (Sternberg &amp; Grigorenko, 2002).", "subject": "Alternative Assessment, Second Language Learning, Student Evaluation, Performance Based Assessment, Summative Evaluation, Formative Evaluation, Learning Problems", "source": "Language Teaching", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Interculturality in Online Learning: Instructor and Student Accommodations", "author": "Sadykova, Gulnara, Meskill, Carla", "description": "As more distance education courses broaden their reach across borders, the chances of online classes being multicultural are high. This means that more often students may find themselves in courses designed for and by a host culture that differs from their own regarding its approach to teaching and learning. Compounding the difficulties inherent in a novel cultural environment and its unfamiliar forms of academic discourse are challenges represented by the medium itself. This yearlong case study examines the experiences and reflections of a Chinese graduate student and her U.S. instructor--specifically, the accommodations both made to mediate differences and mitigate these challenges. Analyses suggest that when both parties take differences into account and exercise thoughtful accommodations relative to both the challenges of the online medium and language socialization, positive learning experiences can result.", "subject": "Distance Education, Teacher Student Relationship, Online Courses, Cultural Pluralism, Teaching Methods, Learning Processes, Cultural Differences, Academic Language, Graduate Students, College Faculty, Asians, Females, Case Studies, Computer Mediated Communication, Learning Experience, Foreign Students, Socialization, Language Variation, Masters Programs, English (Second Language), Second Language Learning, Second Language Instruction, Teacher Education Programs", "source": "Online Learning", "publicationdateyear": 2019, "identifiersgeo": null}, {"title": "Recent Research on the Relative Efficiency of Speaker and Listener Instruction for Children with Autism Spectrum Disorder", "author": "Contreras, Bethany P., Cooper, Alison J., Kahng, SungWoo", "description": "The traditional recommendation for sequencing speaker and listener instruction has been to teach listener skills prior to teaching speaker skills. In a review of the research literature prior to 2011, Petursdottir and Carr (2011) concluded that research did not support this recommendation. We reviewed the most recent research on the efficiency of skill acquisition during speaker and listener instruction and found similar results to Petursdottir and Carr. Recommendations for future research and practice are provided.", "subject": "Efficiency, Listening Skills, Speech Skills, Skill Development, Speech Instruction, Language Acquisition, Expressive Language, Children, Autism, Pervasive Developmental Disorders", "source": "Journal of Applied Behavior Analysis", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "Integrating Corpus Linguistics into Online Language Teacher Education Programs", "author": "Ebrahimi, Alice, Faghih, Esmail", "description": "This study reports on a qualitative study which explored 32 pre-service teachers' evaluations of two online seven-week introductory courses in corpus linguistics (CL). Data were gathered through questionnaires, participants' written journals, post-course semi-structured email interviews, and discussion forum entries. The qualitative analysis of data revealed that for successful integration of CL into online language teacher education programs, several procedures should be employed. These include: providing the necessary technological infrastructure in educational settings; incorporating CL instruction in initial stages of language teacher education degree programs and extending it throughout the whole curriculum; focusing more on the practical aspects of CL with much emphasis placed on the necessary pedagogical knowledge and skills for successful exploitation of CL; introducing user-friendly tools and encouraging indirect use of corpora in the absence of necessary technological facilities; providing adequate and effective instructional materials (text-based reading materials, screen capture videos, hands-on activities, etc.) along with sufficient instructor support; and encouraging the participants to reflect on the approach critically. The findings may promise implications for language teacher educators to effectively introduce CL to student teachers in virtual learning environments.", "subject": "Online Courses, Computational Linguistics, Language Teachers, Second Language Learning, Second Language Instruction, Questionnaires, Teacher Education Programs, Teaching Methods, Introductory Courses, Qualitative Research, Preservice Teachers, Course Evaluation, Semi Structured Interviews, Computer Mediated Communication, Pedagogical Content Knowledge, Usability, Instructional Materials, Student Teachers, Interviews, Journal Writing, Student Attitudes", "source": "ReCALL", "publicationdateyear": 2017, "identifiersgeo": null}, {"title": "A Study of ESL Students&apos; Perceptions of Their Digital Reading", "author": "Gilbert, John", "description": "While research has increasingly been focused on second language reading, it has primarily been centered on how the learner interacts and decodes printed text. However, there has been minimal research conducted on how the English language learner processes web text, navigates the Internet, or evaluates and comprehends what he/she is reading through the use of digital literacy skills. The intention of this study was to gain insight into the online reading strategies of English language learners in order to explore if there was a need for the English as a Second Language (ESL) profession to teach digital literacy in the language classroom. The present study examines the metacognitive online reading strategies of intermediate and upper intermediate ESL students. Data were drawn from the researcher's observation notes, interviews with the participants, group discussions, and participant journals. The research methodology for the study was interpretive and qualitative. The findings suggest that language learners engage in characteristically different reading practices and strategies when reading web text and that there is a need for digital literacy skills to be taught in conjunction with the development of traditional literacy skills in the target language.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Teaching Methods, Technological Literacy, Student Attitudes, Reading Processes, Reading Comprehension, Reading Strategies, Metacognition, Observation, Interviews, Group Discussion, Diaries, Internet, Printed Materials, Reading Research, Adult Education, Information Technology, Search Engines, Misconceptions", "source": "Reading Matrix: An International Online Journal", "publicationdateyear": 2017, "identifiersgeo": "Virginia"}, {"title": "Developing and Validating Professional Teaching Standards for Higher Education EFL Instructors in Saudi Arabia: A Delphi Study", "author": "Alsowat, Hamad H.", "description": "This study aimed at developing and validating professional teaching standards for higher education EFL instructors in Saudi Arabia. The Delphi technique was utilized to gain a consensus among the panel of experts through three rounds. In the first round, a survey was sent to 31 English language teaching and teacher education experts to select the appropriate standards and provide any additional standards. Ninety-six performance indicators were generated at the end of this round. In the second round, the survey was sent to 29 experts to rate their responses on a 5-point Likert scale. In the third round, the survey was sent back to the experts to review their responses and provide any modifications. By the end of the third round, eighty-one performance indicators were identified and categorized into seven standard fields: language, knowledge of learners, learning environments, instruction, technology use, assessment, and professionalism. The study reveals insight into the professional standards which are appropriate for higher education EFL instructors in Saudi Arabia. This framework will help improve faculty teaching practices and for their continuous professional development.", "subject": "Professionalism, Standards, Language Teachers, Second Language Learning, Second Language Instruction, English (Second Language), Foreign Countries, Higher Education, Teacher Attitudes, Faculty Development, Likert Scales, Classification, Pedagogical Content Knowledge, Knowledge Base for Teaching, Language Proficiency, Technological Literacy, College Faculty, Teaching Methods, Evaluation Methods, Specialists", "source": "Advances in Language and Literary Studies", "publicationdateyear": 2021, "identifiersgeo": "Saudi Arabia"}, {"title": "Developing L2 Productive Language Skills Online and the Strategic Use of Instructional Tools", "author": "Payne, J. Scott", "description": "Sequencing language production activities based on the inherent cognitive load of each activity type can improve student performance and self-efficacy on high cognitive load language tasks like conversational speech (either face-to-face or via video chat). This ordering according to cognitive difficulty can scaffold learners in their development of second language (L2) productive skills. This article provides a research-based rationale for this approach and includes several practical suggestions for how to design a rigorous and engaging online language course.", "subject": "Second Language Learning, Second Language Instruction, Online Courses, Instructional Design, Scaffolding (Teaching Technique), Teaching Methods, Expressive Language, Self Efficacy, Task Analysis, Difficulty Level, Cognitive Ability, Video Technology, Computer Mediated Communication, Speech Communication, Learning Strategies, Skill Development", "source": "Foreign Language Annals", "publicationdateyear": 2020, "identifiersgeo": null}, {"title": "Primary Teachers&apos; Use of Communicative Strategies for Linguistically Diverse Learners: A Cross-Cultural Case Study", "author": "Mongillo, Geraldine, Feola, Dorothy, Kaplan, Rochelle Goldberg, Vaknin, Vered, Abbas, Randa", "description": "The purpose of this study was to investigate the use of communicative strategies employed by two primary grade teachers whose students' home language differed from the language of instruction. The communicative strategies examined included verbal, gestural, and other visual modes of interaction within classroom discourse to promote student learning. One school we studied was in Northern Israel and one was in New Jersey in the US. In Israel, the teacher taught using formal Modern Standard Arabic while the children were familiar only with Spoken Arabic. In New Jersey, the teacher taught using English while the students were largely from Spanish-speaking homes. Neither teacher had special training in working with diverse language learners. Findings generated two major categories of communicative strategies utilized by both teachers: &quot;Concretization&quot; of abstract concepts and &quot;Situational Language Use.&quot; The significance of this study is that it addresses the need identified by practitioners and researchers worldwide for improved literacy and mathematics teaching and learning for diverse language learners.", "subject": "Foreign Countries, Elementary School Teachers, English (Second Language), Second Language Instruction, Second Language Learning, Language Usage, Spanish Speaking, Communication Strategies, Cross Cultural Studies, Semitic Languages, Language of Instruction, Native Language, Teaching Methods, Teacher Student Relationship, Elementary School Students, Standard Spoken Usage, Language Variation, Case Studies", "source": "Language and Literacy Spectrum", "publicationdateyear": 2019, "identifiersgeo": "Israel, New Jersey"}, {"title": "Korean Culinary College Students&apos; Desired Careers and English Proficiency Needs", "author": "Kim, Kitaek, Joo, Kum-Jeong", "description": "This paper explores the English needs of culinary college students in Korea, asking whether their English needs differ by their desired careers. To this end, we administered a survey to 123 culinary college students and divided them into six groups based on their desired careers. The results show that the type of desired career of the participants is highly correlated with their perceived need for learning English, the kind of English skills that they want to learn, and the level of English proficiency that they hope to achieve. For example, students planning to work for a restaurant or hotel abroad had the highest English proficiency needs whereas those planning to study in graduate school in Korea and those planning to work for a restaurant or hotel in Korea had relatively lower needs. The results suggest that college English programs need to provide diverse college English courses to prepare students for their diverse future careers.", "subject": "Food Service, Service Occupations, Cooking Instruction, Undergraduate Students, Student Attitudes, Second Language Learning, Second Language Instruction, English (Second Language), English for Special Purposes, Foreign Countries, Language Skills, Language Proficiency, Graduate Study, Career Choice, Student Surveys, Correlation, Work Environment, Dining Facilities, Hospitality Occupations", "source": "English Teaching", "publicationdateyear": 2018, "identifiersgeo": "South Korea"}, {"title": "Introducing Phonics to Learners Who Struggle: Content and Embedded Cognitive Elements", "author": "Vadasy, Patricia F., Sanders, Elizabeth A.", "description": "A brief experiment was designed to examine cognitive flexibility practice embedded in beginning phonics instruction for kindergarteners with limited early literacy learning. Previously tested phonics content included single- and high-frequency two-letter grapheme-phoneme correspondences (GPCs), introduced at a rate of 2-4 correspondences per week. Children entered with minimal alphabet knowledge and were randomly assigned within classrooms, stratified by English Learner status, to one of two conditions delivered individually over 6 weeks: plain explicit phonics (n = 35) or Flex instruction (n = 33) which covered the same Plain phonics content but with teaching tasks for practice switching letter or word dimensions. Results showed that kindergarteners in the Plain condition made significantly greater gains on tasks of writing taught letter-sound correspondences and spelling. Findings inform a rate for introducing letter-sound correspondences and learning of mixed-size GPCs. The Plain explicit phonics focus on initial accuracy had benefits for encoding taught letter correspondences. Findings support future research on effective tasks to develop reading-related cognitive flexibility in beginners, the optimal timing of this practice, and whether it benefits in particular those children most at risk for acquiring this foundational alphabetic knowledge. [For the corresponding grantee submission, see ED612111.]", "subject": "Phonics, Alphabets, Cognitive Ability, Emergent Literacy, Literacy Education, Phoneme Grapheme Correspondence, English Language Learners, Kindergarten, Spelling, Educational Benefits, Teaching Methods", "source": "Reading and Writing: An Interdisciplinary Journal", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Needs Analysis on Indonesian Language Learning Materials about Agriculture for Foreign Speakers", "author": "Defina, Rasyid, Yumna, Ridwan, Sakura", "description": "The aim of this research was to analyze the needs on integrative content-based Indonesian language learning materials about agriculture for foreign speakers A2 level. Research and development design was used employing the Dick and Carey's model combined with Borg and Gall's model, as well as the model of learning materials development proposed by Tomlinson, Brown, and Jolly and Bolitho. This research was conducted during the foreign students Indonesian course, Bogor Agricultural University on academic year 2015-2017. The procedure comprised: pre-study, students' and teachers' needs analysis on teaching materials at BIPA IPB. The findings indicated that the teaching materials about agriculture are not available yet at IPB. Besides, the needs on integrative content-based Indonesian language learning materials about agriculture for students at A2 level and the teachers were indicated high. Therefore, Indonesian language teaching material is needed for foreigners specifically for agriculture.", "subject": "Foreign Countries, Second Language Learning, Second Language Instruction, Material Development, Instructional Materials, Agricultural Education, Foreign Students, Indonesian, Content and Language Integrated Learning, Teaching Methods, Universities, Course Descriptions", "source": "Journal of Education and Learning (EduLearn)", "publicationdateyear": 2019, "identifiersgeo": "Indonesia"}, {"title": "Language Learning in Mindbodyworld: A Sociocognitive Approach to Second Language Acquisition", "author": "Atkinson, Dwight", "description": "Based on recent research in cognitive science, interaction, and second language acquisition (SLA), I describe a sociocognitive approach to SLA. This approach adopts a &quot;non-cognitivist&quot; view of cognition: Instead of an isolated computational process in which input is extracted from the environment and used to build elaborate internal knowledge representations, cognition is seen as &quot;adaptive intelligence,&quot; enabling our close and sensitive alignment to our ecosocial environment in order to survive in it. Mind, body, and world are thus functionally integrated from a sociocognitive perspective instead of radically separated. Learning plays a major part in this scenario: If environments are ever-changing, then adaptation to them is continuous. Learning is part of our natural ability to so adapt, while retaining traces of that adaptation in the integrated mind-body-world system. Viewed in this way, SLA is adaptation to/engagement with L2 environments. &quot;Interaction&quot; also plays a central role in sociocognitive SLA: We learn L2s through interacting with/in L2 environments. Founded on innate, universal skills which evolutionarily &quot;preceded&quot; language and make it possible, interaction supports SLA at every turn. Having presented this argument, I illustrate it by analyzing a video clip of an EFL tutoring session, indicating various &quot;sociocognitive tools&quot; for interactive alignment which undergird L2 development.", "subject": "Second Language Learning, Language Research, Cognitive Science, Intelligence, Social Cognition, Learning Processes, Interaction, Video Technology, English (Second Language), Second Language Instruction, Tutoring", "source": "Language Teaching", "publicationdateyear": 2014, "identifiersgeo": null}, {"title": "Differences in Early Literacy Achievement for English Language Learners: Analyzing Performance between Transitional and Dual Language Bilingual Programs", "author": "Rapp, Lori DeAnn", "description": "The current study compared the difference in literacy achievement of students in grades K-3 between the four different bilingual program models allowed in Texas for supporting English Language Learners (ELLs). The purpose of this quantitative study focused on the difference in literacy achievement of English Language Learners (ELLs) in kindergarten through third grade who were participating in transitional/early-exit, transitional/late-exit, dual language/one-way, or dual language-two way bilingual programs. Analysis of literacy performance for students in Kindergarten through second grade consisted of using a Chi-Square test of Independence to determine if the type of bilingual program influenced whether students were reading on grade level. A one-way ANOVA statistical test indicated if there was a relationship between bilingual program and third grade Reading STAAR scores for ELLs. Results indicated that ELLs in dual language two-way, one-way, and transitional late exit, in first through third grade, experience higher literacy levels of achievement than ELLs in transitional early exit bilingual programs. Information from the current study provides valuable guidance to local school districts when selecting from the various program models to meet the needs of English Language Learners. [The dissertation citations contained here are published with the permission of ProQuest LLC. Further reproduction is prohibited without permission. Copies of dissertations may be obtained by Telephone (800) 1-800-521-0600. Web page: http://www.proquest.com/en-US/products/dissertations/individuals.shtml.]", "subject": "English Language Learners, Elementary School Students, Comparative Analysis, Bilingual Education Programs, Statistical Analysis, Kindergarten, School Districts, Outcomes of Education, Transitional Programs, Reading Tests, Scores, Reading Achievement, Student Needs, Correlation, Literacy Education, Teaching Methods, Second Language Learning, Second Language Instruction, Native Language, Language of Instruction", "source": "ProQuest LLC", "publicationdateyear": 2017, "identifiersgeo": "Texas"}, {"title": "Middle Level Preservice Teachers Experience a Natural History Arts-Integrated Interdisciplinary Thematic Unit", "author": "Weber, Carolyn A., Rule, Audrey C.", "description": "Curricular demands and best practices for middle school require interdisciplinary units. Arts integration can provide motivation and a new pathway to learning. This unit focused on inquiry into the natural history of artifacts and rocks recovered from the exposed subsoil of an area near Cedar Falls, Iowa that had been bulldozed as part of subdivision development. The described unit involved preservice teachers in exploration of all subject areas (language arts, mathematics, science, and social studies) with arts-integrated projects (agate watercolor painting, stone tool graphing, acrylic polymer clay agate keyring making, and stone tool drawings). The content area activities for social studies included identification and lifestyle interpretation of stone tools found intermixed with rocks and sand in the subsoil of the site. Science content activities included identification of rocks (igneous and metamorphic rocks; quartz nodules, geodes, and agates; and iron ore specimens) from the site along with interpretation of basalt cobbles that had been ground flat as glacially transported, and interpretation of maps and diagrams of glaciation, iron ore deposits, and agate deposits. Language arts activities involved word study through morpheme analysis of words such as &quot;anthropology&quot; and &quot;artifact&quot; along with matching a set of descriptive adjectives to objects related to agates. Mathematics content activities focused on graphing. Preservice teachers were highly engaged in the activities, remarking that they learned new content and pedagogy. Some expressed lack of confidence regarding artistic ability because of little experience and the desire to complete everything in the correct manner. At the end of the lessons, preservice teachers expressed that teaching the content through themes allowed for a great number of connections between subject areas, increased real-life connections, and deeper understandings of the topics.", "subject": "Preservice Teachers, Middle School Teachers, Interdisciplinary Approach, Preservice Teacher Education, History Instruction, Art Activities, Language Arts, Mathematics Instruction, Science Instruction, Social Studies, Learning Activities, Observation", "source": "Journal of STEM Arts, Crafts, and Constructions", "publicationdateyear": 2017, "identifiersgeo": "Iowa"}, {"title": "Hopefulness for Teachers of ELLs in the Era of NCLB", "author": "Colombo, Michaela, McMakin, Deborah, Jacobs, Cynthia, Shestok, Carol", "description": "In this article the authors explore the role of critical hope as an essential quality in teachers' preparation to teach English Language Learners (ELLs) in the era of No Child Left Behind. The authors found that high stakes testing with inappropriate measures combined with teachers' lack of preparation to teach ELLs resulted in a downward spiral in hopefulness.", "subject": "Teacher Education, Teacher Effectiveness, English (Second Language), Second Language Instruction, Second Language Learning, English Language Learners, High Stakes Tests, Federal Legislation, Teacher Attitudes, Interviews, Middle School Teachers, Teaching Methods, Resource Allocation, Parent Teacher Cooperation, Teaching Experience, Educational Objectives, Qualitative Research", "source": "Multicultural Perspectives", "publicationdateyear": 2013, "identifiersgeo": "Massachusetts"}, {"title": "Social-Emotional Learning in the English Language Classroom: Fostering Growth, Self-Care, and Independence", "author": "Herrera, Luis Javier Pentón, Martinez-Alba, Gilda", "description": "While social and emotional learning (SEL) is becoming increasing critical for learners' success, teachers often feel unprepared to incorporate or address it in their classrooms. This book serves as a practical, concise, and easy-to-follow reference that English language teachers in K-12 and adult education and English language teacher educators can use in their classrooms. It is one of the limited emerging SEL resources available that is tailored to the English language teaching field and contributes to filling the existing gap of SEL in English language education. Teachers will be equipped with the necessary knowledge and skills to practice self-care and be confident in implementing SEL in their learning spaces to support and benefit their learners.", "subject": "Social Emotional Learning, English (Second Language), Second Language Learning, Second Language Instruction, Language Teachers, Teaching Methods, Kindergarten, Elementary Secondary Education, Adult Education, Teacher Educators, Daily Living Skills, Pedagogical Content Knowledge, Professional Autonomy", "source": "TESOL Press", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Past vs Previous in EFL Teaching of L1 Slavic Students", "author": "Szewel, Anatol", "description": "In Germanic and Slavic languages, the Verb is the most extensive grammatical item, which causes most of the troubles for second language learners. It has been noticed that Slavic L1 learners of English make mistakes in using verb forms due to the transfer of their L1 grammatical system (grammar concepts) onto the English language. The goal of the paper is to show how the wording of grammatical explanations in English influences the conceptualisation of grammatical items. The paper refers to one of the most probable sources of such misunderstanding -- the way grammatical forms are named and explained in frequently used course books and grammars of English, which leads to a corrupted or limited understanding of the functionality of a grammatical form in L1 Slavic learners. The practical clues presented below might be beneficial for authors of course-books, FL language teachers and teacher trainers in solving the dilemma between the implicit vs explicit approach to teaching grammar, in constructing concept questions and formulating clear explanations in class.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Slavic Languages, Transfer of Training, Native Language, Grammar, Verbs, Interference (Language), Textbooks, Teaching Methods, Communicative Competence (Languages), Form Classes (Languages), Polish, Contrastive Linguistics, Syntax, Linguistic Theory, Russian", "source": "Language Teaching Research Quarterly", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Instructional Practices for Scaffolding Emergent Bilinguals&apos; Comprehension of Informational Science Texts", "author": "Symons, Carrie", "description": "In the telling case presented here, the instructional practices an exemplary teacher used to scaffold fourth-grade emergent bilinguals' comprehension of a challenging informational science text are identified, analyzed, and discussed. Data sources included observation field notes, video and audio recording of 11 hours of instruction, the teacher's post-teaching written reflection log, and two interviews. The findings yielded from systematic, iterative qualitative data analysis and constant comparative methods suggest that in the context of text-based discussions with informational texts, teachers can employ an array of instructional practices to scaffold emergent bilinguals' construction of conceptual understanding. In particular, iterative readings, explicit attention to language, and engagement with multimodal representations of core concepts can create multiple opportunities for students' analysis of both the language and meaning in informational science texts.", "subject": "Teaching Methods, Scaffolding (Teaching Technique), Bilingualism, Grade 4, Elementary School Students, Video Technology, Audio Equipment, Diaries, Teacher Attitudes, Concept Formation, Multimedia Instruction, Reading Comprehension, Discussion (Teaching Technique), Science Instruction, Content Area Reading, Language Usage, English (Second Language), Second Language Learning, Grounded Theory, Classroom Communication, Grammar, Metalinguistics, Scientific Concepts, Visual Aids, Teacher Student Relationship, Learner Engagement", "source": "Pedagogies: An International Journal", "publicationdateyear": 2021, "identifiersgeo": null}, {"title": "Evaluation of English Results Course Books at Upper-Intermediate Level", "author": "Haghi, Eshrat Bazarmaj", "description": "The importance of the course books in language teaching leads the way to the evaluation of them. Evaluating the teaching materials specially course books can help teachers to understand more about language learning. The purpose of the present study is to evaluate English Results course books which are widely used at Iranian institutes. The focus of the study is on the course books used at advanced lined and evaluating their physical make-up, practical concerns and different sections of them namely vocabulary, reading, grammar, language functions and pronunciation practice.100 teachers from six different institutes participated in the study and completed the questionnaire which was prepared by Hashemi and Rahimpour (2011) for textbook selection and evaluation in EFL context. Results revealed that the course books were generally regarded as appropriate materials. Finally, several suggestions were mentioned for adding to the quality of the course books.", "subject": "Textbooks, English (Second Language), College Instruction, Second Language Instruction, Foreign Countries, Vocabulary Development, Reading Materials, Grammar, Language Usage, Language Skills, Pronunciation, College Faculty, Language Teachers, Questionnaires, Textbook Evaluation, Textbook Content", "source": "Journal on English Language Teaching", "publicationdateyear": 2013, "identifiersgeo": "Iran"}, {"title": "The Impact of Online Autonomous Learning on EFL Students&apos; Reading Skills", "author": "Shang, Hui-Fang, Chen, Yen-Yu", "description": "With the rapid growth of technology, many language acquisition approaches have been added to computer-assisted language learning applications. Thus, this study investigated the impact of online autonomous learning on English as a Foreign Language (EFL) students' reading ability. Sixty-five students from two reading classes at One University in Southern Taiwan were divided into an experimental group (integration of online reading and teacher-guided intervention) and a control group (teacher-guided intervention). The results demonstrated that there was a significant difference in the reading scores between the experimental and control groups. A significant difference was also found between the pre- and post-test scores in the experimental group; however, this pre- and post-test difference was not observed in the control group. Students in the experimental group also noted an obvious enhancement to their reading due to the requisite planning, monitoring, and evaluating activities practiced during online learning. Based on the research results, suggestions for future study are discussed.", "subject": "English (Second Language), Second Language Learning, Second Language Instruction, Computer Assisted Instruction, Reading Ability, Foreign Countries, Control Groups, Experimental Groups, Teaching Methods, Independent Study, Scores, Reading Tests, Comparative Analysis, Online Courses, Majors (Students), College Students, Reading Comprehension, Semi Structured Interviews, Questionnaires, Intervention, Pretests Posttests, Statistical Analysis", "source": "International Journal on E-Learning", "publicationdateyear": 2018, "identifiersgeo": "Taiwan"}, {"title": "The Effects of Articulatory Gestures on L2 Pronunciation Learning: A Classroom-Based Study", "author": "Li, Ying, Somlak, Taylor", "description": "Research on second-language (L2) speech acquisition suggests that audio-visual aids could be effective in helping learners acquire difficult L2 speech sounds (Li, 2016a). However, most previous studies have been restricted to laboratory settings rather than the classroom environment. The present study, therefore, was designed to fill this knowledge gap by analysing the effectiveness of audio-visual aids, particularly articulatory gestures, in teaching L2 speech sounds in actual classrooms. The participants were students from two classes of non-English majors who had severe difficulties with the differentiation of /[theta]/--/s/ and /[voiced dental fricative]/--/z/. 'Read-aloud' tasks were employed for pronunciation tests. The baseline data of the students' pronunciation of the two contrasts was collected with a pre-test, and the intuitive--imitative approach was adopted for teaching. Specifically, the students were exposed to seven audio- or audio-visually recorded poems (one poem per week over the course of seven weeks) containing the target contrasts. The students in Class 1 were taught with the audio-recordings without images of the speaker's face being displayed; in contrast, students in Class 2 were taught using audio-visual recordings, which allowed them to observe the speakers' articulatory gestures of /[theta]/--/s/ and /[voiced dental fricative]/--/z/. To detect the teaching effect, a post-test was carried out after the teaching programme was completed. A delayed post-test was conducted one month after the post-test. Comparisons with the respective pre-test results indicated that students in Class 2 had a significant improvement in the pronunciation of the target contrasts in the post-test, whereas those in Class 1 did not. In the delayed post-test, neither class showed any significant difference in the pronunciation performance in comparison with the post-test. The findings, therefore, confirmed the effectiveness of exposure to audio-visual aids in teaching L2 pronunciation.", "subject": "Articulation (Speech), Nonverbal Communication, Pronunciation, Language Tests, Teaching Methods, Poetry, Second Language Learning, Audiovisual Aids, Second Language Instruction, English (Second Language), Speech Communication, Nonmajors, Undergraduate Students, Pretests Posttests, Pronunciation Instruction, Instructional Materials, Foreign Countries", "source": "Language Teaching Research", "publicationdateyear": 2019, "identifiersgeo": "China"}, {"title": "Reader's Theater: An Alternative Tool to Develop Reading Fluency among Thai EFL Learners", "author": "Lekwilai, Panya", "description": "Fluency in reading is critical for becoming a successful reader and strongly correlates with reading comprehension. Fluency in reading refers to appropriate reading speed, accurate word recognition, appropriate phrasing, and appropriate expression when reading orally. Reader's Theater (RT) is a reading instructional method that requires readers to read aloud from scripts. It is recognized as a method that helps develop reading fluency of L1 and ESL/EFL learners of different levels of proficiency. RT also incentivizes and persuades learners to re-read the same text several times. This paper will explore the benefits of RT as well as suggestions about how it could be applied as an alternative tool for fluency instructions in the Thai EFL context.", "subject": "English (Second Language), Second Language Learning, Language Proficiency, Correlation, Reading Fluency, Second Language Instruction, Foreign Countries, Reading Comprehension, Word Recognition, Oral Reading, Theater Arts, Teaching Methods, Reading Instruction, Scripts, Language Teachers, Elementary Secondary Education, Higher Education", "source": "PASAA: Journal of Language Teaching and Learning in Thailand", "publicationdateyear": 2014, "identifiersgeo": "Thailand"}, {"title": "Scrutinizing Values-Based Education in Secondary Grade EFL Coursebooks", "author": "Ertürk, Gülsah Tikiz", "description": "The study aims to expand the understanding of values and values-based teaching in the English language teaching community by scrutinizing English as a foreign language (EFL) coursebooks and the secondary grade curriculum. This is a qualitative study with a document analysis design. The data in the form of EFL coursebooks were examined, interpreted and coded to elicit meaning and gain understanding about the presentation of values residing in four coursebooks. The results of the study indicated that the values presented in secondary level EFL coursebooks do not show an equal distribution and the target values serve the purpose of raising awareness of learners about different values rather than allowing them to understand, internalize and discuss these values at higher levels of learning, which makes the process only superficial. Integrating the teaching of values into the curriculum of language learning classes has been an area of interest in recent years and the Turkish Ministry of Education (MoNE) revised its curriculum in 2018 and textbooks were written in 2019 in accordance with the requirements of the national curricula. Detailed analysis of the teaching of values and their distribution in these coursebooks might help curriculum planners and coursebook writers as well as teachers.", "subject": "Values Education, Social Values, Moral Values, Secondary School Curriculum, High Schools, Textbook Content, National Curriculum, English (Second Language), Second Language Instruction, Foreign Countries, Instructional Materials", "source": "International Dialogues on Education: Past and Present", "publicationdateyear": 2020, "identifiersgeo": "Turkey"}, {"title": "Diversity and Inclusion of Culturally and Linguistically Diverse Students in K-12 Chinese Language Education", "author": "Lu, Xinyue, Troyan, Francis John", "description": "Chinese as a world language has gained popularity in US K-12 education over the past two decades. However, little attention has been paid to diverse populations in Chinese language classrooms and how the students' diverse cultural and linguistic backgrounds influence their experiences in Chinese programs. This article presents a research synthesis that examines cultural and linguistic diversity in US K-12 Chinese language education research. It reveals the tendency of the field to oversimplify culturally and linguistically diverse (CLD) students into dichotomous groups (i.e., Chinese speaking vs. English speaking) and the inequitable representation of CLD populations as well as the underrepresentation of their experiences in the curriculum. The findings suggest that there is a need for the Chinese language education field to engage in critical conversations on diversity, and to make Chinese language teaching more culturally relevant and sustainable to the diverse populations it serves.", "subject": "Foreign Countries, Elementary Secondary Education, Chinese, Second Language Instruction, Second Language Programs, Inclusion, Cultural Differences, Minority Group Students, Student Diversity, Multilingualism", "source": "Foreign Language Annals", "publicationdateyear": 2022, "identifiersgeo": "United States"}, {"title": "The Effects of Dynamic Strategic Math on English Language Learners&amp;apos; Word Problem Solving", "author": "Orosco, Michael J., Swanson, H. Lee, O'Connor, Rollanda, Lussier, Cathy", "description": "English language learners (ELLs) struggle with solving word problems for a number of reasons beyond math procedures or calculation challenges. As a result, ELLs may not only need math support but also reading and linguistic support. The purpose of this study was to assess the effectiveness of a math comprehension strategy called Dynamic Strategic Math (DSM) on word problem solving for Latino ELLs. The strategy provides performance-contingent feedback based on the student&amp;apos;s reading and language comprehension level. A multiple baseline design was used to assess 6 second-grade Latino ELLs at risk for math failure/math disability. As compared with the baseline phase, DSM increased word problem solving for all the participants. All students&amp;apos; level of performance was maintained during follow-up sessions. The results suggest the intervention facilitated math problem-solving performance. (Contains 3 tables and 3 figures.)", "subject": "English Language Learners, Mathematics Instruction, Comprehension, Teaching Methods, Word Problems (Mathematics), Problem Solving, Mathematics Skills, Hispanic American Students, Grade 2, Elementary School Mathematics, Disabilities, Intervention, Instructional Effectiveness, Learning Strategies, Reading Comprehension", "source": "Journal of Special Education", "publicationdateyear": 2013, "identifiersgeo": "California"}, {"title": "Iranian EFL Learners&apos; Perception of the English Verbs&apos; Argument Structure and Their Language Proficiency: A Semantic-Syntactic Approach", "author": "Akbarnezhad, Shima, Sadighi, Firooz, Bagheri, Mohammad Sadegh", "description": "Acquisition of verbs and their syntactic and semantic properties can act as the core of any sentence across languages. EFL learners encounter learnability problems in the perception of English verbs' argument structures manifested by different verbs. The current study aimed at investigating and diagnosing the problems Iranian EFL learners face when perceiving English verbs argument structures. A sample of 75 students majoring in English took part in this study. In order to answer the research questions, an Oxford Placement Test was conducted first to obtain three different proficiency levels: elementary, lower intermediate, and upper-intermediate. A Grammatical Judgment Test was administered one week after the test of proficiency to assess the learners' perception of English verbs argument structures. The data then were analyzed using descriptive statistics and also One-way ANOVA. The obtained results revealed that students with different proficiency levels perceived English verbs' argument structure differently and also they have encountered severe problems in perceiving transitive verbs, and the accomplishment type was the most problematic semantic categories in Iranian EFL learners' perception. More exposure to language input, explicit teaching of the argument structures along with their semantic and syntactic categories, and practicing in different contexts can improve the learners' knowledge of argument structures.", "subject": "Foreign Countries, English (Second Language), Second Language Instruction, Student Attitudes, Verbs, Language Proficiency, Semantics, Syntax, Undergraduate Students", "source": "Cogent Education", "publicationdateyear": 2019, "identifiersgeo": "Iran"}, {"title": "Cultural Threads in Three Primary Schools: Introducing a Critical Cosmopolitan Frame", "author": "Driscoll, Patricia, Holliday, Adrian", "description": "This paper explores headteachers' and teachers' perceptions of foreign languages(FL) and cultural learning in three primary schools in areas of disadvantage in England. Drawing upon a new theoretical frame for primary languages, Critical Cosmopolitanism (Delanty, 2006; Beck and Sznaider, 2006) and The Grammar of Culture (Holliday, 2018), we argue that the grand narrative of a target language inhabited by a target culture is outdated and approaches to cultural learning in primary schools could lead the way. There is substantial evidence that most learners find language lessons fun, particularly activities such as songs, stories and intercultural events (Driscoll et al., 2004, 2014; Cable et al. 2010). The discourse on conditions for inclusive practice is less commonplace and little is known about FL learning in areas of high deprivation (Nikolov &amp; Mihaljevic Djigunovic, 2011). Teachers and headteachers in this study were committed to cultural learning and staff adopted creative approaches to teaching. The findings, however, also indicate that traditional notions of a mono or homogenised national culture with associated stereotypes linger in teachers' framing of FL. There exists a need for a more personalised approach to cultural learning drawing upon children's own cultural experiences. Data was analysed thematically following strict ethical guidelines and all names were anonymised to ensure confidentiality.", "subject": "Teacher Attitudes, Second Language Learning, Second Language Instruction, Elementary School Teachers, Cultural Awareness, Teaching Methods, Disadvantaged Schools, Stereotypes, Administrator Attitudes, Elementary School Students, Foreign Countries, Ideology, Social Bias, Nationalism, Prosocial Behavior, Empathy, Creative Teaching", "source": "AILA Review", "publicationdateyear": 2019, "identifiersgeo": "United Kingdom (England)"}, {"title": "Assessing the Performance in EFL Teaching Practicum: Student Teachers' Views", "author": "Merç, Ali", "description": "This study aims to find out whether or not pre-service EFL teachers are satisfied with the way their performance in teaching practice is measured. A questionnaire was developed to elicit student teachers' views related to the components of the measurement policies employed in the two practicum courses at Anadolu University English Language Teacher Training program. 117 student teachers answered the questionnaire. 12 of them were interviewed to support the quantitative findings. The results of the analyses showed that majority of the students were satisfied with their grades in teaching practicum. Furthermore, student teachers found certain criterion measures as effective means for assessing their performance such as planning-preparation, general organization, and assessment by university supervisors while assessment by cooperating teachers, writing observation and reflection reports, and assessment by peer teachers were found to be the least effective ones. The findings are discussed considering the current measurement policies and certain other practices about teaching practicum component of teacher education programs. Some suggestions for university supervisors, cooperating teachers, student teachers, and all other parties related to teaching practicum are also provided.", "subject": "Foreign Countries, English (Second Language), English Instruction, Preservice Teachers, Practicums, Student Teacher Attitudes, Questionnaires, Preservice Teacher Education, Satisfaction, Grades (Scholastic), Student Evaluation, Statistical Analysis, Measures (Individuals), Semi Structured Interviews, Qualitative Research", "source": "International Journal of Higher Education", "publicationdateyear": 2015, "identifiersgeo": "Turkey"}, {"title": "&quot;We&apos;re Here to Learn to Speak French&quot;: An Exploration of World Language Teachers&apos; Beliefs about Students and Teaching", "author": "Baggett, Hannah Carson", "description": "The purpose of this qualitative study was to explore five world language teachers' beliefs about their students, their attributions about student enrollment, and their reported teaching practices. Findings represent a continuum of critical practice in that three teachers appeared to espouse deficit thinking and stereotypes about students of color, and color-evasiveness or colorblindness as an approach to teaching. Two teachers appeared to espouse beliefs that may be more representative of inclusive classrooms, and these teachers reported advocacy work for certain student groups and efforts to develop students' critical consciousness in their classrooms. Findings are contextualized via critical lenses, and implications for language teacher education and policy are discussed.", "subject": "Second Language Learning, Second Language Instruction, Language Teachers, Teacher Attitudes, Stereotypes, Teacher Student Relationship, Language Enrollment, Inclusion, Advocacy, Disadvantaged, Minority Group Students, Racial Bias, Teaching Methods, Public School Teachers, Cultural Pluralism", "source": "Educational Studies: Journal of the American Educational Studies Association", "publicationdateyear": 2018, "identifiersgeo": null}]